{
  "number": 1553,
  "type": "issue",
  "state": "open",
  "title": "[QUESTION] Multiple screens, scaling/DPI and issues with WinForms DPI awereness with SkiaSharp",
  "body": "Hello,\r\n\r\nTL;DR: Windows Forms recently new API call to set DPI-awereness, nowadays included in the standard VS template, affects SkiaSharp. To me, in an unexpected way that I just try to understand. I seek advice or some enlightment, not nescessarly solutions.\r\n\r\nThe longer story:\r\n\r\nHowever, beyond that, there are several challenges I have related to the very concept of my application. They are present regardless on how SkiaSharp work so I\u0027ll take them last.  I noticed that creating a project using VS Template for WinForms added a new line in \u0060Program.cs\u0060. It now looks like this out of the box:\r\n\r\n\u0060\u0060\u0060csharp\r\n\r\n    static class Program\r\n    {\r\n        /// \u003Csummary\u003E\r\n        ///  The main entry point for the application.\r\n        /// \u003C/summary\u003E\r\n        [STAThread]\r\n        static void Main()\r\n        {\r\n            Application.SetHighDpiMode(HighDpiMode.SystemAware);\r\n            Application.EnableVisualStyles();\r\n            Application.SetCompatibleTextRenderingDefault(false);\r\n            Application.Run(new PhiddleForm());\r\n        }\r\n    }\r\n\u0060\u0060\u0060\r\n\r\nThe first line is new (to me). This API call was introduced a year ago or so and previously it was needed to alter manifest to affect DPI mode. The reason I am here mentioning this at all, is that that line is what made my SkiaSharp render properly. Or at least I have narrowed it down to the fact that changing or even removing that line affects how SkiaSharp render.\r\n\r\nWhat seems to be affecting the behaviour too is using multiple screens. Which is not surprising since it\u0027s very likely that multiple screens might have different resolutions. Which in turn is rather significant when playing with DPI, scaling etc. What happens is that my transparency I use (by combining SkiaSharp and Windows Forms in this case) stops being transparent and I need to understand more about what\u0027s happening.\r\n\r\nI do not rule out that there might be a need for Skia or SkiaSharp to adress something but I honestly don\u0027t know. Still, I use SkiaSharp and I use it to make a Desktop app for Windows and Mac. The application implements a screen ruler-kind of functionality. Which relies on making it possible to show the desktop and whatever applications/windows that are \u0022beneath\u0022 my app. This is where things get tricky and this is the reason I use WinForms component of SkiaSharp at all. Couldn\u0027t get it to work with other variants (Xamarin, UPF).\r\n\r\nSince I want to measure screen pixels a basic question will arise: what exactly do I want to measure? In the world of physical resolutions (and if you ask, most people will answer): pixels. But what if the screen use scaling? What do I want to measure then? The actual pixels or the scaled pixels? And to complicate it, if multiple screens and different resolutions/scaling is present - what is right or wrong? It quickly becomes tricky - not only to get it to work but to have a view on what\u0027s desirable and not.\r\n\r\nTo me, I think I want actual pixels, no matter screen or resolution. Or maybe, if possible, be able to offer the choice of how to measure but initial testing indicates that this is quite complex if not impossible. Especially since I have two platforms I want it to work on. Why settle for easy things? :) \r\n\r\nRight now my app works just fine - at least in the single monitor scenario (I dodged the complexity of multiple screens). Or it did work until I upgraded to .NET 5. I now know how to restore my transparency (by removing or altering the mentioned API call) and get my SkiaSharp app to work as before.\r\n\r\nHowever, I am feeling rather lost about how to adress this further. In fact, not sure if I am at the right place. Still, many of you use SkiaSharp in various ways and maybe there are some of you with more knowledge about multiple screens, resolutions, scaling and how Skia render - that might help me understand better. Or just give up ;)\r\n\r\nUpdate. Forgot to add this. What I\u0027ve tried and verified so far:\r\n\r\n**WinForms \u002B SkiasSharp on primary screen**\r\n- Works: With \u0060Application.SetHighDpiMode(HighDpiMode.DpiUnaware*);\u0060 or with call cammented out\r\n- Does not work: \u0060Application.SetHighDpiMode\u0060 set to anything else \r\n**WinForms \u002B SkiaSharp on secondary screen (only) or as part of multiple monitor setup**\r\n- Does not work: Regardless of \u0060Application.SetHighDpiMode\u0060 setting or presence \r\n\r\nWorks means: transparency to desktop using winforms \u002B transparency key \u002B call to SkiaSharp for drawing (see example below)\r\n\r\n\u0060\u0060\u0060csharp\r\n\r\n        private void HandlePaintGLSurfaceDesktop(object sender, SKPaintGLSurfaceEventArgs e)\r\n        {\r\n            // See https://github.com/mono/SkiaSharp/issues/920\r\n            ((SKGLControl)sender).MakeCurrent();\r\n            var bg = TransparencyKey.ToSKColor();\r\n            e.Surface.Canvas.Clear(bg);\r\n            mySkiaSharpDrawing.OnDraw(e.Surface.Canvas);\r\n        }\r\n\u0060\u0060\u0060\r\n",
  "author": {
    "login": "jensbrak",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2020-11-17T11:37:55",
  "updatedAt": "2020-11-17T14:26:48",
  "commentCount": 0,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-04T21:03:55.0597315Z",
    "reactions": [],
    "comments": []
  }
}