{
  "number": 1628,
  "type": "issue",
  "state": "open",
  "title": "SKBitmap.Decode crashes when loading certain webp files on multiple threads",
  "body": "Using Visual Studio 2019 in Windows 10 the following code will crash extremely quickly most of the time.  I realize it makes absolutely zero sense to do anything like this but I ran into the error while doing multithreaded batch image processing and this is the minimal program I can come up with to reproduce the issue.\r\n\r\n\u0060\u0060\u0060\r\nusing SkiaSharp;\r\nusing System.Threading.Tasks;\r\nusing System.Linq;\r\n\r\nnamespace ConsoleApp1\r\n{\r\n    class Program\r\n    {\r\n        static void Main(string[] args)\r\n        {\r\n            Parallel.ForEach(Enumerable.Range(0, 100000), new ParallelOptions() { MaxDegreeOfParallelism = 16 }, x =\u003E\r\n               {\r\n                   SKBitmap.Decode(@\u0022test.webp\u0022).Dispose();  //Dispose() doesn\u0027t seem to matter, same crash behavior either way\r\n               });\r\n        }\r\n    }\r\n}\r\n\u0060\u0060\u0060\r\n\r\nOn most webp files it seems to run fine.  I can only seem to get it to crash on webp files with transparency, including a transparent but otherwise empty webp generated in GIMP, which I\u0027ve attached.  It also crashes on images generated by Skiasharp itself and one other image library that I\u0027ve tested.  When the crash occurs no error is displayed and no exception is available to catch, unless a debugger is attached and then this is displayed:\r\n\r\nConsoleApp1.exe (process 3520) exited with code -1073740940.\r\n\r\nThis crash only occurs (so far) when MaxDegreeOfParallelism is \u003E 7, it\u0027s extremely rare at 8 and very common by 9 and above.  I\u0027ve tested it on two different machines, both with core i7 processors with 8 logical cores and both behave the same way.  I could not get it to crash at a lower degree of parallelism by limiting the cpu affinity to a single logical processor.  It does not seem to matter whether all threads are opening the same image or all different images, it crashes with roughly the same frequency either way.\r\n\r\nThis occurred both 2.80.3-preview.40 and the lastest stable 2.80.2\r\n\r\nNote: The attached file is named test.webp.gif because this silly thing doesn\u0027t accept webp files.  I downloaded it and named it back to test.webp and can confirm it still crashes, even though it seems the contents have been changed slightly.\r\n\r\n![test webp](https://user-images.githubusercontent.com/1910199/107623570-6385ff00-6c0e-11eb-8913-600829e52698.gif)\r\n\r\nEdit:\r\n\r\nI just found that replacing SKBitmap.Decode(...); with the following produces the same error, with seemingly the same conditions:\r\n\r\nSKCodec.Create(@\u0022test.webp\u0022);\r\n\r\nIn addition, the following variations do **not** crash, so I found my workaround for now...\r\n\r\nSKBitmap.Decode(SKData.Create(@\u0022test.webp\u0022));\r\n-or-\r\nSKBitmap.Decode(SKCodec.Create(SKData.Create(@\u0022test.webp\u0022)));\r\n",
  "author": {
    "login": "Rezer",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2021-02-11T10:14:47",
  "updatedAt": "2021-02-11T11:26:29",
  "commentCount": 0,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-04T21:03:06.5197612Z",
    "reactions": [],
    "comments": []
  }
}