{
  "number": 1877,
  "type": "issue",
  "state": "closed",
  "title": "[BUG] SkiaSharp.Views.Uno\u0027s SKXamlCanvas has a binary incompatibility with Uno 4 that causes page load failure",
  "body": "**Description**\r\n\r\nIn the new Uno Platform 4.0 release there were some binary compatibility breaks. One of them is that the signature for CoreDispatcher.RunAsync changed from \u0060public UIAsyncOperation RunAsync(CoreDispatcherPriority priority, DispatchedHandler handler)\u0060 to \u0060public IAsyncAction RunAsync(CoreDispatcherPriority priority, DispatchedHandler handler)\u0060. \r\n\r\nThe SkiaSharp.Views.Uno SKXamlCanvas control calls that method in its \u0060public new async void Invalidate();\u0060 method when it is called or some action causes it to be called from any thread other than the UI thread; see: [SKXamlCanvas.cs line 122 (note: link is to the file as found in the last commit that modified it at the time I\u0027m writing this)](https://github.com/mono/SkiaSharp/blob/4a687a87b86f127ccc23116ee410dcb5df8fca63/source/SkiaSharp.Views.Uno/SkiaSharp.Views.Uno/SKXamlCanvas.cs#L122) .\r\n\r\nIt was difficult to decide where to post this since the breaking change is in Uno Platform. However the breaking change brings it into conformance with the UWP API and this will likely be an ongoing problem for SkiaSharp (as explained below). On the surface it seems like all that needs to be done to make it work with Uno 4 is to create a new SkiaSharp.Views.Uno package built against Uno 4.\r\n\r\nThat said, this is probably going to be an ongoing problem for SkiaSharp since if it\u0027s compiled against Uno 4 then it will have the same missing method issue (except with the expected and actual signatures reversed) when someone tries to use it with Uno 3.X (or any other version of Uno prior to 4). So you may need to ship two versions, deprecate support for pre-Uno 4, and at some reasonable time in the future cease building new SkiaSharp packages for pre-Uno 4.\r\n\r\nThe exact commit where this change occurred is here: [unoplatform/uno github repo commit link - relevant file src/Uno.UWP/UI/Core/CoreDispatcher.cs - old line is 153; new line is 79](https://github.com/unoplatform/uno/commit/37a4058dfe5bd856ef2ec28a608fb02665f5af32#diff-717fd2832a596b5881048bdbabe36cd250b2e583f03f602b099398149f4d3bf7)\r\n\r\nLastly, I did not test the \u0060SKSwapChainPanel\u0060 control and because I could not construct a \u0060SKXamlCanvas\u0060 control I was unable to determine if there were other breakages besides the one that occurred in \u0060SKXamlCanvas.Invalidate\u0060\r\n\r\n**Code**\r\n\r\nIn Visual Studio 2022, with the \u0027Uno Platform Solution Templates\u0027 extension installed, create a new \u0027Multi-Platform App (Uno Platform|Xamarin)\u0027 solution. When the solution is created, using nuget, do the following:\r\n\r\n- Add the SkiaSharp package to all projects\r\n- Add the SkiaSharp.Views package to the UWP project.\r\n- Add the SkiaSharp.Views.Uno package to all of the projects except the UWP project.\r\n \r\nNext, in MainPage.xaml, to the Page tag, add \u0060xmlns:views=\u0022using:SkiaSharp.Views.UWP\u0022\u0060. Change the Page\u0027s Content control from \u0060Grid\u0060 to \u0060StackPanel\u0060 but leave the  \u0022Hello, world!\u0022 \u0060TextBlock\u0060 control. After that TextBlock control, add \u0060\u003Cviews:SKXamlCanvas /\u003E\u0060.\r\n\r\nFinally, in App.xaml.cs, in the \u0060OnLaunched\u0060 method, modify the line\r\n\r\n\u0060                   rootFrame.Navigate(typeof(MainPage), args.Arguments);\u0060\r\n\r\nto \r\n\r\n\u0060                    try\r\n                    {\r\n                        rootFrame.Navigate(typeof(MainPage), args.Arguments);\r\n                    }\r\n                    catch (Exception ex)\r\n                    {\r\n                        System.Diagnostics.Debug.WriteLine($\u0022Exception type: {ex.GetType().FullName}.\\nMessage: {ex.Message}\\nStack Trace: {ex.StackTrace}\u0022);\r\n                        System.Diagnostics.Debugger.Break();\r\n                        throw;\r\n                    }\r\n\u0060\r\n\r\n**Expected Behavior**\r\n\r\nRun any of the Platform projects via debugging in Visual Studio. The app will start properly and navigate to MainPage.xaml causing the text \u0022Hello, world!\u0022 to be visible.\r\n\r\n**Actual Behavior**\r\n\r\nOn any platform other than UWP, a \u0060System.MissingMethodException\u0060 is thrown internally (it appears in the Output window\u0027s \u0022Show output from: Debug\u0022 output) but does not directly propagate out to user code and thus cannot be caught. It does not crash the program and so the program continues to run.\r\n\r\nAfter that, a \u0060System.InvalidOperationException\u0060 is thrown that _is_ catchable that informs you of the MissingMethodException via its Message property, which contains a value along the lines of:\r\n\r\n\u003E Failed to load MyProject.MainPage: System.MissingMethodException: Method not found: \u0027Windows.UI.Core.UIAsyncOperation Windows.UI.Core.CoreDispatcher.RunAsync(Windows.UI.Core.CoreDispatcherPriority, Windows.UI.Core.DispatchedHandler)\u0027.\r\n\u003E at SkiaSharp.Views.UWP.SKXamlCanvas.Invalidate()\r\n\u003E ...\r\n\r\nThe debugger will catch that exception in the code we added in App.xaml.cs. After continuing run the program, the app will swallow the exception and display a blank window, i.e., no \u0022Hello, world!\u0022 text, since it was unable to load MainPage.\r\n\r\n**Basic Information**\r\n\r\n- Version with issue:  All versions built before Uno Platform 4, which is currently all versions.\r\n- Last known good version:  None.\r\n- IDE:  Visual Studio 2022 Community\r\n- Platform Target Frameworks:\r\n  - Android: SDK 30.0 \r\n  - Linux:  OpenSUSE Leap 15.3 via WSL2\u0027s Wayland server functionality\r\n  - Windows Classic:  Windows 10 version 2004 (build 19041)\r\n- Target Devices:   Local PC running an Uno Android project via emulator, a local PC running an Uno Skia.Gtk project using WSL, and a local PC running an Uno Skia.Wpf.Host project.\r\n\r\n(That is not an exhaustive list, I simply wasn\u0027t able to test it on all of the platforms. Because it is a binary break it will happen on any platform except UWP; UWP has always had \u0060public IAsyncAction CoreDispatcher.RunAsync(CoreDispatcherPriority priority, DispatchedHandler handler);\u0060 as its signature, so it had no binary compatibility break).\r\n  \r\n\u003Cdetails\u003E\r\n  \u003Csummary\u003EDetailed IDE/OS information (click to expand)\u003C/summary\u003E\r\n  Visual Studio 2022 17.0.1 Community running on Windows 11 Pro (10.0.22000 Build 22000) with the most recent Windows Subsystem for Linux version 2 and OpenSUSE 15.3 (note: only needed if you want to test the Skia.Gtk project using WSL; it\u0027s not necessary).\r\n\u003C/details\u003E\r\n\r\n\r\n**Reproduction Link**\r\n\r\n\r\n[SkiaSharpUno4BreakageSample.zip](https://github.com/mono/SkiaSharp/files/7643056/SkiaSharpUno4BreakageSample.zip)\r\n\r\n",
  "author": {
    "login": "mikebmcl",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2021-12-02T16:34:49",
  "updatedAt": "2022-08-19T00:02:05",
  "closedAt": "2021-12-21T17:41:40",
  "commentCount": 5,
  "reactionCount": 4
}