{
  "number": 2227,
  "type": "issue",
  "state": "open",
  "title": "Add SKPaint.TextVerticalAlign",
  "body": "**Is your feature request related to a problem? Please describe.**\r\n\r\nCurrently \u0060SKPaint\u0060 has a method to set the \u0060TextAlign\u0060 (Left, Center, Right).  It would be very helpful to have something like a \u0060TextVerticalAlign\u0060 (Bottom, Middle, Top) to define vertically what \u0060TextAlign\u0060 defines horizontally.  I\u0027m currently trying to align labels on a polar graph (as shown below) and the lack of something like \u0060TextVerticalAlign\u0060 means that I have to either put in manual offsets that vary depending on the angle of the text label, or I need to create a function that varies that offset based on angle.\r\n\r\nHere are some text labels with \u0060TextAlign\u0060 set to \u0060Center\u0060 that shows how, based on angle the relative alignment varies because the \u0022anchor\u0022 for the text is at the bottom left corner.\r\n![image](https://user-images.githubusercontent.com/1275999/187276713-e19f35d6-c07b-4a35-b8ee-d905f534ce15.png)\r\n\r\nHere is the same image with some custom offsets to try to overcome the lack of \u0060TextVerticalAlign\u0060\r\n![image](https://user-images.githubusercontent.com/1275999/187277314-3724fa72-21b5-4bc8-8842-148886d82ac7.png)\r\n\r\n\r\n\r\n**Describe the solution you\u0027d like**\r\n\r\nI\u0027d like to see a property added to \u0060SKPaint\u0060 that implements \u0060TextVerticalAlign\u0060 (Bottom, Middle, Top) that does, vertically, what \u0060TextAlign\u0060 does horizontally.  This would increase the number of \u0022anchor points\u0022 for a block of text from 3 to 9.\r\n![image](https://user-images.githubusercontent.com/1275999/187277054-c7f1a4e9-9cc1-47d8-a09f-c0fc965cd13a.png)\r\n![image](https://user-images.githubusercontent.com/1275999/187277071-430b5e7a-3ce4-45a9-bc73-e581ae860554.png)\r\n\r\n**Describe alternatives you\u0027ve considered**\r\n\r\nWithout this I have to enter in manual offsets to account for the lack of \u0060TextVerticalAlign\u0060.  I\u0027ve considered developing a function to calculate the appropriate offset for my use case based on angle and font size but it would be great if a capability like this was built in.\r\n",
  "author": {
    "login": "begleysm",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2022-08-29T18:58:36",
  "updatedAt": "2023-11-25T19:02:43",
  "commentCount": 3,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-04T20:23:56.342899Z",
    "reactions": [],
    "comments": [
      {
        "id": 1236337322,
        "author": "mgood7123",
        "createdAt": "2022-09-04T13:05:57",
        "reactions": []
      },
      {
        "id": 1236337440,
        "author": "mgood7123",
        "createdAt": "2022-09-04T13:06:32",
        "reactions": []
      },
      {
        "id": 1826399342,
        "author": "JGKle",
        "createdAt": "2023-11-25T19:02:42",
        "reactions": []
      }
    ]
  }
}