{
  "number": 3442,
  "type": "pr",
  "state": "closed",
  "title": "Rewite the docs and Copilot instructions",
  "body": "This pull request refactors and reorganizes the AI assistant instructions for the SkiaSharp project. The changes focus on improving clarity, consolidating information, and making the instructions more concise and easier to follow for contributors and AI coding agents. The most important updates include a major rewrite of the main Copilot instructions, removal of redundant content, and streamlining of layer-specific instruction files.\r\n\r\n**Major documentation and instruction refactoring:**\r\n\r\n* [\u0060.github/copilot-instructions.md\u0060](diffhunk://#diff-227c2c26cb2ee0ce0f46a320fc48fbcbdf21801a57f59161b1d0861e8aad55f5L1-R281): Completely rewritten to provide a clear, architecture-focused overview for AI assistants, including pointer types, error handling, directory structure, build/generation steps, and layer-specific rules. The new format uses tables, decision trees, and concise code examples for better readability and guidance.\r\n\r\n**Streamlining and consolidation of instruction files:**\r\n\r\n* [\u0060.github/instructions/README.md\u0060](diffhunk://#diff-cee205dbe4fa47c57e0cfc59a4e148829c156eb84668b2015f771e821fb31952L1-L137): Removed the previous lengthy overview and usage guide for path-specific instructions, consolidating this content into the main Copilot instructions and layer-specific files.\r\n\r\n**Layer-specific instruction improvements:**\r\n\r\n_Group: C API Layer_\r\n* [\u0060.github/instructions/c-api-layer.instructions.md\u0060](diffhunk://#diff-3d4ad05218082b858f93d8de5ce59c11123fdad7f6fad49b87641d354562c49bL1-L193): Removed redundant frontmatter and improved the focus and clarity of rules, patterns, and examples for working in the C API bridging layer.\r\n\r\n_Group: C# Bindings Layer_\r\n* [\u0060.github/instructions/csharp-bindings.instructions.md\u0060](diffhunk://#diff-523ee819a3b66548d4b7ffc13a0c10255faf4c4d81ac7481e82cfaa5f4e4d306L1-L116): Removed redundant frontmatter and streamlined the rules and examples for C# wrapper development, emphasizing proper handle management, validation, and error handling.\r\n\r\n_Group: Documentation_\r\n* [\u0060.github/instructions/documentation.instructions.md\u0060](diffhunk://#diff-3298abcaf683d5d9edc5366e93870fa3038b8d515339f36983cf1432bb46a6c4L1-L56): Removed redundant frontmatter and clarified standards for writing project documentation, including code example best practices and structure guidelines.",
  "author": {
    "login": "mattleibow",
    "type": "User"
  },
  "labels": [
    {
      "name": "area/Docs",
      "color": "0052cc"
    },
    {
      "name": "backend/SkiaSharp",
      "color": "ededed"
    },
    {
      "name": "copilot",
      "color": "6f42c1"
    }
  ],
  "assignees": [],
  "createdAt": "2026-01-20T22:32:05",
  "updatedAt": "2026-02-02T22:32:27",
  "closedAt": "2026-01-20T22:32:23",
  "commentCount": 1,
  "reactionCount": 0,
  "draft": false,
  "mergeableState": "unknown",
  "baseBranch": "main",
  "headBranch": "dev/docs-again",
  "additions": 925,
  "deletions": 5688,
  "changedFiles": 36,
  "commits": 2,
  "reviews": []
}