{
  "number": 3444,
  "type": "pr",
  "state": "closed",
  "title": "Add a release and tagging skill",
  "body": "This pull request significantly updates and clarifies the SkiaSharp release process documentation. It replaces the old branching and release checklist documents with a comprehensive, step-by-step release guide, and introduces two new \u0022skills\u0022 for automating and confirming release branch creation and tagging. The changes aim to make the release process more robust, auditable, and safer by enforcing explicit user confirmation at each step.\r\n\r\n**Key changes include:**\r\n\r\n### Release Process Documentation Overhaul\r\n\r\n* Completely rewrote \u0060documentation/releasing.md\u0060 to provide a detailed, step-by-step release guide, including branch creation, version bumping, CI verification, tagging, and milestone closure. The new guide replaces the old checklist format and incorporates branching strategy and reference tables for key files and pipelines.\r\n* Updated the documentation index (\u0060documentation/README.md\u0060) to reflect the new, comprehensive release guide and removed reference to the old branching strategy document.\r\n* Removed the outdated \u0060documentation/branching.md\u0060 file, consolidating all branching and release strategy information into the new release guide.\r\n\r\n### Automated and Auditable Release Workflows\r\n\r\n* Added \u0060.github/skills/release-branch/SKILL.md\u0060: Defines a confirmation-based, stepwise workflow for creating release branches, updating version labels, and bumping main for preview releases. Enforces explicit user confirmation at each step and documents the branching logic for preview, stable, and hotfix releases.\r\n* Added \u0060.github/skills/release-tag/SKILL.md\u0060: Documents a confirmation-driven workflow for finalizing releases after packages are published, including tagging, drafting GitHub releases, and closing milestones. Details tag formats for all release types and ensures tags are only created after package verification.",
  "author": {
    "login": "mattleibow",
    "type": "User"
  },
  "labels": [
    {
      "name": "area/Docs",
      "color": "0052cc"
    },
    {
      "name": "backend/SkiaSharp",
      "color": "ededed"
    },
    {
      "name": "copilot",
      "color": "6f42c1"
    }
  ],
  "assignees": [],
  "createdAt": "2026-01-22T02:15:02",
  "updatedAt": "2026-02-02T22:32:28",
  "closedAt": "2026-01-22T02:15:11",
  "commentCount": 1,
  "reactionCount": 0,
  "draft": false,
  "mergeableState": "unknown",
  "baseBranch": "main",
  "headBranch": "dev/skills",
  "additions": 365,
  "deletions": 74,
  "changedFiles": 5,
  "commits": 1,
  "reviews": []
}