{
  "number": 3455,
  "type": "pr",
  "state": "closed",
  "title": "Update the native dependency bump skills",
  "body": "This pull request significantly expands and restructures the documentation for updating native dependencies in SkiaSharp\u0027s Skia fork. The guide is now organized into clear, approval-driven phases, with explicit checkpoints for user confirmation at critical steps. It provides detailed instructions for each phase of the update process, including risk assessment, local changes, CI monitoring, and merging, and clarifies procedures for security updates.\r\n\r\nKey improvements and changes:\r\n\r\n**Process Restructuring \u0026 Clarity**\r\n- The workflow is now divided into explicit phases (Discovery, Analysis, Local Changes, Build \u0026 Test, Create PRs, Monitor CI, Merge, Verify), with clear goals and user approval steps at critical junctures (e.g., before PR creation and merging).\r\n- Added \u0022Critical Rules\u0022 section at the start, emphasizing the need to stop and seek approval before performing any public or irreversible actions, such as creating or merging PRs or force pushing.\r\n\r\n**Detailed Step-by-Step Instructions**\r\n- Each phase includes specific instructions for actions to take, what information to present to the user, and how to handle common issues (e.g., build failures, CI status).\r\n- Instructions for updating the SkiaSharp submodule and handling auto-merges are now included, improving reliability and reducing mistakes during dependency updates.\r\n\r\n**Security Update Guidance**\r\n- The security update checklist is rewritten for clarity and brevity, emphasizing identification and verification of CVE fixes, and providing guidance on how to handle disclosure in PRs.\r\n\r\n**Documentation Simplification**\r\n- Reference links and documentation sections are streamlined for easier navigation, and redundant or overly detailed steps are condensed for better readability.\r\n\r\nThese changes make the update process safer, more auditable, and easier to follow, especially for contributors new to the workflow.",
  "author": {
    "login": "mattleibow",
    "type": "User"
  },
  "labels": [
    {
      "name": "area/Docs",
      "color": "0052cc"
    },
    {
      "name": "backend/SkiaSharp",
      "color": "ededed"
    },
    {
      "name": "copilot",
      "color": "6f42c1"
    }
  ],
  "assignees": [],
  "createdAt": "2026-01-27T15:11:00",
  "updatedAt": "2026-02-02T22:25:00",
  "closedAt": "2026-01-27T15:11:20",
  "commentCount": 1,
  "reactionCount": 0,
  "draft": false,
  "mergeableState": "unknown",
  "baseBranch": "main",
  "headBranch": "dev/skills",
  "additions": 164,
  "deletions": 93,
  "changedFiles": 1,
  "commits": 1,
  "reviews": []
}