{
  "number": 45,
  "type": "issue",
  "state": "closed",
  "title": "Please add support for SVG assets!",
  "body": "If SkyaSharp doesn\u0027t support SVG is useless at the moment. Not supporting SVG for a vector library is like not supporting PNG for a bitmap library. I use SVG assets in my Xamarin apps thanks to the NGraphics library, and I have many advantages:\n- SMALLER APP FOOTPRINTS : SVG files are so small you can have your entire app graphics in less than 10k!\n- FAST DEVELOPMENT - No need to code for creating the views. All the UI controls that once needed DAYS or even WEEKS to code, now are made in a couple of minutes in Inkscape. Productivity boost never seen before!\n- EASY TO MODIFY FOR ARTISTS : my graphic artist works with Inkscape and it can edit the SVG files directly, no need to ask me to modify the code to make them work. He can update on the git the svg assets every day and test the changes by himself. And this even at the last moment! It\u0027s an amazing workflow!\n- PORTABLE AND INDEPENDENT : No more graphic assets to use just once and then thrashed. The SVG assets you make for iOS you can reuse on Android, Windows, Linux versions of your app and on the web app too, with no changes. Also you do not depend on a single graphician or artist anymore. I can hire any pro to make my assets, and they can deliver them in SVG or change the existing one if they replaced another artist in the same project. Inkscape is also multiplatform, you can edit SVG assets on every computer you have!\n\nThis is why I really hope that Xamarin goes the way of NGraphics and add support for SVG assets to SkyaSharp. PLEASE.\n\nSome of my SVG assets (I made them in Inkscape):\n\n![ios_app_buttons](https://cloud.githubusercontent.com/assets/713559/5924670/d56b48a0-a65d-11e4-95b4-7377a6b7eda9.png)\n\nYou can download the original svg file from my google drive (click on the download button):\nhttp://goo.gl/m7TbmM\n\nFeel free to use them! \n\nFor an easier debug, here it is a splitted version of the two main buttons svg files, you can download the zip from here: \nhttps://drive.google.com/file/d/0BxexooDWEb8ublZlcm5yRWpXTzQ/view?usp=sharing\n",
  "author": {
    "login": "Emasoft",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2016-03-15T23:12:26",
  "updatedAt": "2022-08-20T06:01:46",
  "closedAt": "2016-03-17T16:18:32",
  "commentCount": 1,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-04T20:32:18.1506423Z",
    "reactions": [],
    "comments": [
      {
        "id": 197955977,
        "author": "migueldeicaza",
        "createdAt": "2016-03-17T16:18:32",
        "reactions": []
      }
    ]
  }
}