{
  "meta": {
    "schemaVersion": "1.0",
    "number": 3430,
    "repo": "mono/SkiaSharp",
    "analyzedAt": "2026-02-13T15:40:00Z"
  },
  "conclusion": "needs-platform",
  "notes": "Code analysis confirms the design flaw in SKXamlCanvas.Skia.cs: FreeBitmap() at line 118 couples two independent resource lifecycles by unconditionally nulling both pixels and bitmap when pixels != null. This means any call to FreeBitmap() for pixel buffer cleanup also destroys the bitmap. While the simple sequential resize path doesn\u0027t trigger the NRE (because the second FreeBitmap at line 106 is a no-op when pixels was already nulled by the first at line 87), the NRE likely manifests through Uno Platform\u0027s runtime behavior — re-entrant DoInvalidate during the Background property setter at line 101, or async WriteableBitmap initialization on the Skia backend. Runtime reproduction requires an Uno Platform app on a Skia backend (WASM, Desktop), which is not available in the current environment. PR #3431 by the same reporter correctly fixes this by separating FreePixels() from FreeBitmap().",
  "reproductionSteps": [
    {
      "stepNumber": 1,
      "description": "Analyze SKXamlCanvas.Skia.cs source code to verify the reported resource coupling flaw in FreeBitmap()",
      "layer": "csharp",
      "filesCreated": [
        {
          "filename": "SKXamlCanvas.Skia.cs (source analysis)",
          "description": "The FreeBitmap() method at line 118-126 nulls both pixels and bitmap when pixels != null. CreateBitmap() calls FreeBitmap() at line 87 (bitmap size check) and again at line 106 (pixel size check). The second call can destroy a bitmap that was just created at lines 89-102."
        }
      ],
      "result": "success"
    },
    {
      "stepNumber": 2,
      "description": "Create console simulation of the exact CreateBitmap/FreeBitmap logic to test if the NRE triggers in simple sequential execution",
      "layer": "setup",
      "command": "cd /tmp/repro-3430 \u0026\u0026 dotnet new console -n Repro --framework net10.0",
      "exitCode": 0,
      "output": "The template \u0022Console App\u0022 was created successfully.\nRestore succeeded.",
      "result": "success"
    },
    {
      "stepNumber": 3,
      "description": "Write and run simulation reproducing exact field state transitions from CreateBitmap/FreeBitmap. Tests: initial render (100x100), re-render (100x100), resize (200x200).",
      "layer": "csharp",
      "command": "cd /tmp/repro-3430/Repro \u0026\u0026 dotnet run",
      "exitCode": 0,
      "output": "DoInvalidate(100x100): bitmap=True, pixels=True → OK\nDoInvalidate(100x100): bitmap=True, pixels=True → OK\nDoInvalidate(200x200): bitmap=True, pixels=True → OK\n\nIn simple sequential execution, the second FreeBitmap() at line 106 is a no-op because pixels was already nulled by the first FreeBitmap() at line 87. The NRE requires Uno Platform runtime behavior (re-entrancy or async initialization).",
      "filesCreated": [
        {
          "filename": "Program.cs",
          "description": "Console simulation of the exact fields and methods from SKXamlCanvas.Skia.cs. Simulates FreeBitmap() with its resource coupling flaw and CreateBitmap() with its double-FreeBitmap call pattern. Tests initial render, re-render, and resize scenarios.",
          "content": "// See $HOME/repro-3430/Repro/Program.cs for full source\n// Simulation shows: in simple sequential execution, the NRE does not trigger\n// because the second FreeBitmap is a no-op (pixels already null from first call).\n// The NRE requires Uno Platform\u0027s re-entrant DoInvalidate or async bitmap init."
        }
      ],
      "result": "success"
    },
    {
      "stepNumber": 4,
      "description": "Verify bug still present on main branch — check if PR #3431 has been merged",
      "layer": "csharp",
      "command": "grep -n \u0027bitmap = null\u0027 source/SkiaSharp.Views.Uno/SkiaSharp.Views.Uno.WinUI.Skia/SKXamlCanvas.Skia.cs",
      "exitCode": 0,
      "output": "124: bitmap = null;\n\nThe FreeBitmap() method still nulls bitmap inside the pixels cleanup block. PR #3431 (open, unmerged) would fix this by separating FreePixels() from FreeBitmap().",
      "result": "success"
    },
    {
      "stepNumber": 5,
      "description": "Attempt to set up Uno Platform for runtime reproduction — check if templates are installed",
      "layer": "setup",
      "command": "dotnet new unoapp --help",
      "exitCode": 1,
      "output": "No templates or subcommands found matching: \u0027unoapp\u0027.\nUno Platform templates not installed. Runtime reproduction requires an Uno Platform app with SKXamlCanvas on a Skia backend.",
      "result": "skip"
    }
  ],
  "environment": {
    "os": "macOS 26.2",
    "arch": "arm64",
    "dotnetVersion": "10.0.2",
    "skiaSharpVersion": "3.116.0",
    "dockerUsed": false,
    "dotnetSdkVersion": "10.0.102"
  },
  "inputs": {
    "triageFile": "ai-triage/3430.json"
  },
  "assessment": "likely-bug",
  "scope": "unknown",
  "reproductionTime": "~15 minutes",
  "versionResults": [
    {
      "version": "3.116.0",
      "source": "nuget",
      "result": "not-tested",
      "notes": "Reporter\u0027s version. Cannot test without Uno Platform runtime.",
      "platform": "host-macos-arm64"
    },
    {
      "version": "main (source)",
      "source": "source",
      "result": "not-tested",
      "notes": "Code on main is identical to 3.116.0 — the bug has not been fixed (PR #3431 is unmerged).",
      "platform": "host-macos-arm64"
    }
  ],
  "reproProject": {
    "type": "console",
    "tfm": "net10.0",
    "packages": []
  },
  "blockers": [
    "Uno Platform Skia backend is required to trigger the NRE at runtime — the bug manifests through platform-specific behavior (re-entrant DoInvalidate during Background property setter or async WriteableBitmap initialization)",
    "Uno Platform templates not installed (dotnet new unoapp not available) and installing them requires additional SDK components",
    "SKXamlCanvas extends Canvas (a WinUI control) which cannot be instantiated outside the Uno/WinUI framework"
  ]
}