{
  "number": 13,
  "type": "issue",
  "state": "closed",
  "title": "Add support for clipping",
  "body": "I discovered there is currently no support for clipping (i.e  *clip-path* attribute and *clipPath* element). I already have a working version that parses the *clipPath* elements from defs - section and applies the clipping to the SKCanvas. By now it is limited to *rect* elements within *clipPath* element, but I should be able to add most of the other primitives pretty fast. \r\nI would have already sent a PR, but I have some strange issues with the tests. All tests that compare pixels of the resulting bitmap (using SKBitmap.GetPixel method) fail, because GetPixel seems to return random numbers instead of actual color of the pixel. If you want I can send the PR without all tests passing, maybe it\u0027s just an issue on my machine (vmware). Please advice how to proceed.",
  "author": {
    "login": "codedevote",
    "type": "User"
  },
  "labels": [
    {
      "name": "area-Svg",
      "color": "0052cc"
    }
  ],
  "assignees": [],
  "milestone": "1.60.0",
  "createdAt": "2017-08-08T15:59:36",
  "updatedAt": "2017-09-29T15:28:27",
  "closedAt": "2017-09-29T15:28:27",
  "commentCount": 2,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T12:27:34.8958787Z",
    "reactions": [],
    "comments": [
      {
        "id": 326683582,
        "author": "mattleibow",
        "body": "This will be good to add, thanks.\r\nThe issue you may be having is that either you are not clearing the bitmap before drawing the image. I noticed that on some platforms, the memory has arbitrary data. The new bitmap allocates, but does not actually touch the pixels yet.",
        "createdAt": "2017-09-01T21:04:45",
        "reactions": []
      },
      {
        "id": 333158340,
        "author": "mattleibow",
        "body": "Closing this issue as basic support for clipping is now merged in. We should open new issues for specific bugs/features.",
        "createdAt": "2017-09-29T15:28:27",
        "reactions": []
      }
    ]
  }
}