{
  "number": 189,
  "type": "pr",
  "state": "closed",
  "title": "Bump the xamarinforms group with 2 updates",
  "body": "Bumps the xamarinforms group with 2 updates: Xamarin.Forms and Xamarin.Forms.Platform.WPF.\n\nUpdates \u0060Xamarin.Forms\u0060 from 5.0.0.2401 to 5.0.0.2612\n\nUpdates \u0060Xamarin.Forms.Platform.WPF\u0060 from 5.0.0.2401 to 5.0.0.2612\n\n\nDependabot will resolve any conflicts with this PR as long as you don\u0027t alter it yourself. You can also trigger a rebase manually by commenting \u0060@dependabot rebase\u0060.\n\n[//]: # (dependabot-automerge-start)\n[//]: # (dependabot-automerge-end)\n\n---\n\n\u003Cdetails\u003E\n\u003Csummary\u003EDependabot commands and options\u003C/summary\u003E\n\u003Cbr /\u003E\n\nYou can trigger Dependabot actions by commenting on this PR:\n- \u0060@dependabot rebase\u0060 will rebase this PR\n- \u0060@dependabot recreate\u0060 will recreate this PR, overwriting any edits that have been made to it\n- \u0060@dependabot merge\u0060 will merge this PR after your CI passes on it\n- \u0060@dependabot squash and merge\u0060 will squash and merge this PR after your CI passes on it\n- \u0060@dependabot cancel merge\u0060 will cancel a previously requested merge and block automerging\n- \u0060@dependabot reopen\u0060 will reopen this PR if it is closed\n- \u0060@dependabot close\u0060 will close this PR and stop Dependabot recreating it. You can achieve the same result by closing it manually\n- \u0060@dependabot show \u003Cdependency name\u003E ignore conditions\u0060 will show all of the ignore conditions of the specified dependency\n- \u0060@dependabot ignore \u003Cdependency name\u003E major version\u0060 will close this group update PR and stop Dependabot creating any more for the specific dependency\u0027s major version (unless you unignore this specific dependency\u0027s major version or upgrade to it yourself)\n- \u0060@dependabot ignore \u003Cdependency name\u003E minor version\u0060 will close this group update PR and stop Dependabot creating any more for the specific dependency\u0027s minor version (unless you unignore this specific dependency\u0027s minor version or upgrade to it yourself)\n- \u0060@dependabot ignore \u003Cdependency name\u003E dependency\u0060 will close this group update PR and stop Dependabot creating any more for the specific dependency (unless you unignore this specific dependency or upgrade to it yourself)\n- \u0060@dependabot unignore \u003Cdependency name\u003E dependency\u0060 will remove all of the ignore conditions of the specified dependency\n- \u0060@dependabot unignore \u003Cdependency name\u003E \u003Cignore condition\u003E\u0060 will remove the ignore condition of the specified dependency and ignore conditions\n\n\n\u003C/details\u003E",
  "author": {
    "login": "dependabot[bot]",
    "type": "Bot"
  },
  "labels": [
    {
      "name": "dependencies",
      "color": "0366d6"
    }
  ],
  "assignees": [],
  "createdAt": "2023-08-22T00:09:28",
  "updatedAt": "2023-08-22T18:39:20",
  "closedAt": "2023-08-22T18:39:18",
  "commentCount": 1,
  "reactionCount": 0,
  "draft": false,
  "merged": false,
  "mergeableState": "unknown",
  "baseBranch": "main",
  "headBranch": "dependabot/nuget/xamarinforms-11244f45a5",
  "additions": 16,
  "deletions": 16,
  "changedFiles": 8,
  "commits": 1,
  "reviews": [
    {
      "author": "mattleibow",
      "state": "APPROVED",
      "submittedAt": "2023-08-22T00:09:56"
    }
  ],
  "engagement": {
    "syncedAt": "2026-02-06T11:49:05.3509389Z",
    "reactions": [],
    "comments": [
      {
        "id": 1688725218,
        "author": "dependabot[bot]",
        "body": "The group that created this PR has been removed from your configuration.",
        "createdAt": "2023-08-22T18:39:17",
        "reactions": []
      }
    ]
  }
}