{
  "number": 2,
  "type": "issue",
  "state": "closed",
  "title": "More Complete SVG Features",
  "body": "Support for the full SVG is desired, but this is no small task. SVG has a HUGE scope and detailed specification: http://www.w3.org/TR/SVG2/\r\n\r\nAt this point, SkiaSharp is more of wrapper for skia, with some added features. We will probably only support SVG in the same way skia does, when they do. This is not to say that someone (anyone really) can create a SVG engine that makes use of SkiaSharp as the rendering engine. Essentially, SkiaSharp is a 2D raster graphics engine, thus SVG and any vector system will have to be created from scratch.\r\n\r\nSVG is not a case of we don\u0027t want or we don\u0027t care, but simply a case of the SkiaSharp team is too small to get around to doing this. At this point, the community will have to jump in on this.\r\n\r\nThere have been several issues already, so I just want to link them here for reference:\r\n - https://github.com/mono/SkiaSharp/issues/21\r\n - https://github.com/mono/SkiaSharp/issues/45\r\n - https://github.com/mono/SkiaSharp/issues/120\r\n - https://github.com/mono/SkiaSharp/issues/258\r\n - https://github.com/mono/SkiaSharp/issues/107 _(more for creating SVG files)_",
  "author": {
    "login": "mattleibow",
    "type": "User"
  },
  "labels": [
    {
      "name": "enhancement",
      "color": "84b6eb"
    },
    {
      "name": "area-Svg",
      "color": "0052cc"
    }
  ],
  "assignees": [],
  "createdAt": "2017-06-05T21:02:04",
  "updatedAt": "2020-08-15T00:20:44",
  "closedAt": "2020-08-15T00:20:44",
  "commentCount": 1,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T13:12:15.6589816Z",
    "reactions": [],
    "comments": [
      {
        "id": 674319601,
        "author": "mattleibow",
        "body": "Thanks for this issue, but due the the fact that this library is now deprecated, no further work will be done on this library.\r\n\r\nThank you for all of you folks that have been using this library this long, it is always great to know that some of my work has made things a bit better. However, I am unable to maintain this library, but I would recommend using the far superior https://github.com/wieslawsoltes/Svg.Skia\r\n\r\nIt has an API that is compatible and will just require a namespace change.",
        "createdAt": "2020-08-15T00:20:44",
        "reactions": []
      }
    ]
  }
}