{
  "number": 29,
  "type": "issue",
  "state": "closed",
  "title": "Rendering of \u003Ctspan\u003E element not working...",
  "body": "Hi,\r\nI just tested a SVG produced by SVGMaker from a Microstation file. The file has produced the piece of following SVG...\r\n\u003Ctext font-family=\u0022Arial\u0022 font-size=\u002246\u0022 fill=\u0022#000000\u0022 font-weight=\u0022700\u0022 font-style=\u0022italic\u0022\u003E\r\n\u003Ctspan x=\u00227212,7243,7268,7296,7321,7339,7364\u0022 y=\u00223561\u0022\u003ERepère \u003C/tspan\u003E\r\n...\r\n\u003C/text\u003E\r\nThe \u003Ctspan\u003E element is conform to SVG spécification, but the format of x coordinate is not taken into account in SkiaSharp SVG and is set to 0 (normal as far I saw in the source code). So all the texts defined are put at the left side of the SVG drawing....\r\n\r\nI have a temporary solution as I can force SVGMaker to draw text whether to use text, but I think it would be good to add implementation of the specification for text/tspan in the library.\r\n\r\nRegards.\r\n\r\nEric.\r\n",
  "author": {
    "login": "educos35",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2018-02-19T15:56:31",
  "updatedAt": "2020-08-15T00:24:09",
  "closedAt": "2020-08-15T00:24:09",
  "commentCount": 1,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T13:12:04.5839903Z",
    "reactions": [],
    "comments": [
      {
        "id": 674320240,
        "author": "mattleibow",
        "body": "Thanks for this issue, but due the the fact that this library is now deprecated, no further work will be done on SkiaSharp.SVG.\r\n\r\nThank you for all of you folks that have been using this library this long, it is always great to know that some of my work has made things a bit better. However, I am unable to maintain this library, but I would recommend using the far superior https://github.com/wieslawsoltes/Svg.Skia \r\nIt has an API that is compatible and will just require a namespace change.\r\n\r\nFor better text support, I again would recommend the equally awesome https://github.com/toptensoftware/RichTextKit that can pretty much do everything.\r\n\r\nWith both of these, I have updated the sample app to demonstrate how to use these libraries, producing a far better result.",
        "createdAt": "2020-08-15T00:24:09",
        "reactions": []
      }
    ]
  }
}