{
  "number": 50,
  "type": "issue",
  "state": "closed",
  "title": "FontAwesome should be updated (4.7 -\u003E 5.3.1)",
  "body": "many of the new glyphs are not available. It looks like the code should still be working, but the url has changed from:\r\nhttps://raw.githubusercontent.com/FortAwesome/Font-Awesome/v4.7.0/css/font-awesome.min.css\r\n\r\nto:\r\nhttps://raw.githubusercontent.com/FortAwesome/Font-Awesome/master/web-fonts-with-css/css/fontawesome-all.min.css",
  "author": {
    "login": "pfaucon",
    "type": "User"
  },
  "labels": [
    {
      "name": "enhancement",
      "color": "84b6eb"
    },
    {
      "name": "area-Iconify",
      "color": "0052cc"
    }
  ],
  "assignees": [],
  "createdAt": "2018-09-09T08:42:21",
  "updatedAt": "2020-08-15T00:28:26",
  "closedAt": "2020-08-15T00:28:26",
  "commentCount": 3,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T13:11:57.0091008Z",
    "reactions": [],
    "comments": [
      {
        "id": 427029405,
        "author": "mattleibow",
        "body": "I had a look and this may not be easily possible with a upgrade mindset. They have changed a fair bit: \r\nhttps://fontawesome.com/how-to-use/on-the-web/setup/upgrading-from-version-4\r\n\r\nThis will need more thought:\r\n - do we want a new type: \u0060FontAwesome5\u0060\r\n - implement logic for case where the characters are spread across multiple font files",
        "createdAt": "2018-10-04T13:58:47",
        "reactions": []
      },
      {
        "id": 427035184,
        "author": "pfaucon",
        "body": "It seems unlikely to me that a single person will use multiple font styles in one application.  It might be reasonable then to just generate separate packages for each (like fontawesome -\u003E FontAwesomeLight, FontAwesomeRegular...), although it would be a lot of packages.  \r\n\r\nAnother possibility would be that all of the naming seems to be the same, so perhaps the package could pack all versions and load brands always, but allow a specification of light/regular/solid at AddFontAwesome() ?",
        "createdAt": "2018-10-04T14:14:28",
        "reactions": []
      },
      {
        "id": 674320931,
        "author": "mattleibow",
        "body": "Thanks for this issue, but due the the fact that this library is now deprecated, no further work will be done on SkiaSharp.SVG.\r\n\r\nThank you for all of you folks that have been using this library this long, it is always great to know that some of my work has made things a bit better. However, I am unable to maintain this library, but I would recommend using the far superior https://github.com/wieslawsoltes/Svg.Skia \r\nIt has an API that is compatible and will just require a namespace change.\r\n\r\nFor better text support, I again would recommend the equally awesome https://github.com/toptensoftware/RichTextKit that can pretty much do everything.\r\n\r\nWith both of these, I have updated the sample app to demonstrate how to use these libraries, producing a far better result.",
        "createdAt": "2020-08-15T00:28:26",
        "reactions": []
      }
    ]
  }
}