{
  "number": 87,
  "type": "issue",
  "state": "closed",
  "title": "Join forces with SVG.NET?",
  "body": "Hello,\r\n\r\nwe from SVG.NET currently consider splitting SVG processing from drawing. See: https://github.com/vvvv/SVG/issues/590 and https://github.com/vvvv/SVG/issues/607\r\n\r\nIt would make quite a lot of sense to switch the rendering part to Skia. We also have a lot of rendering code that could probably changed from System.Drawing to Skia. So that might have to be evaluated.\r\n\r\nWe also have a nice test framework/application that works on pixel comparison. If anyone is willing to work together on that, let us know.",
  "author": {
    "login": "tebjan",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2019-11-09T15:01:56",
  "updatedAt": "2020-08-15T00:06:45",
  "closedAt": "2020-08-15T00:06:45",
  "commentCount": 3,
  "reactionCount": 2,
  "engagement": {
    "syncedAt": "2026-02-06T13:12:32.2698027Z",
    "reactions": [
      {
        "user": "Happypig375",
        "content": "\u002B1",
        "createdAt": "2026-02-06T13:12:32.2698213Z"
      },
      {
        "user": "EmilAlipiev",
        "content": "\u002B1",
        "createdAt": "2026-02-06T13:12:32.2698223Z"
      }
    ],
    "comments": [
      {
        "id": 552113673,
        "author": "mattleibow",
        "body": "This work is happening, and it looks very good so far: https://github.com/wieslawsoltes/Svg.Skia\r\n\r\nTo be really honest, I don\u0027t think our SkiaSharp.Svg is going to go anywhere. FFImageLoading has already moved on from this code. Our SVG codebase to not going to work in the real world because it wasn\u0027t designed to handle the way SVG is designed. \r\n\r\nOn my side, I don\u0027t think I will be getting time to do much (if any) work on SVG, so I would rather talk to @wieslawsoltes on this work. I will try to contribute if I can, but at this point I would say the SVG is more a community project. And, if we do this right, then SkiaSharp is just one of many backends - which is preferable in the long run.\r\n\r\nGoogle says they are going to be adding SVG, but it has been years and it is a lot of work. \r\n\r\nSo in summary: I also support the split, I can\u0027t really spend much time, Community Power!",
        "createdAt": "2019-11-09T16:10:28",
        "reactions": [
          {
            "user": "lindexi",
            "content": "\u002B1",
            "createdAt": "2026-02-06T13:12:31.8279519Z"
          }
        ]
      },
      {
        "id": 552114327,
        "author": "tebjan",
        "body": "Ha, wasn\u0027t aware of this. I already saw him contributing to our repository. We\u0027ll figure it out. Thanks a lot for the input!",
        "createdAt": "2019-11-09T16:17:56",
        "reactions": []
      },
      {
        "id": 674317084,
        "author": "mattleibow",
        "body": "Thanks for this issue, but due the the fact that this library is now deprecated, no further work will be done on this library.\r\nI would recommend using the far superior https://github.com/wieslawsoltes/Svg.Skia",
        "createdAt": "2020-08-15T00:06:45",
        "reactions": [
          {
            "user": "lindexi",
            "content": "\u002B1",
            "createdAt": "2026-02-06T13:12:32.2195666Z"
          }
        ]
      }
    ]
  }
}