{
  "number": 1134,
  "type": "issue",
  "state": "closed",
  "title": "[QUESTION] How to create content views and layouts?",
  "body": " I can\u0027t find anything online about this. How to add a canvas on another canvas? so one will be the control and the other will be the layout. Also how can I draw a Xamarin View on a canvas?\r\n",
  "author": {
    "login": "MhAllan",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2020-02-09T07:02:41",
  "updatedAt": "2022-08-19T06:02:48",
  "closedAt": "2020-02-10T11:18:59",
  "commentCount": 6,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T14:11:17.8749749Z",
    "reactions": [],
    "comments": [
      {
        "id": 583875021,
        "author": "mattleibow",
        "body": "You could use a Grid or AbsoluteLayout.\r\n\r\n\u0060\u0060\u0060xaml\r\n\u003CGrid\u003E\r\n    \u003CGrid\u003E\r\n        \u003C!-- content below --\u003E\r\n    \u003C/Grid\u003E\r\n    \u003CSKCanvasView /\u003E\r\n    \u003CGrid\u003E\r\n        \u003C!-- content above--\u003E\r\n    \u003C/Grid\u003E\r\n\u003C/Grid\u003E",
        "createdAt": "2020-02-09T18:07:11",
        "reactions": []
      },
      {
        "id": 584075134,
        "author": "MhAllan",
        "body": "Thank @mattleibow, I was hoping it is possible wihtout using XF.",
        "createdAt": "2020-02-10T11:18:54",
        "reactions": []
      },
      {
        "id": 584342193,
        "author": "mattleibow",
        "body": "@MhAllan, what platform are you targeting? We have views for all platforms - I just assumed you were using Forms. But, this is pretty much the same for all platforms, just put the views above or below the canvas. \r\n\r\nOr maybe I am just not understanding what you are trying to achieve?",
        "createdAt": "2020-02-10T20:37:47",
        "reactions": []
      },
      {
        "id": 585513966,
        "author": "MhAllan",
        "body": "I was thinking of the possibility to ditch Xamarin Forms as their bugs backlog is growing over the years than shrinking. So I thought why can\u0027t we make Skia Ui. But there are things we can\u0027t make, like an entry, so I need to be able to host entry inside my Skia content/layout views. I was just wondering nothing serious.",
        "createdAt": "2020-02-13T02:10:53",
        "reactions": []
      },
      {
        "id": 585698133,
        "author": "mattleibow",
        "body": "You could try and see what comet is doing. They are actually looking at this https://github.com/Clancey/Comet\r\n\r\nBut just to let you know, the number of issues on repos is also not an indication of stagnation but just the number of issues open. I know that team is closing/fixing large numbers of issues and adding new features rapidly. They also just got support for new form factors like the dual screen devices.\r\n\r\nIf you feel they are falling behind or you don\u0027t have a feature you need, chat to David https://twitter.com/davidortinau ",
        "createdAt": "2020-02-13T11:35:21",
        "reactions": []
      },
      {
        "id": 585771604,
        "author": "MhAllan",
        "body": "Yes the number of issues is not an indicator, but the issues themselves are disappointing. I reported more than 5 issues in 2 weeks in 2020 they are supposed to be solved at the early days of the framework (for example button turn gray when hover on it!! How come this is an issue in 2020?). Thanks for the link of Comet I will definitely check it out.",
        "createdAt": "2020-02-13T14:08:48",
        "reactions": []
      }
    ]
  }
}