{
  "number": 1197,
  "type": "issue",
  "state": "closed",
  "title": "[QUESTION] Code does not adhere to editorconfig",
  "body": "When making PRs, I noticed that some of the code gets formatted according to the \u0060.editorconfig\u0060  rules, but the original file wasn\u0027t. This can cause a lot of merge conflicts.\r\n\r\nFor example, it seems the following two formatting options in the \u0060.editorconfig\u0060 are not followed in the source code:\r\n\r\n\u0060\u0060\u0060cs\r\n\t\tpublic SKPaint ()\r\n\t\t\t: this (SkiaApi.sk_compatpaint_new (), true)\r\n\t\t{\r\n\t\t\tif (Handle == IntPtr.Zero) {\r\n\t\t\t\tthrow new InvalidOperationException (\u0022Unable to create a new SKPaint instance.\u0022);\r\n\t\t\t}\r\n\t\t}\r\n\u0060\u0060\u0060\r\n\r\nNotice the space after the \u0060SKPaint\u0060 method declaration and the \u0060sk_paint_new\u0060 method call.\r\n\r\nThe rules in the \u0060.editorconfig\u0060 file however are\r\n\r\n\u0060\u0060\u0060\r\ncsharp_space_between_method_call_name_and_opening_parenthesis = false\r\ncsharp_space_between_method_declaration_name_and_open_parenthesis = false\r\n\u0060\u0060\u0060\r\n\r\nAlso the \u0060csharp_new_line_before_open_brace = all\u0060 is not followed in the above code.\r\n\r\nUnfortunately, not all files are wrong, some indeed follow the rules...\r\n\r\nReformatting the code using Resharper changes a lot of files.\r\n\r\nNot sure what the best approach would be? Should a PR reformat the whole file, applying the editorconfig rules?\r\n\r\n\r\n\r\n",
  "author": {
    "login": "ziriax",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2020-03-28T13:01:47",
  "updatedAt": "2022-08-19T06:02:13",
  "closedAt": "2020-04-24T21:02:13",
  "commentCount": 4,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T14:12:23.0009474Z",
    "reactions": [],
    "comments": [
      {
        "id": 605446458,
        "author": "Gillibald",
        "body": "I had the impression the convention would be to have a space after the method name.\r\n\r\n\u0060SkiaApi.sk_compatpaint_new ()\u0060 vs \u0060SkiaApi.sk_compatpaint_new()\u0060 always getting anoyed of it while editing code.",
        "createdAt": "2020-03-28T13:18:52",
        "reactions": []
      },
      {
        "id": 605462491,
        "author": "ziriax",
        "body": "I have been doing software consulting for 35 years for various companies, each of them having their own (sometimes almost religious) opinions about what coding rules to follow. Today I just don\u0027t care anymore, but I want my editor to do the dirty work for me 😉 \r\n\r\nMicrosoft\u0027s Visual Studio default is no space for both \u0060csharp_space_between_method_call_name_and_opening_parenthesis\u0060  and \u0060csharp_space_between_method_declaration_name_and_open_parenthesis\u0060, but most of the SkiaSharp code doesn\u0027t seem to follow that.\r\n\r\nAnyway, IMHO if one decides to add an \u0060.editorconfig\u0060, one should reformat each modified code file, unless one is brave enough to reformat all code in one gigantic commit...\r\n\r\n\r\n\r\n\r\n",
        "createdAt": "2020-03-28T15:28:05",
        "reactions": []
      },
      {
        "id": 615337703,
        "author": "mattleibow",
        "body": "Hi folks, some of the code was written before following standards was strict-ish. So there are some mismatches. Also, some parts of the project are different 😬 \r\nWe are mostly following the .NET Foundation style, except for the \u0060binding\u0060 folder which is more mono 😬 \r\n\r\nBasically, try keep to the surrounding code, and if you spot a bad thing, look away 😆 . If you are working on that code, then feel free to correct. This helps keep the history working.",
        "createdAt": "2020-04-17T16:20:02",
        "reactions": [
          {
            "user": "daltonks",
            "content": "laugh",
            "createdAt": "2026-02-06T14:12:22.7647118Z"
          }
        ]
      },
      {
        "id": 619237347,
        "author": "mattleibow",
        "body": "Closing this as there is a general hope of conformance over time while preserving history...",
        "createdAt": "2020-04-24T21:02:13",
        "reactions": []
      }
    ]
  }
}