{
  "number": 120,
  "type": "issue",
  "state": "closed",
  "title": "Add SVG support to SkiaSharp",
  "body": "I think that full SVG support should be added to the SkiaSharp library, including SVG Animations ( https://svgwg.org/specs/animations/ ). \n\nIf SkiaSharp is going to be the engine behind Xamarin.Forms (and the whole WPF crossplatform), then SVG support is as necessary as PNG or JPG support. \nYou cannot treat SVG as a external option, something that you can delegate to a secondary framework made by amateurs.\nIt is the main vector image format around. 90% of all vector graphic resources (icons, graphic elements, UI skins, animations, backgrounds, etc...) are made in SVG, exported in SVG and distributed in SVG. Artists and designers are used to save their vector images in SVG format. App design tools like Sketch or AdobeXD export the app design storyboards as SVG files, ready to be imported in the app. Popular mobile apps like Viber use SVG SMIL animations extensively for ALL their awesome animated stickers. With the advent of the modern high density display jungle, everybody is dropping bitmap assets for SVG assets.\nIntro animations for the \u0022Onboarding\u0022 phase of new apps are now often made with SVG SMIL animated clips. The new popular SVG morphing algorithms are now used by many design tools to create animated visual transitions easily between UI states, just by choosing a start and an end SVG image. From those two inbetweens are automatically generated at 60 fps, for a smooth and modern UI.\nNo vector framework is going to succeed with developers without SVG support, no more than a bitmap imaging framework without PNG or JPG support. Other crossplatform 2D libraries like NGraphics for example already support SVG.\nThis is very urgent, otherwise Xamarin.Forms is going to be more and more detached from the needs of modern app development.\n",
  "author": {
    "login": "Emasoft",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2016-07-27T02:10:21",
  "updatedAt": "2022-08-20T00:02:31",
  "closedAt": "2016-08-02T02:25:42",
  "commentCount": 9,
  "reactionCount": 0
}