{
  "number": 1223,
  "type": "issue",
  "state": "open",
  "title": "Access violation exception in skiaSharp",
  "body": "Hi,\r\n\r\nThis is very hard for me to reproduce in a sample application. I use Draw path to draw polygons with multithreading. If I create a path in the same thread, add a polygon to it and then draw it immediately, I get an access violation exception. This only happens in release and not in debug. So it is very hard to reproduce as well. Can someone who knows the internal code tell me where I can start to reproduce this problem in debug. Also IS there any work around to avoid the crash.",
  "author": {
    "login": "nsivaram16-ihs",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2020-04-09T18:23:51",
  "updatedAt": "2020-04-13T13:19:16",
  "commentCount": 5,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T14:31:02.9524176Z",
    "reactions": [],
    "comments": [
      {
        "id": 611768993,
        "author": "mattleibow",
        "body": "We have noticed a few of these - often due to some GC collections. I believe we have the general cases fixed in the new previews. Have you tried the *1.68.2-preview.50*?",
        "createdAt": "2020-04-09T21:48:08",
        "reactions": []
      },
      {
        "id": 611789064,
        "author": "nsivaram16-ihs",
        "body": "Not yet, I can try that. WE use 1.68. This seems to be more prevalent when we use text and polygon in the same image. Especially it has problem with DrawPath and DrawPathOnText. ",
        "createdAt": "2020-04-09T22:43:26",
        "reactions": []
      },
      {
        "id": 611789857,
        "author": "mattleibow",
        "body": "The text... Might be https://github.com/mono/SkiaSharp/issues/1220",
        "createdAt": "2020-04-09T22:46:13",
        "reactions": []
      },
      {
        "id": 611790476,
        "author": "mattleibow",
        "body": "Are you able to get a minimal case that shows this issue? Also try preview 55 on the preview feed. https://aka.ms/skiasharp-eap/index.json",
        "createdAt": "2020-04-09T22:48:21",
        "reactions": []
      },
      {
        "id": 612894560,
        "author": "nsivaram16-ihs",
        "body": "It is quite difficult to produce a minimal case, as it it data specific looks. When there is dense polygons and text in the same canvas this problem seems to happen. If you dont have dense polygons or text then it works well. So creating a data set that reproduces is very difficult.",
        "createdAt": "2020-04-13T13:19:16",
        "reactions": []
      }
    ]
  }
}