{
  "number": 1270,
  "type": "issue",
  "state": "open",
  "title": "[FEATURE] Add GrTriangulator from Skia",
  "body": "**Is your feature request related to a problem? Please describe.**\r\nOn GPU backed surfaces, it is faster to use ˋDrawVertices() instead of ˋDrawPath()ˋ. So it would be helpful to have the native ˋGrTriangulatorˋ (see [here)](https://github.com/google/skia/blob/master/src/gpu/GrTriangulator.h) to convert a path with a polygon to vertices.\r\n\r\n**Describe the solution you\u0027d like**\r\nA static function that does the work.\r\n\r\n**Describe alternatives you\u0027ve considered**\r\nPerhaps a C# implementation for this could be used. But a ready made Skia version, which is maintained by the Skia team would be the better way.\r\n",
  "author": {
    "login": "charlenni",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2020-05-03T13:23:36",
  "updatedAt": "2020-06-09T19:43:42",
  "commentCount": 5,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T14:29:20.6255428Z",
    "reactions": [],
    "comments": [
      {
        "id": 623129550,
        "author": "mattleibow",
        "body": "It would be great to use the skia version, but I see it is in the src directory... The rules for that directory is that things can change at any time. Let me ask on that discussion and see that they say.\r\n\r\nhttps://groups.google.com/forum/#!topic/skia-discuss/sRecOulVo8A",
        "createdAt": "2020-05-03T15:44:29",
        "reactions": []
      },
      {
        "id": 623129844,
        "author": "mattleibow",
        "body": "Also, for reference, do you have a snippet of code on how you used that function? I want to make sure that if/when it gets added we have an actual, real-world test case.",
        "createdAt": "2020-05-03T15:46:33",
        "reactions": []
      },
      {
        "id": 623132915,
        "author": "charlenni",
        "body": "Thank you for this information.\r\n\r\nI read the answer on the Google Skia group. So it wouldn’t mit be useful to add this to SkiaSharp. Perhaps I could try to translate it to C# or I find another library to use.",
        "createdAt": "2020-05-03T16:07:42",
        "reactions": []
      },
      {
        "id": 623134673,
        "author": "mattleibow",
        "body": "Translating to C# is definitely one way. \u0060SKVertices\u0060 right now is a bit limited in the API surface, but that can change. I see they have builders and all that. We could certainly do this.\r\n\r\n",
        "createdAt": "2020-05-03T16:20:06",
        "reactions": []
      },
      {
        "id": 641530691,
        "author": "mattleibow",
        "body": "Looking at the things, this is only available in m84 so we will need to port the logic to even get it into the new m80. And, more changes have been made in the master branch. Because this code is also in the private directories, we will have to port it anyway.",
        "createdAt": "2020-06-09T19:43:42",
        "reactions": []
      }
    ]
  }
}