{
  "number": 1454,
  "type": "issue",
  "state": "closed",
  "title": "[QUESTION] Struggling to Build on Windows or Mac",
  "body": "Hi, \r\nI\u0027m struggling to build Skia Sharp. I\u0027ve tried following the instructions in https://github.com/mono/SkiaSharp/wiki/Building-SkiaSharp but I get stuck and I\u0027m not sure what I\u0027m missing. I\u0027m working on Mobile Blazor Bindings which is built on Xamarin Forms so I\u0027ll only need to work with managed code.\r\n\r\nI\u0027ve included details below, I\u0027m not sure how much of it is relevant or if I\u0027m missing anything. Any tips would be much appreciated.\r\n\r\n##Windows\r\nOn windows I\u0027m running VS 2019 16.7, I\u0027ve installed GTK 2.12.\r\n\r\nWhen I tried to run \u0060.\\bootstrapper.ps1 -t externals-download\u0060 I initially had an error \u0060You cannot run this script on the current system\u0060, which I fixed by changing the Execution Policy.\r\n\r\nAfter that I tried running again and it got stuck at \u0060Running Build script...\u0060, after about half an hour I cancelled it with \u0060control \u002B c\u0060, I ran it again and it got further but get\u0027s stuck at \u0060externals-downloaded\u0060.\r\n\r\n![Screen Shot 2020-08-09 at 2 55 35 pm](https://user-images.githubusercontent.com/29908924/89727717-a651f900-da6a-11ea-8b35-c5a0b8b8f010.png)\r\n\r\nWhen I open the source solution in VS Windows I can\u0027t build the SkiaSharp projects due to MSB3073, which is probably something to do with build order but I\u0027m not sure where to go from there.\r\n\r\n![Screen Shot 2020-08-09 at 6 04 24 pm](https://user-images.githubusercontent.com/29908924/89727807-5aec1a80-da6b-11ea-804a-e78e5e7918c3.png)\r\n\r\nI\u0027ve tried adding a NetStandard project to the solution to add new code in, strangely enough it always succeeds building or doesn\u0027t build due to being up to date, even with blatant syntax errors.\r\n\r\n## Mac\r\nI\u0027ve also tried on Mac and running \u0060./bootstrapper.sh -t externals-download \u0060 got stuck at \u0060externals-download\u0060 which I eventually cancel with \u0060control \u002B c\u0060\r\n\r\nWhen I try to build a new .Net Standard library in the solution I get these errors, even before I\u0027ve added any code.\r\n\r\n\u0060\u0060\u0060\r\nobj/Debug/netstandard2.0/Test.Version.cs(2,50,2,52): warning CS7035: The specified version string does not conform to the recommended format - major.minor.build.revision\r\nobj/Debug/netstandard2.0/Test.Version.cs(1,46,1,48): error CS7034: The specified version string does not conform to the required format - major[.minor[.build[.revision]]]\r\n\u0060\u0060\u0060\r\n\r\n \r\n",
  "author": {
    "login": "lachlanwgordon",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2020-08-09T08:31:33",
  "updatedAt": "2022-08-19T03:02:13",
  "closedAt": "2020-08-21T20:34:13",
  "commentCount": 9,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T14:15:28.7451952Z",
    "reactions": [],
    "comments": [
      {
        "id": 671064021,
        "author": "mattleibow",
        "body": "Thanks for reporting this. I had a look and this is a result of the public builds not running, and are actually disabled due to reasons.\r\n\r\nSo, I have switched this using the preview NuGet feed as a temporary/permanent storage with specific IDs. I will update the docs once the changes are merged in.\r\n\r\nThe MSBuild errors are hiding the real issue. If you look at the output, you should see the real error - I think this is a result of the multitargeting not working perfectly in the IDE.",
        "createdAt": "2020-08-09T15:14:29",
        "reactions": []
      },
      {
        "id": 671069354,
        "author": "mattleibow",
        "body": "The reason for the errors with your test project, it is because all the projects automatically get some assembly info generated from the VERSIONS.txt.\r\n\r\nI do need to document this, but all you have to do is add some properties to your new csproj:\r\n\r\n\u0060\u0060\u0060xml\r\n\u003C!-- by default, all assemblies are strong named, but some cannot, such as the Forms ones --\u003E\r\n\u003CSignAssembly\u003Efalse\u003C/SignAssembly\u003E\r\n\r\n\u003C!-- because I can\u0027t quite use multitargeting for all cases, this property represents the \u0022NuGet ID\u0022 --\u003E\r\n\u003CPackagingGroup\u003ESkiaSharp.Views.BlazorBindings\u003C/PackagingGroup\u003E\r\n\u0060\u0060\u0060\r\n\r\nOnce you have those elements in your csproj, you just need to add a line to the \u0060VERSIONS.txt\u0060 (somewhere under the \u0060# nuget versions\u0060 heading) at the repo root:\r\n\r\n\u0060\u0060\u0060\r\nSkiaSharp.Views.BlazorBindings      nuget       2.80.2\r\n\u0060\u0060\u0060\r\n\r\n\u003E NOTE: the ID can really be anything that best suits the NuGet/library.\r\n\r\nThat should be all that it takes to get a project building. After the build, all the artifacts are then copied to the \u0060output\u0060 directory into the correct folders. This \u0060PackagingGroup\u0060 will make sure to correctly place files. \r\n\r\nLet\u0027s keep this issue open, and once you have a working process, I\u0027ll create a wiki with all the steps and explanations to future library contributions are easier. I haven\u0027t really added new libraries recently, so I think I may have forgotten some gotchas that you will find 😄 \r\n\r\nThanks for looking into this.",
        "createdAt": "2020-08-09T16:01:26",
        "reactions": []
      },
      {
        "id": 671100131,
        "author": "mattleibow",
        "body": "So I fixed things with the script, so the new master should be working.\r\n\r\nJust an FYI, I think the content is hosted in East US, so everything is crazy slow when outside that region. I am trying to get something working on this...",
        "createdAt": "2020-08-09T20:57:19",
        "reactions": []
      },
      {
        "id": 671112076,
        "author": "lachlanwgordon",
        "body": "Thanks for all your tips, I\u0027ll give it a go tonight.",
        "createdAt": "2020-08-09T23:09:26",
        "reactions": []
      },
      {
        "id": 671113737,
        "author": "mattleibow",
        "body": "Just in case the download is longer than your lifetime, I also just uploaded the native files to my OneDrive: https://1drv.ms/u/s!AtbUuIrDNX_5rdJUAsENP3UAy48ozA?e=uKf3we\r\n\r\nYou can just extract that into the output folder. The result should have a list of platforms in the \u0060./output/native\u0060 folder. For example: \u0022output/native/windows\u0022, \u0022output/native/android\u0022, etc.",
        "createdAt": "2020-08-09T23:26:03",
        "reactions": []
      },
      {
        "id": 678481173,
        "author": "mattleibow",
        "body": "Closing this issue as I will be creating a wiki now.",
        "createdAt": "2020-08-21T20:34:13",
        "reactions": []
      },
      {
        "id": 678489565,
        "author": "mattleibow",
        "body": "Wiki found here: https://github.com/mono/SkiaSharp/wiki/Creating-New-Libraries",
        "createdAt": "2020-08-21T20:57:22",
        "reactions": []
      },
      {
        "id": 678569560,
        "author": "lachlanwgordon",
        "body": "Yay, thanks for your help and for WIKIing it. I didn\u0027t end up needing to build SkiaSharp because we moved the feature to Mobile Blazor Bindings repo, but hopefully I\u0027ll contribute to SkiaSharp at some point.",
        "createdAt": "2020-08-22T00:50:03",
        "reactions": [
          {
            "user": "mattleibow",
            "content": "\u002B1",
            "createdAt": "2026-02-06T14:15:28.4655052Z"
          }
        ]
      },
      {
        "id": 678685240,
        "author": "mattleibow",
        "body": "I created the wiki anyways just to collect information for any future contributors. Trying to never get anyone to say \u0022it was a bit difficult\u0022 😄 ",
        "createdAt": "2020-08-22T19:51:26",
        "reactions": []
      }
    ]
  }
}