{
  "number": 1505,
  "type": "issue",
  "state": "open",
  "title": "[QUESTION] How to enable freetype on Windows?",
  "body": "It seems the Windows version of SkiaSharp is hardcoded to use DirectWrite?\r\n\r\nI would like to be able to configure it (at runtime) to use Freetype instead.\r\n\r\nIs this possible? Would a PR be accepted for doing so?\r\n",
  "author": {
    "login": "ziriax",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2020-09-23T10:15:14",
  "updatedAt": "2024-07-13T04:14:11",
  "commentCount": 18,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T13:35:46.7052739Z",
    "reactions": [],
    "comments": [
      {
        "id": 697278881,
        "author": "ziriax",
        "body": "Interestingly, internally Skia code allows overriding the font manager for unit testing:\r\n\r\n\u0060\u0060\u0060\r\n// A global function pointer that\u0027s not declared, but can be overriden at startup by test tools.\r\nsk_sp\u003CSkFontMgr\u003E (*gSkFontMgr_DefaultFactory)() = nullptr;\r\n\r\nsk_sp\u003CSkFontMgr\u003E SkFontMgr::RefDefault() {\r\n    static SkOnce once;\r\n    static sk_sp\u003CSkFontMgr\u003E singleton;\r\n\r\n    once([]{\r\n        sk_sp\u003CSkFontMgr\u003E fm = gSkFontMgr_DefaultFactory ? gSkFontMgr_DefaultFactory()\r\n                                                        : SkFontMgr::Factory();\r\n        singleton = fm ? std::move(fm) : sk_make_sp\u003CSkEmptyFontMgr\u003E();\r\n    });\r\n    return singleton;\r\n}\r\n\u0060\u0060\u0060\r\n\r\nSo in theory, this could be used to configure the font manager at runtime, at least once, at startup?\r\n\r\n",
        "createdAt": "2020-09-23T10:32:56",
        "reactions": []
      },
      {
        "id": 697321602,
        "author": "Gillibald",
        "body": "I think there should be a proxy font manager that can be used to expose all needed functions as pointers. That would allow us to have a managed font manager and also allows us to chose an implementation at runtime.\r\n\r\nThe font manager and font host need to be compatible with each other. All this isn\u0027t trivial.",
        "createdAt": "2020-09-23T12:09:32",
        "reactions": []
      },
      {
        "id": 698178328,
        "author": "ziriax",
        "body": "It required very few changes to allow freetype on Windows, switchable once, at runtime.\r\n\r\nNot sure if this is something typical SkiaSharp users need though...\r\n\r\nHowever, since it is optional, and doesn\u0027t change existing behavior, it certainly is a nice to have? \r\n\r\nIt allows the same rendering on all platforms...\r\n",
        "createdAt": "2020-09-24T07:49:26",
        "reactions": []
      },
      {
        "id": 698182349,
        "author": "ziriax",
        "body": "Oh my, in my own tests, FreeType gives better quality rendering than DirectWrite on Windows! Crazy... So yet another reason why to allow enabling it 😉 \r\n\r\nE.g. see the difference between small French characters in the Airline font... Note that I noticed the same quality when rendering with DirectWrite directly, not using Skia...\r\n\r\n![ezgif com-gif-maker](https://user-images.githubusercontent.com/2389359/94118361-bb81bc00-fe4d-11ea-860d-90234c7bc510.gif)\r\n\r\n\r\n",
        "createdAt": "2020-09-24T07:57:29",
        "reactions": []
      },
      {
        "id": 698241282,
        "author": "Gillibald",
        "body": "Using Freetype on all platforms allows us the have proper render tests that produce the same results on every platform. I guess we just need to add a new build target for Windows that enables Freetype. ",
        "createdAt": "2020-09-24T09:51:09",
        "reactions": [
          {
            "user": "mattleibow",
            "content": "\u002B1",
            "createdAt": "2026-02-06T13:35:44.0771797Z"
          }
        ]
      },
      {
        "id": 698287588,
        "author": "ziriax",
        "body": "Yes, this is indeed also a use case for us.\r\n\r\nActually, for comparing the images in our unit tests, I ported the excellent PixelMatch library to .NET Standard:\r\n\r\nhttps://github.com/Ziriax/PixelMatch.net\r\n\r\nNote that due to CPU architecture differences, you rarely end up with exactly the same rendering when running the code on different machines... \r\n\r\n\r\n\r\n",
        "createdAt": "2020-09-24T11:34:29",
        "reactions": []
      },
      {
        "id": 698835336,
        "author": "mattleibow",
        "body": "@Ziriax could you open a PR that switches to freetype? I want to see what is needed and if all the tests are still good.\n\nThere are ways to do this, the easiest might be to have a separate package for now that allows a different libSkiaSharp. I do this for the NanoServer package. At least then folks can use this until a nice runtime check can be implemented. ",
        "createdAt": "2020-09-25T09:46:53",
        "reactions": []
      },
      {
        "id": 698868032,
        "author": "ziriax",
        "body": "A separate maintained package is perfect!\r\n\r\nYes, I can provide a PR. We have two options here:\r\n\r\n1. make a truly platform independent version of libSkiaSharp, that uses the same technology on all platforms, and *excludes* platform dependent code. It would also exclude any \u0022system global\u0022 behavior, e.g. never load system installed fonts, always require explicit typeface construction from a stream/file, etc... Skia\u0027s \u0060SkFontMgr_New_Custom_Empty\u0060 does this (it uses FreeType). We might not get this right the first time, this will be an incremental effort. This only requires changes to the \u0060.gn\u0060 files.\r\n\r\n2. allow turning on the custom empty font manager at runtime, but this must be the first call before any other Skia calls are made. This would require changes to both the \u0060C#\u0060, \u0060cpp\u0060 and \u0060.gn\u0060 files. I personally don\u0027t need this. The only reason I mentioned this, is because it would allow for backwards compatibility in the main SkiaSharp package. But it will make the package bigger by dragging in all the FreeType code, and people might complain.\r\n\r\nMy personal preference goes to (1): a truly cross platform unit testable rendering library (give or take a \u0060bit\u0060 because of CPU floating point rounding differences :wink:).\r\n",
        "createdAt": "2020-09-25T11:05:02",
        "reactions": [
          {
            "user": "mattleibow",
            "content": "laugh",
            "createdAt": "2026-02-06T13:35:44.7135912Z"
          }
        ]
      },
      {
        "id": 698917049,
        "author": "mattleibow",
        "body": "Option 1 sounds good.\n\nIf you can make the or add a variant or some args in the cake, then that should do it very well. Exactly like we do with Linux. In fact, nano server just calls into the main windows cake, so that might be nice if changes are made. ",
        "createdAt": "2020-09-25T13:05:56",
        "reactions": []
      },
      {
        "id": 840479290,
        "author": "soerendd",
        "body": "I also did this once, but at least for free type on Linux you need smth like fontconfig. This means on windows we need smth similar",
        "createdAt": "2021-05-13T10:50:55",
        "reactions": []
      },
      {
        "id": 840487291,
        "author": "ziriax",
        "body": "I our case we didn\u0027t need fontconfig, since we load the type faces manually. At least I got it working without fontconfig as far as I recall.\r\n",
        "createdAt": "2021-05-13T11:08:07",
        "reactions": []
      },
      {
        "id": 840488431,
        "author": "soerendd",
        "body": "Yes, that\u0027s exactly what I also did. But this would change the behavior of skia sharp. I would love to have the fontmanager from windows but let free type render them",
        "createdAt": "2021-05-13T11:10:20",
        "reactions": []
      },
      {
        "id": 840490420,
        "author": "soerendd",
        "body": "Another idea would be to bypass skia completely and do all the text related stuff in a different library utilizing free type and maybe also harfbuzz.\r\n@Gillibald has quite a good experience when it comes to text shaping.",
        "createdAt": "2021-05-13T11:14:21",
        "reactions": []
      },
      {
        "id": 840571293,
        "author": "Gillibald",
        "body": "Freetype doesn\u0027t require FontConfig that\u0027s just the default implementation that is being used. There is always a dictionary based font manager.",
        "createdAt": "2021-05-13T13:44:57",
        "reactions": []
      },
      {
        "id": 840651911,
        "author": "soerendd",
        "body": "@Gillibald I know, I know. But for a end user of skiasharp it\u0027s not easy to build this dictionary. And tbh, as a avalonia user I do even care less about these things. That\u0027s why I propose to build a second infrastructure either with only building the dictionary or to handle text completely on its own to get away from implementation details of skia",
        "createdAt": "2021-05-13T15:49:08",
        "reactions": []
      },
      {
        "id": 840691724,
        "author": "Gillibald",
        "body": "For Avalonia we can use any font manager implementation we want. In the end we are always able to load a Typeface via stream. By default we use Skia\u0027s font manager. Long term we will introduce our own FontConfig binding to better customize the lookup routine for Linux systems.\r\n\r\nBeing able to choose the font host implementation (DirectWrite, Freetype, X) at runtime would give us the flexibility we need. The font manager implementation isn\u0027t important.\r\n",
        "createdAt": "2021-05-13T16:54:15",
        "reactions": []
      },
      {
        "id": 840708770,
        "author": "ziriax",
        "body": "Yes, I would love to see a version of SkiaSharp where you can inject the font manager and font rendering system at runtime. This won\u0027t be easy, since I think Skia is not design that way.\r\n\r\nIn an experiment I hacked this together to allow setting it once at program startup, before any SkiaSharp call was done. That was easy, but not really usable?\r\n\r\n",
        "createdAt": "2021-05-13T17:23:05",
        "reactions": []
      },
      {
        "id": 2226764623,
        "author": "HinTak",
        "body": "Fwiw, in skia-python, we let you use \r\n\u0060SkFontMgr_New_Custom_Empty\u0060 explicitly as an alternative to the default: \r\nhttps://github.com/kyamagu/skia-python/blob/e0b030c14e33f70880cfcc502eaeed898a77fc3c/src/skia/Font.cpp#L709\r\n(Of course, on Linux the default is also freetype).",
        "createdAt": "2024-07-13T04:14:10",
        "reactions": []
      }
    ]
  }
}