{
  "number": 1803,
  "type": "issue",
  "state": "closed",
  "title": "SkiaSharp restores OpenTK libraries not compatible with net 5.0",
  "body": "I\u0027m using SkiaSharp on Windows. My project is targeting net5.0. When I restore SkiaSharp nuget package this is the warning I get:\r\n\r\nWarning NU1701: Package \u0027OpenTK 3.1.0\u0027 was restored using \u0027.NETFramework,Version=v4.6.1, .NETFramework,Version=v4.6.2, .NETFramework,Version=v4.7, .NETFramework,Version=v4.7.1, .NETFramework,Version=v4.7.2, .NETFramework,Version=v4.8\u0027 instead of the project target framework \u0027net5.0-windows7.0\u0027. This package may not be fully compatible with your project.\r\n\r\nWarning NU1701: Package \u0027OpenTK.GLControl 3.1.0\u0027 was restored using \u0027.NETFramework,Version=v4.6.1, .NETFramework,Version=v4.6.2, .NETFramework,Version=v4.7, .NETFramework,Version=v4.7.1, .NETFramework,Version=v4.7.2, .NETFramework,Version=v4.8\u0027 instead of the project target framework \u0027net5.0-windows7.0\u0027. This package may not be fully compatible with your project.\r\n\r\nI know OpenTK library is already updated to work with net 5.0 but I do not see OpenTK.GLControl being updated any more.\r\nThe question is if we OpenTK.GLControl can be removed from SkiaSharp or replaced with some other control? Also can OpenTK dependency be updated to newer version targeting net 5.0? I know I can do that directly in my project but it would be nice to have that directly from the nuget package.",
  "author": {
    "login": "vbaros",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2021-09-09T11:58:10",
  "updatedAt": "2024-09-18T19:30:11",
  "closedAt": "2024-09-18T18:04:15",
  "commentCount": 22,
  "reactionCount": 7,
  "engagement": {
    "syncedAt": "2026-02-06T12:51:27.9616786Z",
    "reactions": [
      {
        "user": "Pangamma",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:51:27.9616828Z"
      },
      {
        "user": "alexanderdibenedetto",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:51:27.9616837Z"
      },
      {
        "user": "dbowser",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:51:27.961684Z"
      },
      {
        "user": "jonchardy",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:51:27.9616843Z"
      },
      {
        "user": "OJacot-Descombes",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:51:27.9616847Z"
      },
      {
        "user": "JohnKiller",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:51:27.9616851Z"
      },
      {
        "user": "andersforsgren",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:51:27.9616854Z"
      }
    ],
    "comments": [
      {
        "id": 948693586,
        "author": "Gnimuc",
        "body": "You need to install GLWpfControl v4.1.0:\r\n\r\n\u0060\u0060\u0060\r\nInstall-Package OpenTK.GLWpfControl -Version 4.1.0\r\n\u0060\u0060\u0060\r\n\r\nYou may also need to downgrade OpenTK to [4.3, 4.4].\r\n",
        "createdAt": "2021-10-21T14:48:04",
        "reactions": []
      },
      {
        "id": 953388962,
        "author": "NogginBops",
        "body": "There actually is an updated version of GLControl. You can find it here:\r\nhttps://www.nuget.org/packages/OpenTK.WinForms/4.0.0-pre.6\r\nhttps://github.com/opentk/GLControl\r\n\r\nIt\u0027s a \u0022prerelease\u0022 but it\u0027s been stable since we released it so you can think of it like a release candidate.",
        "createdAt": "2021-10-27T23:45:11",
        "reactions": []
      },
      {
        "id": 953394101,
        "author": "Gnimuc",
        "body": "Does it support WPF?\n\n令和3年10月28日(木) 8:45 Julius Häger ***@***.***\u003E:\n\n\u003E There actually is an updated version of GLControl. You can find it here:\n\u003E https://www.nuget.org/packages/OpenTK.WinForms/4.0.0-pre.6\n\u003E https://github.com/opentk/GLControl\n\u003E\n\u003E —\n\u003E You are receiving this because you commented.\n\u003E Reply to this email directly, view it on GitHub\n\u003E \u003Chttps://github.com/mono/SkiaSharp/issues/1803#issuecomment-953388962\u003E,\n\u003E or unsubscribe\n\u003E \u003Chttps://github.com/notifications/unsubscribe-auth/ABYXW5MMJQCQSXCJRDE4V53UJCMKFANCNFSM5DW6Z2TA\u003E\n\u003E .\n\u003E\n",
        "createdAt": "2021-10-28T00:00:23",
        "reactions": []
      },
      {
        "id": 953394839,
        "author": "NogginBops",
        "body": "If you are looking for a Wpf control GLWpfControl is the best option. I think that GLControl will have the airspace issue when used in a WindowsFormsHost. But I\u0027m not sure.",
        "createdAt": "2021-10-28T00:02:06",
        "reactions": [
          {
            "user": "Gnimuc",
            "content": "\u002B1",
            "createdAt": "2026-02-06T12:51:24.42548Z"
          },
          {
            "user": "mattleibow",
            "content": "\u002B1",
            "createdAt": "2026-02-06T12:51:24.4254804Z"
          }
        ]
      },
      {
        "id": 1009389856,
        "author": "dbowser",
        "body": "\u003E There actually is an updated version of GLControl. You can find it here: https://www.nuget.org/packages/OpenTK.WinForms/4.0.0-pre.6 https://github.com/opentk/GLControl\r\n\u003E \r\n\u003E It\u0027s a \u0022prerelease\u0022 but it\u0027s been stable since we released it so you can think of it like a release candidate.\r\n\r\nI have included that package but still get the warning...\r\nHow can I prevent that from appearing? \r\n",
        "createdAt": "2022-01-10T22:07:59",
        "reactions": []
      },
      {
        "id": 2167187040,
        "author": "jeremy-visionaid",
        "body": "@mattleibow This is a bigger problem for SkiaSharp.Views.WindowsForms 3.0.0-preview.x since previously SkiaSharp could be used in a WinForms app by referencing SkiaSharp.Views.Desktop.Common. But the Extensions have now been moved to SkiaSharp.Views.WindowsForms, which leads to NU1701 if attempting to use it (it resolves to net462 rather than net7.0-windows10.0.19041).",
        "createdAt": "2024-06-14T04:27:04",
        "reactions": [
          {
            "user": "OJacot-Descombes",
            "content": "\u002B1",
            "createdAt": "2026-02-06T12:51:24.7943399Z"
          }
        ]
      },
      {
        "id": 2268347000,
        "author": "andersforsgren",
        "body": "@dbowser Did you ever find a solution to this?\r\n\r\nI\u0027m facing the same issue, is there a workaround for this now several years later? \r\nSkiaSharp.Views.WindowsForms for net8.0 has a dependency on OpenTK.GlControl for net4X which doesn\u0027t work. \r\nIs this expected? It happens both with 2.88.0 and 3.0.0-preview. \r\n\r\n\r\n\r\n\r\n\r\n",
        "createdAt": "2024-08-05T07:17:31",
        "reactions": [
          {
            "user": "JohnKiller",
            "content": "\u002B1",
            "createdAt": "2026-02-06T12:51:25.0016295Z"
          }
        ]
      },
      {
        "id": 2269943431,
        "author": "jeremy-visionaid",
        "body": "@andersforsgren I use SkiaSharp.Views.Desktop.Common (which doesn\u0027t bring in OpenTK) and then wrote my own custom control using OpenTK.Graphics. It\u0027s not a lot of code to roll your own, but the OpenTK bindings leave a lot to be desired (esp. with ANGLE).",
        "createdAt": "2024-08-05T21:23:35",
        "reactions": []
      },
      {
        "id": 2269957505,
        "author": "NogginBops",
        "body": "@jeremy-visionaid what about the OpenTK bindings are lacking?",
        "createdAt": "2024-08-05T21:33:23",
        "reactions": []
      },
      {
        "id": 2270005670,
        "author": "jeremy-visionaid",
        "body": "@NogginBops Oh dear. I didn\u0027t spot you on the chain here. Now I feel bad for being harsh. I\u0027m grateful that I was able to build upon your work which made all this stuff possible to begin with. So, please accept my apologies. \r\n\r\nI\u0027d thought about opening a PR to address some of the stuff but it would have broken/altered the public API for OpenTK, so I just redefined some stuff internally to make things easier and ship on time. So, some things that I would have in OpenTK that would have helped with my task:\r\n\r\nFirstly, IIRC some of the constant names that are defined don\u0027t match the upstream definitions. I don\u0027t recall exactly which ones they were, but I recall it making it hard to write against the extensions because of discrepancies.\r\n\r\nSecondly, not all the required constants are defined. I\u0027m happy to paste some of them here, but it\u0027s not exhaustive (unless I\u0027ve missed something, stuff like EGL_NO_CONTEXT etc. are also not present):\r\n\r\n\u0060\u0060\u0060\r\n    const int PLATFORM_ANGLE_DEVICE_TYPE_NULL_ANGLE = 0x345E;\r\n    const int PLATFORM_ANGLE_DEBUG_LAYERS_ENABLED_ANGLE = 0x3451;\r\n    const int EXPERIMENTAL_PRESENT_PATH_ANGLE = 0x33A4;\r\n    const int EXPERIMENTAL_PRESENT_PATH_FAST_ANGLE = 0x33A9;\r\n    const int EXPERIMENTAL_PRESENT_PATH_COPY_ANGLE = 0x33AA;\r\n\u0060\u0060\u0060\r\n\r\nLastly, the app I\u0027m working on aims to be high performance and low latency, so I\u0027d prefer bindings that accept spans instead of arrays. Not exactly a problem for EGL I know, but with netstandard2.1 and later I\u0027d think that would be the most favourable signature to work against.\r\n\r\n",
        "createdAt": "2024-08-05T22:10:14",
        "reactions": []
      },
      {
        "id": 2270063183,
        "author": "dbowser",
        "body": "\u003E @dbowser Did you ever find a solution to this?\r\n\u003E \r\nNo, sadly we gave up and used a commercial library instead. After not seeing this addressed, we didn\u0027t have the confidence to use the package. ",
        "createdAt": "2024-08-05T23:02:52",
        "reactions": []
      },
      {
        "id": 2270079357,
        "author": "NogginBops",
        "body": "@jeremy-visionaid It\u0027s fine being harsh, getting feedback is important and often the most important feedback never gets where it needs to. If you have time it would be great if you could open an issue or two about what you would like to see be different. Even if it can\u0027t be solved in OpenTK 4 (which it very well might be) we could make sure we have things fixed for OpenTK 5.\r\n\r\nI have recently been using the OpenTK EGL bindings in combination with ANGLE for the new OpenTK 5 platform support and while doing that work I\u0027ve also noted that some of the constants are missing. I\u0027ve created a PR with the fixes I had in my working branch #1732, would be really appreciated if you could comment the list of missing constants that you found so I could add them. :)\r\n\r\nAs for spans, it would be totally reasonable to add span overloads to the EGL functions, if you could open an issue about this so I can remember to do it. As for the OpenTK 4 OpenGL bindings it\u0027s quite a bit more work to make that happen. OpenTK 5 has a new bindings generator which generate span overloads, so that is something atleast.",
        "createdAt": "2024-08-05T23:18:05",
        "reactions": [
          {
            "user": "jeremy-visionaid",
            "content": "\u002B1",
            "createdAt": "2026-02-06T12:51:25.9658468Z"
          }
        ]
      },
      {
        "id": 2270091488,
        "author": "jeremy-visionaid",
        "body": "@NogginBops Thats, awesome, thanks for being so responsive. I\u0027d happily look to port to the preview and try and get some feedback/PRs on it if there are problems so I can remove the extra bits from my project. 👍 \r\n\r\n@dbowser I\u0027m sorry to hear that you had to target something else. I\u0027ve generally found SkiaSharp to be really good, but admitedly there can be a bit of manual effort to get things off the ground for hardware acceleration for instance. I\u0027d love to see the Direct3D back-end finished off and merged (#2817), then I wouldn\u0027t even need OpenGL.",
        "createdAt": "2024-08-05T23:30:23",
        "reactions": []
      },
      {
        "id": 2313336652,
        "author": "NogginBops",
        "body": "@jeremy-visionaid I created this PR from this discussion https://github.com/opentk/opentk/pull/1732 but I think I forgot to link or tag you in the issue, so if you are still able to produce a list of missing constants that would be fantastic!",
        "createdAt": "2024-08-27T19:21:48",
        "reactions": [
          {
            "user": "jeremy-visionaid",
            "content": "\u002B1",
            "createdAt": "2026-02-06T12:51:26.3325367Z"
          }
        ]
      },
      {
        "id": 2313775995,
        "author": "jeremy-visionaid",
        "body": "@NogginBops  I\u0027m sorry I\u0027ve been too bogged down in other urgent work to get to look at OpenTK 5 yet, but I\u0027ll certainly take a look at the PR and comment there. Thanks again!",
        "createdAt": "2024-08-28T00:03:02",
        "reactions": []
      },
      {
        "id": 2325633953,
        "author": "mattleibow",
        "body": "I am not sure what the best solution is here since there is no stable opentk GL control for winforms.\n\nThe nuget warning is just a warning and I think if you explicitly reference it and add a nowarn to the package reference then it may just keep working.\n\nAn alternative is for us to move to 4.x, but we probably will need a stable version of those packages. Is there any technical reason why it is not stable? Or is it more that there is no active development on it?\n\nFor wpf we merged a PR to move the net7\u002B things to the 4.x series because we got a stable version. If this is really something that people need for net8 and the warning is super bad for some reason, then maybe getting the GL control stable and in a state where those maintainers are comfortable releasing is the next step here?\n\nI think the 3.x series works, but a warning is not ideal and it is not maintained much I think? ",
        "createdAt": "2024-09-03T05:30:33",
        "reactions": []
      },
      {
        "id": 2325640725,
        "author": "mattleibow",
        "body": "A stable skia nuget depending on a prerelease nuget may be totally fine, but it may scare some companies more that a warning which they may just be ignoring...\n\nWe could potentially keep netfx on 3 and move net7\u002B to 4 and live with the fact that scared enterprises will still be on netfx and never know but the young and hip netcore-ers are always on the edge. But, I will need to talk to people. If I was independent, then I could do it, but I got managers and scared enterprises who know those managers :) ",
        "createdAt": "2024-09-03T05:36:22",
        "reactions": []
      },
      {
        "id": 2325646872,
        "author": "mattleibow",
        "body": "@NogginBops is there a reason the stable preview is not a stable nuget? If you are thinking that it is good and nothing terrible has happened, would be some way to go stable in the near-ish future?\n\nWe could start the process today and make preview 3.x skia depend on preview 4.x winforms. I want to release stable in time for .net conf, but I got a baby coming this months so who knows. I will try to get stable, but maybe it will be in the new year once all the celebrations stop and then we can start the new year with stable.\n\nWe shall see, but if opentk is open to going stable in the next 6 months or so then I think this could be a plan? ",
        "createdAt": "2024-09-03T05:42:37",
        "reactions": []
      },
      {
        "id": 2326476652,
        "author": "NogginBops",
        "body": "\u003E @NogginBops is there a reason the stable preview is not a stable nuget? If you are thinking that it is good and nothing terrible has happened, would be some way to go stable in the near-ish future?\r\n\r\nI\u0027ve been meaning to release a release version of the package for quite a while, we\u0027ve not gotten a lot of bug reports about the current prerelease version for the almost a year it\u0027s been out.\r\n\r\nI\u0027ll see if I\u0027m able to release a stable version of the package today. The package will have the same old name \u0060OpenTK.GLControl\u0060 instead of the \u0022new\u0022 \u0060OpenTK.WinForms\u0060 package. Should make it easier for everyone to find the new package.",
        "createdAt": "2024-09-03T13:05:08",
        "reactions": []
      },
      {
        "id": 2327017952,
        "author": "NogginBops",
        "body": "@mattleibow I just released \u0060OpenTK.GLControl 4.0.0\u0060 https://www.nuget.org/packages/OpenTK.GLControl/4.0.0 (and \u0060OpenTK.WinForms 4.0.0-pre.8\u0060 which is deprecated and points to \u0060OpenTK.GLControl 4.0.0\u0060.)\r\n\r\nIf you have any issues with it please open an issue about it https://github.com/opentk/GLControl/issues/new",
        "createdAt": "2024-09-03T17:00:59",
        "reactions": [
          {
            "user": "molesmoke",
            "content": "hooray",
            "createdAt": "2026-02-06T12:51:27.4994668Z"
          },
          {
            "user": "mattleibow",
            "content": "hooray",
            "createdAt": "2026-02-06T12:51:27.4994672Z"
          },
          {
            "user": "jeremy-visionaid",
            "content": "hooray",
            "createdAt": "2026-02-06T12:51:27.4994673Z"
          }
        ]
      },
      {
        "id": 2328720293,
        "author": "mattleibow",
        "body": "@NogginBops cool! I\u0027ll make a PR to update skia to use the new version on new dotnet.\n\nThanks. ",
        "createdAt": "2024-09-04T11:40:28",
        "reactions": [
          {
            "user": "jeremy-visionaid",
            "content": "hooray",
            "createdAt": "2026-02-06T12:51:27.7116516Z"
          }
        ]
      },
      {
        "id": 2359249489,
        "author": "mattleibow",
        "body": "Merge the PR and trying to get it out in a preview 5",
        "createdAt": "2024-09-18T19:30:09",
        "reactions": [
          {
            "user": "molesmoke",
            "content": "hooray",
            "createdAt": "2026-02-06T12:51:27.9114434Z"
          }
        ]
      }
    ]
  }
}