{
  "number": 1893,
  "type": "issue",
  "state": "closed",
  "title": "Support for GPU Acceleration for WinUI3",
  "body": "GPU Acceleration is important in SkiaSharp for scenarios where you have large fill areas on high dpi monitors, as well as just general performance maximization. It\u0027s important that GPU acceleration is also supported for the WinUI3 platform.\r\n\r\nIt seems the challenge was lack of support for Angle. Is this still valid? Are there alternatives?\r\n",
  "author": {
    "login": "gmurray81",
    "type": "User"
  },
  "labels": [
    {
      "name": "type/enhancement",
      "color": "84b6eb"
    },
    {
      "name": "status/help-wanted",
      "color": "B8EC4A"
    },
    {
      "name": "backend/OpenGL",
      "color": "1acea7"
    },
    {
      "name": "os/Windows-WinUI",
      "color": "fbca04"
    }
  ],
  "assignees": [],
  "createdAt": "2021-12-16T22:03:03",
  "updatedAt": "2024-04-01T06:46:10",
  "closedAt": "2024-02-03T10:25:19",
  "commentCount": 48,
  "reactionCount": 12,
  "engagement": {
    "syncedAt": "2026-02-06T12:55:16.882594Z",
    "reactions": [
      {
        "user": "MineCake147E",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:55:16.8826095Z"
      },
      {
        "user": "inforithmics",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:55:16.8826102Z"
      },
      {
        "user": "rick-palmsens",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:55:16.8826105Z"
      },
      {
        "user": "gmurray81",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:55:16.8826108Z"
      },
      {
        "user": "3D-aero-sbahr",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:55:16.882611Z"
      },
      {
        "user": "SparkieLabs",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:55:16.8826112Z"
      },
      {
        "user": "thomasstockermc",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:55:16.8826113Z"
      },
      {
        "user": "simon-knuth",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:55:16.8826114Z"
      },
      {
        "user": "yoshiask",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:55:16.8826115Z"
      },
      {
        "user": "VRage",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:55:16.8826116Z"
      },
      {
        "user": "TopperDEL",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:55:16.8826116Z"
      },
      {
        "user": "FrozenAssassine",
        "content": "\u002B1",
        "createdAt": "2026-02-06T12:55:16.8826117Z"
      }
    ],
    "comments": [
      {
        "id": 998730026,
        "author": "rick-palmsens",
        "body": "We are running into the same issue, our application is really struggling when drawing real time plots on high dpi monitors.",
        "createdAt": "2021-12-21T12:14:26",
        "reactions": []
      },
      {
        "id": 1012831492,
        "author": "3D-aero-sbahr",
        "body": "We are very interested in the GPU acceleration as well using Uno Platform with WinUI 3 main head.",
        "createdAt": "2022-01-14T07:03:28",
        "reactions": []
      },
      {
        "id": 1065175933,
        "author": "gmurray81",
        "body": "This is especially important because I recently evaluated Win2D in WinUI3 and was very disappointed with the performance compared to SkiaSharp in SOFTWARE mode. Perhaps I was doing something wrong, But ATM it seems like SkiaSharp is the right answer for high performance 2D rendering in WinUI3",
        "createdAt": "2022-03-11T14:42:05",
        "reactions": []
      },
      {
        "id": 1179570647,
        "author": "gmurray81",
        "body": "Any updates on this?",
        "createdAt": "2022-07-09T16:32:22",
        "reactions": []
      },
      {
        "id": 1385986398,
        "author": "p2pbsh",
        "body": "Bump, any updates on this one? Running into WinUI performance issues too.",
        "createdAt": "2023-01-17T20:06:18",
        "reactions": []
      },
      {
        "id": 1432551099,
        "author": "levinli303",
        "body": "ANGLE needs to be patched to be used in WinUI 3, I have a sample project which uses a patched version of ANGLE in WinUI 3. https://github.com/levinli303/WinUIANGLE, the detail of the patch is in https://github.com/levinli303/vcpkg/tree/angle-winui, hopefully someone will find it useful.",
        "createdAt": "2023-02-16T05:37:41",
        "reactions": [
          {
            "user": "gmurray81",
            "content": "\u002B1",
            "createdAt": "2026-02-06T12:55:08.4412054Z"
          }
        ]
      },
      {
        "id": 1731298148,
        "author": "TopperDEL",
        "body": "Just for my understanding: SKXamlCanvas does not use GPU-Acceleration right now, correct? What needs to be done on your/my side to enable GPU-acceleration? I don\u0027t understand the comment from @levinli303 above and if this could help me. Do I need to compile ANGLE myself?",
        "createdAt": "2023-09-22T12:00:11",
        "reactions": []
      },
      {
        "id": 1731549003,
        "author": "mattleibow",
        "body": "The current issue is that we require ANGLE to be rebuilt using the new WinUI types. The current implementation is just for UWP and the ANGLE team is not really interested in adding another Windows platform.\r\n\r\nSince we are already using all the Google build tools such as gn/ninja, we _can_ build it as part of the SkiaSharp build. However, someone needs to do the bit of work to update the type references and somehow (I am not sure yet) reference all the correct files in the WindowsAppSDK nuget package.\r\n\r\nOnce we get a build of ANGLE for WinUI 3, then I can uncomment the code that we already have for the SkiaSharp GL view.\r\n\r\nAs of today, none of the work is really SkiaSharp or native skia work.\r\n\r\nAll the work needs to be done is to fork (and hopefully PR back) the Google ANGLE code and make the required modifications: https://chromium.googlesource.com/angle/angle\r\n\r\nThe required code is probably all here: https://github.com/levinli303/vcpkg/tree/angle-winui\r\n\r\nBut instead of SkiaSharp depending on layers of patches and then using vcpkg to build those patches, we should just make those modifications in a normal way and upstream. Google is open to a nice PR and I am sure if we _just_ get the code changes to them they will accept it. They are probably not really interested in building and testing the new platform - not sure they do that for UWP anyways.\r\n\r\nI see the forked vcpkg does a lot of things to extract and generate files - and we can do that too in the ANGLE code using some python scripts. All doable, just I do not have the time to work on that.",
        "createdAt": "2023-09-22T14:46:01",
        "reactions": [
          {
            "user": "malstraem",
            "content": "\u002B1",
            "createdAt": "2026-02-06T12:55:08.8204547Z"
          }
        ]
      },
      {
        "id": 1731553405,
        "author": "mattleibow",
        "body": "Making this work will also help the Uno Platform apps ;) So if anyone who is a big Uno fan...",
        "createdAt": "2023-09-22T14:48:52",
        "reactions": []
      },
      {
        "id": 1732212741,
        "author": "levinli303",
        "body": "there\u0027s a slightly updated version of the patch for ANGLE on WinUI here (that should work with WinAppSDK 1.4.1) https://github.com/celestiamobile/vcpkg/commit/abac0a9a434f0b91b836c3ee6456f18aaa9f21c3",
        "createdAt": "2023-09-23T04:54:11",
        "reactions": []
      },
      {
        "id": 1732237515,
        "author": "TopperDEL",
        "body": "Can you work @levinli303 converted into a PR? It seems you know what you are doing - I don\u0027t understand whats Happening in your Patch and how all stitches together.\r\nThank you! ",
        "createdAt": "2023-09-23T07:09:24",
        "reactions": []
      },
      {
        "id": 1734857640,
        "author": "levinli303",
        "body": "i\u0027m not familiar with SkiaSharp but i\u0027m happy to provide more info and assist if anyone wants to make it work.",
        "createdAt": "2023-09-26T05:33:05",
        "reactions": []
      },
      {
        "id": 1734868542,
        "author": "TopperDEL",
        "body": "From my understanding Skiasharp does not have to be changed that much - am I right @mattleibow? As long as ANGLE gets support for WinUI it should be ok. So getting a PR done for ANGLE should mostly be it.",
        "createdAt": "2023-09-26T05:47:21",
        "reactions": []
      },
      {
        "id": 1735452538,
        "author": "levinli303",
        "body": "i don\u0027t think my patch can be upstreamed to Google\u0027s ANGLE easily. In addition to the patch being dirty (enabling the UWP path on Win32 in order to use the SwapChainPanel), https://github.com/celestiamobile/vcpkg/blob/56dcda1c419e9efefa36454f15e291a6ff9f558f/ports/angle/portfile.cmake#L155 makes the generated libs tied to the version of WindowsAppSDK specified. Some time ago I tried using the ANGLE built against WindowsAppSDK 1.2 in a WindowsAppSDK 1.3 project with SwapChainPanel, it does not work.\r\n\r\nI would suggest keep a separate fork of google/angle",
        "createdAt": "2023-09-26T12:32:16",
        "reactions": []
      },
      {
        "id": 1735514893,
        "author": "TopperDEL",
        "body": "I\u0027ve added a 50$ bounty on Gitpay for this issue to be solved - I hope that is at least a start. I digged into ANGLE for a moment but I am completely lost.",
        "createdAt": "2023-09-26T13:10:57",
        "reactions": [
          {
            "user": "alexanmtz",
            "content": "\u002B1",
            "createdAt": "2026-02-06T12:55:10.189018Z"
          },
          {
            "user": "r2d2Proton",
            "content": "\u002B1",
            "createdAt": "2026-02-06T12:55:10.1890182Z"
          }
        ]
      },
      {
        "id": 1746812174,
        "author": "ShadowMarker789",
        "body": "I suppose theoretically a new backend for Skia could be made that uses D3D11 or D3D12 directly instead of using ANGLE. \r\n\r\nThat sounds like perhaps more work than modifying ANGLE to work with the WinUI3 types. ",
        "createdAt": "2023-10-04T12:48:50",
        "reactions": []
      },
      {
        "id": 1746813946,
        "author": "TopperDEL",
        "body": "Are you capable of doing this? :)",
        "createdAt": "2023-10-04T12:49:55",
        "reactions": []
      },
      {
        "id": 1746864579,
        "author": "Sergio0694",
        "body": "\u003E \u0022I recently evaluated Win2D in WinUI3 and was very disappointed with the performance compared to SkiaSharp in SOFTWARE mode. Perhaps I was doing something wrong\u0022\r\n\r\n@gmurray81 you were most definitely doing something wrong. There is absolutely no way whatsoever that can be true. Win2D is a very thin wrapper over D2D, which is extremely fast. You\u0027d need to elaborate further (in some other issue) for others to understand what was going on there.",
        "createdAt": "2023-10-04T13:19:25",
        "reactions": []
      },
      {
        "id": 1746867472,
        "author": "ShadowMarker789",
        "body": "\u003E Are you capable of doing this? :)\r\n\r\nI doubt it. \r\n\r\nHave you considered taking a look at how Avalonia uses ANGLE? \r\n\r\nI vaguely recall them mentioning that they maintain their own fork of ANGLE. They use it for their Skia implementation on Windows, as they find its performance is better than WGL. ",
        "createdAt": "2023-10-04T13:20:57",
        "reactions": []
      },
      {
        "id": 1746919282,
        "author": "gmurray81",
        "body": "@Sergio0694 unfortunately, It\u0027s a bit hard to decompose what I\u0027m doing into individual areas that can be analyzed, since I\u0027m attempting to implement a layer for our charting product that targets Win2d, and the framerates were just not acceptable compared to Skia. This may have been self inflicted, for example, perhaps I was creating and destroying resources that need to be cached.\r\n\r\nBUT, I heavily suspect based on my past interactions with Direct2D both directly and via WPF that there are some inefficiencies how Direct2D tessellates a complex polyline to render it on the GPU. Perhaps this has been fixed in later versions of Direct2D, though.\r\n\r\nTry this as an example. Create a polyline that oscillates up and down in the y direction entirely randomly and with high frequency. Render this in WPF and modify it with a high framerate. This will bring WPF to its knees. Again, could be fixed in later Direct2d (doesn\u0027t help WPF) but may help Win2d. \r\n\r\nAnyhow, I don\u0027t know if it was scenarios like that which were causing the performance to be worse than software based Skia. But that\u0027s one of the scenarios I\u0027ve experienced in the past that Skia handles much more gracefully than WPF (old Direct2d)\r\n\r\nFunny story actually. The Chromium/Skia team actually broke this scneario when they first enabled the GPU support in Chrome, and I needed to report a bug, which they then fixed (not sure how, maybe they adjusted the way the prepped the lines for the GPU, or maybe they detect the scenario with heuristics and use a raster fallback)\r\n\r\nhttps://bugs.chromium.org/p/chromium/issues/detail?id=102165\u0026can=1\u0026q=reporter%3Agmurray%40gmail.com\r\n\r\nAnyhow, may not be that scenario, since I don\u0027t think I was testing anything related to that. But this is an example of the fact that what I\u0027m testing is non-trivial polyline and polygon rendering. So perhaps Win2D is not optimized enough for certain types of shapes, etc, because traditionally Direct2D has _definitely_ had some issues in this regard. To this day, you can feed a shape like this to WPF and it will just refuse to process it well.",
        "createdAt": "2023-10-04T13:49:15",
        "reactions": []
      },
      {
        "id": 1746930087,
        "author": "gmurray81",
        "body": "Also note though, I\u0027ve definitely had some issues from WinUI in the past also where it just seemed like there was too much tax being paid to bridge between managed/native. E.g. it seemed like all the data binding/dep prop stuff was pretty slow, presumably from being pretty chatty over that seam. The nature of my interaction with Win2D is also pretty chatty and from C# so there could be too much tax being paid to just funnel the information to Win2D for rendering. If managed/native bridging from WinUI to native libraries has been improved over time, then perhaps that will help also.\r\n\r\nI haven\u0027t had the opportunity to test out the behavior of the Win2D layer I built against newer WinUI/Win2D versions in a while.",
        "createdAt": "2023-10-04T13:55:07",
        "reactions": []
      },
      {
        "id": 1748081896,
        "author": "ShadowMarker789",
        "body": "@gmurray81 Can you mock up a Skia drawing routine that you find performs poorly when not accelerated, and performs well when accelerated? \r\n\r\nA method that takes in as a parameter SKPaintSurfaceEventArgs would do. ",
        "createdAt": "2023-10-05T05:41:21",
        "reactions": []
      },
      {
        "id": 1752933139,
        "author": "ShadowMarker789",
        "body": "\u003E Are you capable of doing this? :)\r\n\r\nWould you know where to start doing that? \r\n\r\nI have no familiarity with Skia\u0027s codebase and am a bit lost delving into the repository so far. ",
        "createdAt": "2023-10-09T12:37:58",
        "reactions": []
      },
      {
        "id": 1752943343,
        "author": "Sergio0694",
        "body": "\u003E \u0022BUT, I heavily suspect based on my past interactions with Direct2D both directly and via WPF that there are some inefficiencies how Direct2D tessellates a complex polyline to render it on the GPU. Perhaps this has been fixed in later versions of Direct2D, though.\u0022\r\n\r\n@gmurray81 I\u0027m not entirely sure I\u0027m following, are you _sure_ we\u0027re talking about the same things here? You mention WPF, but that has its own **DX9** renderer. I\u0027m talking about Win2D, which runs on top of D2D, which uses **DX11** behind the scenes. WPF does _not_ use D2D in its renderer. Unless you specifically used Win2D (or D2D directly) from WPF (ie. you either referenced Win2D and used its canvas control via a XAML Island, or manually setup the Win32 interop to manage an HWND-based swapchain, or something else), then chances are you didn\u0027t actually use D2D at all. Is it possible there\u0027s a misunderstanding there about the various technologies? And if you _did_ in fact use D2D, then yeah you most definitely just did something wrong, because as I said I just don\u0027t see how it could possibly be slower than Skia in software mode (or even if it was hardware accelerated), that just doesn\u0027t really make sense to me 😅\r\n\r\nEg. you talked about \u0022creating a polyline\u0022. If [this](https://learn.microsoft.com/en-us/dotnet/desktop/wpf/graphics-multimedia/how-to-draw-a-polyline-by-using-the-polyline-element) is the \u0060PolyLine\u0060 you mean, yeah that\u0027s not Win2D/D2D at all.",
        "createdAt": "2023-10-09T12:44:37",
        "reactions": []
      },
      {
        "id": 1803847725,
        "author": "TopperDEL",
        "body": "This topic is quite important for my use-case - so I would love to see this tackled by anyone with knowledge in this space. I unfortunately do not have any clue what needs to be done.\r\n\r\nBut I raise the bounty for solving this issue to 500$.",
        "createdAt": "2023-11-09T13:37:17",
        "reactions": []
      },
      {
        "id": 1803964420,
        "author": "levinli303",
        "body": "I might take a look and see if I can build a demo when I have time. Assuming the work here required would be just building ANGLE for WinUI (which is already done sometime ago) and switch SkiaSharp to Microsoft.UI.Xaml.Controls.SwapChainPanel from Windows.UI.Xaml.Controls.SwapChainPanel",
        "createdAt": "2023-11-09T14:43:36",
        "reactions": []
      },
      {
        "id": 1804052218,
        "author": "TopperDEL",
        "body": "That would be awesome! 🎉",
        "createdAt": "2023-11-09T15:30:36",
        "reactions": []
      },
      {
        "id": 1805076715,
        "author": "levinli303",
        "body": "i\u0027ve built the latest ANGLE against the latest WindowsAppSDK 1.4.231008000 here\r\n[angle.zip](https://github.com/mono/SkiaSharp/files/13315496/angle.zip)\r\n\r\nhowever i am struggling to make SkiaSharp compile (i have not made changes yet):\r\n\u0060\u0060\u0060\r\nError occurred while restoring NuGet packages: Invalid restore input. The original target frameworks value must match the aliases. Original target frameworks: netstandard2.0;netstandard2.1;net462;net7.0;net462;net7.0-windows10.0.19041.0, aliases: netstandard2.0;netstandard2.1;net462;net7.0;net7.0-windows10.0.19041.0. Input files: REDACTED\\SkiaSharp\\source\\SkiaSharp.Views\\SkiaSharp.Views.Desktop.Common\\SkiaSharp.Views.Desktop.Common.csproj.\r\n\u0060\u0060\u0060\r\n",
        "createdAt": "2023-11-10T04:40:44",
        "reactions": [
          {
            "user": "MartinZikmund",
            "content": "\u002B1",
            "createdAt": "2026-02-06T12:55:12.8053716Z"
          }
        ]
      },
      {
        "id": 1805343317,
        "author": "TopperDEL",
        "body": "\u003E i\u0027ve built the latest ANGLE against the latest WindowsAppSDK 1.4.231008000 here [angle.zip](https://github.com/mono/SkiaSharp/files/13315496/angle.zip)\r\n\u003E \r\n\u003E however i am struggling to make SkiaSharp compile (i have not made changes yet):\r\n\u003E \r\n\u003E \u0060\u0060\u0060\r\n\u003E Error occurred while restoring NuGet packages: Invalid restore input. The original target frameworks value must match the aliases. Original target frameworks: netstandard2.0;netstandard2.1;net462;net7.0;net462;net7.0-windows10.0.19041.0, aliases: netstandard2.0;netstandard2.1;net462;net7.0;net7.0-windows10.0.19041.0. Input files: REDACTED\\SkiaSharp\\source\\SkiaSharp.Views\\SkiaSharp.Views.Desktop.Common\\SkiaSharp.Views.Desktop.Common.csproj.\r\n\u003E \u0060\u0060\u0060\r\n\r\nMaybe @mattleibow knows something about this?",
        "createdAt": "2023-11-10T09:03:10",
        "reactions": [
          {
            "user": "MartinZikmund",
            "content": "\u002B1",
            "createdAt": "2026-02-06T12:55:13.0418975Z"
          }
        ]
      },
      {
        "id": 1827742955,
        "author": "TopperDEL",
        "body": "Any news on this one?",
        "createdAt": "2023-11-27T12:28:34",
        "reactions": [
          {
            "user": "taublast",
            "content": "confused",
            "createdAt": "2026-02-06T12:55:13.2396009Z"
          },
          {
            "user": "MartinZikmund",
            "content": "heart",
            "createdAt": "2026-02-06T12:55:13.2396012Z"
          }
        ]
      },
      {
        "id": 1887515735,
        "author": "mattleibow",
        "body": "@levinli303 I will take a look and see. Have you had any further success with building skia? The main branch should be much better now.\r\n\r\nAlso, where is the code to build angle now? Do we need anything to get this upstreamed to vspkg or are there too many changes? I could help with PRs to push small changes up to ANGLE as they might be open to take things.",
        "createdAt": "2024-01-11T16:21:51",
        "reactions": []
      },
      {
        "id": 1887526469,
        "author": "mattleibow",
        "body": "Thanks for the zips, I will try and get things working at least. Maybe for now I can just do the SkiaSharp part and then folks can pull in a separate nuget of ANGLE until we get all this more official.\r\n\r\nI am wanting to avoid more forks of things as it is getting a bit fork-heavy and harder for me to maintain.",
        "createdAt": "2024-01-11T16:27:54",
        "reactions": []
      },
      {
        "id": 1887579695,
        "author": "mattleibow",
        "body": "\u003E Maybe @mattleibow knows something about this?\r\n\r\nI also use the \u0060samples\\Basic\\WinUI\\SkiaSharpSample.sln\u0060 solution and skip everything.",
        "createdAt": "2024-01-11T16:58:21",
        "reactions": [
          {
            "user": "taublast",
            "content": "rocket",
            "createdAt": "2026-02-06T12:55:13.8416961Z"
          }
        ]
      },
      {
        "id": 1888137473,
        "author": "mattleibow",
        "body": "I managed to get it all working! https://github.com/mono/SkiaSharp/compare/main...dev/winui-gpu\r\n\r\nNot that this all works, we need to get that vcxpkg stuff merged in so I can include as part of CI. @levinli303 have you tried upstreaming it? I see a lot of changes that is a remove. Maybe we can rather wrap it in conditions? like a \u0060#if BUILD_FOR_WINUI\u0060 and then enabled/disable things?\r\n\r\nI had an idea that we could alias things a bit and see what happens...\r\n\r\n\u0060\u0060\u0060cpp\r\nnamespace ABI::Windows::UI::Xaml::Controls\r\n{\r\n    using ISwapChainPanel = ::ABI::Microsoft::UI::Xaml::Controls::ISwapChainPanel;\r\n}\r\n\u0060\u0060\u0060\r\n\r\nIs that possible then there will be far fewer places to change?",
        "createdAt": "2024-01-11T23:38:42",
        "reactions": [
          {
            "user": "TopperDEL",
            "content": "rocket",
            "createdAt": "2026-02-06T12:55:14.0623315Z"
          },
          {
            "user": "nor0x",
            "content": "rocket",
            "createdAt": "2026-02-06T12:55:14.0623317Z"
          },
          {
            "user": "gmurray81",
            "content": "rocket",
            "createdAt": "2026-02-06T12:55:14.0623318Z"
          }
        ]
      },
      {
        "id": 1906955193,
        "author": "mattleibow",
        "body": "I created an issue: https://bugs.chromium.org/p/angleproject/issues/detail?id=8490\r\nANd then also a CR: https://chromium-review.googlesource.com/c/angle/angle/\u002B/5230637\r\n\r\nI will try and get these changes merged soon. I am not 100% sure how long it will take, but I will try make friends with everyone.a",
        "createdAt": "2024-01-23T21:33:01",
        "reactions": [
          {
            "user": "TopperDEL",
            "content": "heart",
            "createdAt": "2026-02-06T12:55:14.2505479Z"
          },
          {
            "user": "TopperDEL",
            "content": "hooray",
            "createdAt": "2026-02-06T12:55:14.2505481Z"
          },
          {
            "user": "gmurray81",
            "content": "hooray",
            "createdAt": "2026-02-06T12:55:14.2505481Z"
          },
          {
            "user": "taublast",
            "content": "heart",
            "createdAt": "2026-02-06T12:55:14.2505482Z"
          }
        ]
      },
      {
        "id": 1906955837,
        "author": "mattleibow",
        "body": "If anyone has friends at Google, feel free to remind them that they are awesome!",
        "createdAt": "2024-01-23T21:33:28",
        "reactions": []
      },
      {
        "id": 1907157309,
        "author": "mattleibow",
        "body": "I created a second issue: https://bugs.chromium.org/p/angleproject/issues/detail?id=8496\r\nAnd CR: https://chromium-review.googlesource.com/c/angle/angle/\u002B/5232157\r\n\r\nthat makes the Win10 stuff generally better and will make my patch in vcpkg much smaller and get that merged faster. Many moving parts, but while that curns I will still get all the things ready for SkiaSharp.\r\n\r\nI don\u0027t think I can yet release an ANGLE until some of the things are merged, but I can get all the other things working and maybe someone in the community can build/share the ANGLE things. And once I get all the builds up, I can include it in the package.",
        "createdAt": "2024-01-24T00:44:11",
        "reactions": [
          {
            "user": "taublast",
            "content": "heart",
            "createdAt": "2026-02-06T12:55:14.646179Z"
          },
          {
            "user": "gmurray81",
            "content": "rocket",
            "createdAt": "2026-02-06T12:55:14.6461792Z"
          }
        ]
      },
      {
        "id": 1907158436,
        "author": "mattleibow",
        "body": "This is my PR for getting things in VCPKG: https://github.com/microsoft/vcpkg/pull/36181",
        "createdAt": "2024-01-24T00:45:29",
        "reactions": [
          {
            "user": "gmurray81",
            "content": "rocket",
            "createdAt": "2026-02-06T12:55:14.8382149Z"
          },
          {
            "user": "taublast",
            "content": "heart",
            "createdAt": "2026-02-06T12:55:14.8382151Z"
          }
        ]
      },
      {
        "id": 1907498919,
        "author": "TopperDEL",
        "body": "Awesome @mattleibow! I appreciate your work here and I\u0027m very happy that you started tackling it! Thank you!",
        "createdAt": "2024-01-24T07:13:04",
        "reactions": []
      },
      {
        "id": 1925257606,
        "author": "mattleibow",
        "body": "Finally.",
        "createdAt": "2024-02-03T10:25:40",
        "reactions": [
          {
            "user": "TopperDEL",
            "content": "hooray",
            "createdAt": "2026-02-06T12:55:15.2194205Z"
          },
          {
            "user": "Rippletank",
            "content": "\u002B1",
            "createdAt": "2026-02-06T12:55:15.2194207Z"
          },
          {
            "user": "TopperDEL",
            "content": "rocket",
            "createdAt": "2026-02-06T12:55:15.2194208Z"
          },
          {
            "user": "TopperDEL",
            "content": "heart",
            "createdAt": "2026-02-06T12:55:15.2194209Z"
          },
          {
            "user": "gmurray81",
            "content": "\u002B1",
            "createdAt": "2026-02-06T12:55:15.2194209Z"
          },
          {
            "user": "gmurray81",
            "content": "hooray",
            "createdAt": "2026-02-06T12:55:15.219421Z"
          },
          {
            "user": "gmurray81",
            "content": "heart",
            "createdAt": "2026-02-06T12:55:15.2194211Z"
          },
          {
            "user": "gmurray81",
            "content": "rocket",
            "createdAt": "2026-02-06T12:55:15.2194211Z"
          },
          {
            "user": "MineCake147E",
            "content": "rocket",
            "createdAt": "2026-02-06T12:55:15.2194212Z"
          }
        ]
      },
      {
        "id": 1925271768,
        "author": "TopperDEL",
        "body": "It will be in the next SkiaSharp Release, right? Any ETA on it? ",
        "createdAt": "2024-02-03T10:38:44",
        "reactions": []
      },
      {
        "id": 1925272367,
        "author": "mattleibow",
        "body": "I am trying to get the preview out now. It will be the 3.0 release and then will try backport it to 2.x. But, that will take a bit longer as I have to use older tools. ",
        "createdAt": "2024-02-03T10:41:14",
        "reactions": []
      },
      {
        "id": 1925272908,
        "author": "TopperDEL",
        "body": "Awesome! 3.0 would be fine enough for me, I guess. ",
        "createdAt": "2024-02-03T10:43:49",
        "reactions": []
      },
      {
        "id": 1925309113,
        "author": "taublast",
        "body": "Why not just drop 2.x?",
        "createdAt": "2024-02-03T12:32:22",
        "reactions": []
      },
      {
        "id": 1925321852,
        "author": "mattleibow",
        "body": "\u003E Why not just drop 2.x?\r\n\r\nSoon. Just maintaining it while it is still easy to do. But 2.x is basically on its last legs.",
        "createdAt": "2024-02-03T13:26:39",
        "reactions": []
      },
      {
        "id": 1925324625,
        "author": "gmurray81",
        "body": "Really really awesome @mattleibow ! This is a really great addition!\r\n\r\n\r\n\r\n\r\n\r\nNow it would be nice if we could have WPF acceleration too 😉 \r\n\r\n#2317 ",
        "createdAt": "2024-02-03T13:40:02",
        "reactions": []
      },
      {
        "id": 1925447035,
        "author": "mattleibow",
        "body": "Hehe, anyone know how to use HWND? Might be able to use ANGLE there too. ",
        "createdAt": "2024-02-03T20:24:42",
        "reactions": []
      },
      {
        "id": 2029259687,
        "author": "AmitParmar2005",
        "body": "Hello Everyone,\r\n\r\nHas anyone of you tested new GPU Acceleration with WinUI3 yet? When I add SKSwapChainPanel and try to run the code I get AccessViolationException. \r\n\r\nDetailed description is here: issue #2803 \r\n\r\nI have been trying to make code working for almost 3-4 weeks without any luck.\r\n\r\nThanks,\r\nAmit",
        "createdAt": "2024-04-01T06:46:09",
        "reactions": []
      }
    ]
  }
}