{
  "number": 2104,
  "type": "issue",
  "state": "open",
  "title": "Create a new cross-platform view that supports different GPU backends",
  "body": "**Is your feature request related to a problem? Please describe.**\r\n\r\nRight now, both SkiaSharp.Views.Forms and SkiaSharp.Views.Maui only support using OpenGL in the \u0060SKGLView\u0060 since this was the only backend at the time.\r\n\r\n\r\n**Describe the solution you\u0027d like**\r\n\r\nTime has moved on and we need a GPU view that swaps out the backend controls based on the preferred backend for each platform.\r\n\r\n**Describe alternatives you\u0027ve considered**\r\n\r\nThe only alternative now is to create a new renderer and copy the code from this repo.\r\n\r\n**Additional context**\r\n\r\n\u003C!-- Add any other context or screenshots about the feature request here. --\u003E\r\n",
  "author": {
    "login": "mattleibow",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2022-06-07T17:20:24",
  "updatedAt": "2024-04-05T09:08:52",
  "commentCount": 7,
  "reactionCount": 14,
  "engagement": {
    "syncedAt": "2026-02-06T12:54:59.5121911Z",
    "reactions": [
      {
        "user": "nor0x",
        "content": "heart",
        "createdAt": "2026-02-06T12:54:59.5121967Z"
      },
      {
        "user": "xtuzy",
        "content": "eyes",
        "createdAt": "2026-02-06T12:54:59.5121974Z"
      },
      {
        "user": "serbuk",
        "content": "heart",
        "createdAt": "2026-02-06T12:54:59.5121977Z"
      },
      {
        "user": "CwistSilver",
        "content": "heart",
        "createdAt": "2026-02-06T12:54:59.5121981Z"
      },
      {
        "user": "AnarchyMob",
        "content": "eyes",
        "createdAt": "2026-02-06T12:54:59.5121984Z"
      },
      {
        "user": "VitalyTVA",
        "content": "heart",
        "createdAt": "2026-02-06T12:54:59.5121985Z"
      },
      {
        "user": "VitalyTVA",
        "content": "eyes",
        "createdAt": "2026-02-06T12:54:59.5121988Z"
      },
      {
        "user": "roubachof",
        "content": "heart",
        "createdAt": "2026-02-06T12:54:59.5121989Z"
      },
      {
        "user": "roubachof",
        "content": "eyes",
        "createdAt": "2026-02-06T12:54:59.5121989Z"
      },
      {
        "user": "maiad",
        "content": "heart",
        "createdAt": "2026-02-06T12:54:59.5121991Z"
      },
      {
        "user": "TopperDEL",
        "content": "heart",
        "createdAt": "2026-02-06T12:54:59.5121993Z"
      },
      {
        "user": "gcadmes-extron",
        "content": "eyes",
        "createdAt": "2026-02-06T12:54:59.5121994Z"
      },
      {
        "user": "gcadmes-extron",
        "content": "heart",
        "createdAt": "2026-02-06T12:54:59.5121995Z"
      },
      {
        "user": "yoshiask",
        "content": "heart",
        "createdAt": "2026-02-06T12:54:59.5121995Z"
      }
    ],
    "comments": [
      {
        "id": 1221295506,
        "author": "mgood7123",
        "body": "like switching between GL and Vulkan at runtime?",
        "createdAt": "2022-08-20T11:13:08",
        "reactions": []
      },
      {
        "id": 1959949115,
        "author": "mattleibow",
        "body": "From @taublast in https://github.com/mono/SkiaSharp/pull/2747#issuecomment-1959771472\r\n\r\n\u003E We can let people choose the rendering backend at initialization with .UseSkiaSharp(optional settings) with enum of kind Vulkan, GL, ..., Auto.. so the correct handler will set to be used globally for the SKGLView.\r\nA case when one would want to select backend at run-time I can think of is when one specific backend reveals itself not working on device so dev would want to programmatically select another one?..",
        "createdAt": "2024-02-22T17:43:01",
        "reactions": []
      },
      {
        "id": 1960043524,
        "author": "taublast",
        "body": "In those hypothetical settings, we could also have the fallback backend option: \r\nfor example, we set \u0060.UseSkiaSharp(settings)\u0060, inside settings we indicate that we want Vulkan and the fallback to be GL.\r\nIf we do not specify the fallback we would get a non-accelerated handler if Vulkan is not available. \r\nSo the hard part (maybe not?) is to check the compatibility/availability of a given backend type at startup.",
        "createdAt": "2024-02-22T18:41:58",
        "reactions": []
      },
      {
        "id": 1968625098,
        "author": "mgood7123",
        "body": "for anyone wanting to create a DirectX view\r\n\r\n(\u0060skia/tools\u0060 has many bindings for such including D3D12 - \u0060tools/window/WindowContext.h\u0060, \u0060tools/window/win/WindowContextFactory_win.h\u0060, \u0060std::unique_ptr\u003CWindowContext\u003E MakeD3D12ForWin(HWND, const DisplayParams\u0026)\u0060, the returned window manages the underlying context and provides a \u0060sk_sp\u003CSkSurface\u003E\u0060 via \u0060getBackbufferSurface()\u0060, and includes other functions such as \u0060resize\u0060, rendering must be done manually by whatever creates the \u0060WindowContext\u0060)\r\n\r\nyou may want to look at these for \u0022smooth window resizing\u0022\r\n\r\n- NOTE: currently the \u0060SkGLControl\u0060 (WinForms) does smooth resizing, not sure if MAUI GL control also does same, but given MAUI/WinUI3 (ui-xaml) itself has this problem, it is unlikely since i assume the GL contents itself will also be affected\r\n- - https://github.com/microsoft/microsoft-ui-xaml/issues/2506\r\n- - https://github.com/microsoft/microsoft-ui-xaml/issues/5148\r\n- - (do note that although this displays same behavior, it is reported as a fix for the \u0060TITLE BAR\u0060 only) https://github.com/dotnet/maui/issues/13479#issuecomment-1442431197\r\n- (specifically \u0060win32 would proceed to resize the window before the application had been redrawn leading to visible black bars, and the immediate return would lead to win32 generating resize events at a rate far higher than any renderer could handle\u0060 - https://github.com/rust-windowing/winit/pull/250)\r\n\r\nthe following links can provide more information on the underlying issue of DirectX and the Windows Desktop Manager (WDM) specifically how WM_SIZE messages and directx swap chain \u0060present\u0060 are handled\r\n\r\nhttps://raphlinus.github.io/personal/2018/04/08/smooth-resize.html\r\n- https://github.com/rust-windowing/winit/pull/250\r\n- https://github.com/rust-windowing/winit/issues/786\r\n",
        "createdAt": "2024-02-28T09:58:12",
        "reactions": []
      },
      {
        "id": 1968671351,
        "author": "mgood7123",
        "body": "\u003E In those hypothetical settings, we could also have the fallback backend option: for example, we set \u0060.UseSkiaSharp(settings)\u0060, inside settings we indicate that we want Vulkan and the fallback to be GL. If we do not specify the fallback we would get a non-accelerated handler if Vulkan is not available. So the hard part (maybe not?) is to check the compatibility/availability of a given backend type at startup.\r\n\r\ni would also like to make use of Skia\u0027s multi-backend configuration to provide this ability\r\n\r\n(GrContext itself has multiple graphical backends as we all know, among GL, DX12, VK, METAL, and ANGLE)\r\n\r\nwe could handle runtime-backend switching via some api however such must be done carefully to avoid the user effectively locking themselves out of the current instance by switching to an incompatible/faulty api\r\n\r\n(could also be implemented as a \u0022config\u0022 file somewhere which is loaded upon startup as an alternative to selecting the backend at runtime if such an interaction cannot be implemented or is undesired, tho android may be tricky due to scoped storage, /data unreadable, permissions, and others)\r\n\r\n(may be faulty due to poor driver support or unsupported requirements (eg, i think not all versions of mac support METAL, while newer ones i think removed GL entirely in favor of METAL, or your windows OS might be incapable of running DX12, or you lack Vulkan driver support))\r\n\r\n(may also be faulty due to skia rendering bugs (if any) in a given backend that happen to disappear in another)\r\n\r\nfor example, switching the api might generate an event that we must explicitly (pref interactively) respond to in order to verify the new api is working as expected with their application\r\n\r\nkinda like switching to a new display configuration, the system will revert back if \u0022OK\u0022 is not clicked within 30 seconds (possibly cus the screen went black due to some unsupported configuration or other issue)",
        "createdAt": "2024-02-28T10:22:27",
        "reactions": []
      },
      {
        "id": 2026504616,
        "author": "Kation",
        "body": "@mgood7123 Currently SkiaSharp windows runtime does not compile with define \u0060SK_DIRECT3D\u0060.\r\nCan we add define \u0060SK_DIRECT3D\u0060?",
        "createdAt": "2024-03-29T02:34:24",
        "reactions": []
      },
      {
        "id": 2039285168,
        "author": "mgood7123",
        "body": "depends on if skia itself is compiled with D3D support, try it :D",
        "createdAt": "2024-04-05T09:08:51",
        "reactions": []
      }
    ]
  }
}