{
  "number": 2317,
  "type": "pr",
  "state": "closed",
  "title": "Add SKGLElement to SkiaSharp.Views.WPF",
  "body": "**Description of Change**\r\n\r\nThis adds a GL version of SKElement to SkiaSharp.Views.WPF utilizing OpenTK.GLWPFControl\r\n\r\n**API Changes**\r\n\r\nAdded:\r\n\r\n- \u0060class SKGLElement\u0060\r\n\r\nNew Dependencies for SkiaSharp.Views.WPF: OpenTK, OpenTK.GLWPFControl\r\n\r\n**PR Checklist**\r\n\r\n- [ ] Has tests (if omitted, state reason in description)\r\n- [ ] Rebased on top of main at time of PR\r\n- [ ] Merged related skia PRs\r\n- [ ] Changes adhere to coding standard\r\n- [ ] Updated documentation\r\n\r\n**Fixes**\r\n\r\n - Fixes https://github.com/mono/SkiaSharp/issues/745",
  "author": {
    "login": "gmurray81",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2022-11-18T21:29:59",
  "updatedAt": "2024-03-28T16:00:04",
  "closedAt": "2024-03-28T14:11:23",
  "commentCount": 70,
  "reactionCount": 5,
  "draft": false,
  "merged": true,
  "mergedAt": "2024-03-28T14:11:23",
  "mergeableState": "unknown",
  "baseBranch": "main",
  "headBranch": "add-gl-view-for-wpf",
  "additions": 230,
  "deletions": 0,
  "changedFiles": 2,
  "commits": 19,
  "reviews": [
    {
      "author": "gmurray81",
      "state": "COMMENTED",
      "submittedAt": "2024-02-21T16:29:56"
    },
    {
      "author": "mattleibow",
      "state": "DISMISSED",
      "submittedAt": "2024-02-22T00:00:54"
    },
    {
      "author": "mattleibow",
      "state": "COMMENTED",
      "submittedAt": "2024-02-22T00:30:08"
    },
    {
      "author": "gmurray81",
      "state": "COMMENTED",
      "submittedAt": "2024-02-22T03:44:42"
    },
    {
      "author": "mattleibow",
      "state": "COMMENTED",
      "submittedAt": "2024-02-22T20:56:23"
    },
    {
      "author": "mattleibow",
      "state": "DISMISSED",
      "submittedAt": "2024-03-01T00:40:44"
    },
    {
      "author": "mattleibow",
      "state": "COMMENTED",
      "submittedAt": "2024-03-01T14:16:13"
    },
    {
      "author": "gmurray81",
      "state": "COMMENTED",
      "submittedAt": "2024-03-01T14:34:49"
    },
    {
      "author": "mattleibow",
      "state": "COMMENTED",
      "submittedAt": "2024-03-01T14:39:03"
    },
    {
      "author": "mattleibow",
      "state": "COMMENTED",
      "submittedAt": "2024-03-01T14:44:17"
    },
    {
      "author": "mattleibow",
      "state": "APPROVED",
      "submittedAt": "2024-03-27T21:09:56"
    }
  ],
  "engagement": {
    "syncedAt": "2026-02-06T13:38:40.2120011Z",
    "reactions": [
      {
        "user": "willn1337",
        "content": "eyes",
        "createdAt": "2026-02-06T13:38:40.2120086Z"
      },
      {
        "user": "myd7349",
        "content": "eyes",
        "createdAt": "2026-02-06T13:38:40.2120095Z"
      },
      {
        "user": "MartijnVandecasteele",
        "content": "eyes",
        "createdAt": "2026-02-06T13:38:40.2120097Z"
      },
      {
        "user": "MartijnVandecasteele",
        "content": "rocket",
        "createdAt": "2026-02-06T13:38:40.2120098Z"
      },
      {
        "user": "mgnslndh",
        "content": "rocket",
        "createdAt": "2026-02-06T13:38:40.21201Z"
      }
    ],
    "comments": [
      {
        "id": 1320545568,
        "author": "gmurray81",
        "body": "@mattleibow I\u0027m not really sure how the nuspecs are managed since they all have 1.0.0 for the version? I assume something is injecting the actual required version numbers during the build? The actual dependencies for net462 and netCoreApp3.1 are called out in the csproj.",
        "createdAt": "2022-11-18T21:32:19",
        "reactions": []
      },
      {
        "id": 1320549191,
        "author": "gmurray81",
        "body": "This mirrors as closely as possible what the GL control does for WF with the OpenTK stuff. Main divergences is there didn\u0027t seem to be a way to explicitly pass on the graphics mode, and the resetting of the GRContext on render ",
        "createdAt": "2022-11-18T21:34:36",
        "reactions": []
      },
      {
        "id": 1320553600,
        "author": "gmurray81",
        "body": "One obnoxious thing with GLWPFControl is that they had a bug whereby if you try to use it over RDP it isn\u0027t configured with the software fallback for the 3.x line, but hopefully they will accept my PR: https://github.com/opentk/GLWpfControl/pull/93",
        "createdAt": "2022-11-18T21:36:16",
        "reactions": []
      },
      {
        "id": 1327632937,
        "author": "gmurray81",
        "body": "I updated the OpenTK dependencies to use exact versions based on: https://github.com/mono/SkiaSharp/wiki/Creating-New-Libraries\r\n\r\nEven though this wasn\u0027t what the nuspec for WF seemed to be doing. May need some guidance on what is expected there.",
        "createdAt": "2022-11-25T15:33:51",
        "reactions": []
      },
      {
        "id": 1345506546,
        "author": "ghost",
        "body": "I would really like to see this :) I\u0027m implementing this code personally in the meantime.",
        "createdAt": "2022-12-11T09:47:59",
        "reactions": [
          {
            "user": "willn1337",
            "content": "\u002B1",
            "createdAt": "2026-02-06T13:38:28.8771368Z"
          }
        ]
      },
      {
        "id": 1345964677,
        "author": "ghost",
        "body": "Was testing this out, and it seemed to be considerably slower than using SKGLControl natively in WinForms. I was getting around ~15-16 FPS, and if I got lucky/adjusted some settings, got up to 30 FPS.\r\n\r\nI\u0027m drawing a fairly big bitmap with lots of shapes/lines, and trying to achieve 60/120 FPS. On WinForms could get to 300\u002B no problem.\r\n\r\nI\u0027m trying to port some WinForms projects over to WPF, but may hold off on this.",
        "createdAt": "2022-12-12T06:30:03",
        "reactions": []
      },
      {
        "id": 1352489325,
        "author": "gmurray81",
        "body": "hm.... I wonder if there is a bunch of overhead in clearing the grcontext in some scenarios. None of the scenarios I was trying involved big bitmaps, though.",
        "createdAt": "2022-12-15T02:51:07",
        "reactions": []
      },
      {
        "id": 1352490245,
        "author": "gmurray81",
        "body": "There was another strategy in making sure that there were multiple contexts/created. Maybe that would be better for that scenario.",
        "createdAt": "2022-12-15T02:53:02",
        "reactions": []
      },
      {
        "id": 1352492403,
        "author": "gmurray81",
        "body": "I haven\u0027t don\u0027t much perf testing of this yet for my scenarios. It subjectively seemed ok. Mostly I was just happy that there is no longer bad crosstalk with multiple controls present.",
        "createdAt": "2022-12-15T02:57:06",
        "reactions": []
      },
      {
        "id": 1357844899,
        "author": "ghost",
        "body": "Yeah, functionally this is good (no crosstalk). There\u0027s a bit of latency in the drawing from what I could tell too, when I would measure the time between changing a series of coordinates/images programatically, and when it would update on screen in the next render cycle.\r\n\r\nUsing the FormsHost interop is slightly better (but has the airspace issue), but also severely degraded from native SKGLControl in winforms. Wish there was a way to get high performing GL Backed Skia in WPF easily :(",
        "createdAt": "2022-12-19T15:29:15",
        "reactions": []
      },
      {
        "id": 1358033427,
        "author": "gmurray81",
        "body": "@imerzan \r\nNext question is how much of the overhead is caused by the graphics context reset on paint vs whatever marshaling the OpenTK stuff is doing to get the content into a native WPF surface.  If you can easily do it, try commenting out this logic:\r\n\r\n\u0060\u0060\u0060cs\r\n if (grContext != null)\r\n{\r\n    grContext.ResetContext();\r\n}\r\n\u0060\u0060\u0060\r\n\r\nand see if the FPS is higher. Commenting this out will bring the crosstalk issues back, but maybe you can see if it performs more like the crossbow WF approach. If so, the approach I was originally taking was to try to make sure each control created it\u0027s on graphics context/gl context rather than sharing them. Was advised that it would be better to share the context and just reset it, but maybe that is introducing too much overhead when swapping between surfaces.\r\n\r\nI\u0027m guessing it may be just too much overhead if there might be a bunch of state/resources associated with the context. Again. I didn\u0027t really see any FPS issues in the minimal testing I\u0027ve done. But while I was doing heavy drawing ops, I don\u0027t think I was doing anything that required allocation of heavy resources, so maybe that\u0027s the difference.",
        "createdAt": "2022-12-19T17:59:56",
        "reactions": []
      },
      {
        "id": 1358045884,
        "author": "ghost",
        "body": "I will see about trying that. Sorry when you say crosstalk is this another name for the \u0027airspace\u0027 issues where the GL Control is stuck on top of other controls?\r\n\r\nAnd yes, when I tested this drawing some simple lines/circles (many thousands), it seemed to work fine. But for realtime rendering with bigger resources (Bitmaps,etc.) it stuttered quite a bit. If I programmatically turned/rotated objects in the view, there was significant ghosting.",
        "createdAt": "2022-12-19T18:08:20",
        "reactions": []
      },
      {
        "id": 1358050766,
        "author": "gmurray81",
        "body": "Digging into the docs, it doesn\u0027t really seem like a great idea to call resetContext often. So I\u0027m probably better off with my earlier approach of making sure multiple contexts are created. However, that was a little bit painful with OpenTK, and I\u0027m not positive of all the implications to having multiple GL and skia contexts associated with the same thread. Still, will see if I can rearrange this when I get a chance. Do let me know if dropping resetContext makes the perf more equivalent with WF, though.",
        "createdAt": "2022-12-19T18:11:05",
        "reactions": []
      },
      {
        "id": 1358054934,
        "author": "gmurray81",
        "body": "no, for crosstalk I mean, if you have multiple SK GL controls on the same UI thread without that logic, it will be bad news. It seems like they tread on each other\u0027s GL context state and you just get a lot of graphical corruption.\r\n\r\nThe approach with resetting the GRContext is that it will have skia resend the required state to the GL context on paint so that it doesn\u0027t matter that multiple GRContexts are playing with the same GL context. But it seems like that state sync is too expensive to be practical from what you are seeing.",
        "createdAt": "2022-12-19T18:14:06",
        "reactions": []
      },
      {
        "id": 1358055696,
        "author": "gmurray81",
        "body": "if you are only using one SK GL control, you probably won\u0027t notice any problem, even after commenting that logic out.",
        "createdAt": "2022-12-19T18:14:42",
        "reactions": []
      },
      {
        "id": 1358057656,
        "author": "gmurray81",
        "body": "My guess would be that resetting the context might be requiring that bitmap memory is reallocated on the GPU or something which might account for the more negative performance impact in your scenario.",
        "createdAt": "2022-12-19T18:16:14",
        "reactions": []
      },
      {
        "id": 1358061420,
        "author": "ghost",
        "body": "So I tested the snippet you suggested. It actually doesn\u0027t help at all, and introduces a lot of interference with the WPF Gui (weird anomalies). Must be the crosstalk you mentioned.\r\n\r\nI am using this snippet for my render loop:\r\n\r\n\u0060\u0060\u0060csharp\r\nCompositionTarget.Rendering \u002B= CompositionTarget_Rendering;\r\n\r\n        private void CompositionTarget_Rendering(object sender, EventArgs e)\r\n        {\r\n            _gl?.InvalidateVisual(); ; // draw next frame\r\n        }\r\n\r\n// Draw Func\r\nprivate void GL_PaintSurface(object sender, SKPaintGLSurfaceEventArgs e)\r\n{\r\n            var canvas = e.Surface.Canvas;\r\n            canvas.Clear();\r\n            // Draw bitmaps/lines/etc.\r\n            canvas.Flush();\r\n}\r\n\u0060\u0060\u0060\r\n\r\nIs this not ideal?\r\n\r\nI tried the ContinuouslyRender property in the element and that didn\u0027t seem to help either.",
        "createdAt": "2022-12-19T18:18:55",
        "reactions": []
      },
      {
        "id": 1358067403,
        "author": "gmurray81",
        "body": "Huh... if yanking that logic didn\u0027t help then there could be something else making the WPF scenario slower for you... Wonder if there is something inefficient at the OpenTK level... \r\n\r\n",
        "createdAt": "2022-12-19T18:24:29",
        "reactions": []
      },
      {
        "id": 1358070890,
        "author": "gmurray81",
        "body": "Hmm.... My recollection might not be ideal with some of this stuff. But It\u0027s possible that it\u0027s not great to invalidate visual from compositionTarget.Rendering. IIRC I think that might fire at a capped rate based on your monitors refresh rate, and it might fire AS the layout is being resolved. So its possible it\u0027s too late for the component to update on that layout pass by that point? So its conceivable you are locking the max refresh rate to monitor hz / 2? But I can\u0027t recall the exact timings of when those things fire so this is guesswork. You might want to test out how often you paint with nothing else in the paint callback when using that as a render loop first.",
        "createdAt": "2022-12-19T18:28:08",
        "reactions": []
      },
      {
        "id": 1358074907,
        "author": "ghost",
        "body": "I removed the CompositionTarget event, and modified this property in my startup\r\n\u0060\u0060\u0060csharp\r\n_gl.RenderContinuously = true;\r\n\u0060\u0060\u0060\r\n\r\nStill same frame rate.\r\n\r\nMy canvas code is 1:1 copied from my Winforms app that gets 300\u002B FPS with Vsync Off.\r\n\r\nI really only need about 30 fps (getting 15-20) but need to figure out why there is so much input delay also. On Winforms I usually enable VSync in the app and the render feels pretty fluid at 30.",
        "createdAt": "2022-12-19T18:31:59",
        "reactions": []
      },
      {
        "id": 1358075825,
        "author": "gmurray81",
        "body": "I might be wrong though, since looking at the OpenTK GL control it uses a pretty similar render loop, so I\u0027m guessing the timing is such that you aren\u0027t cutting the refresh rate in half. Still might be worth validating how often your paint fires without the skia stuff going on as a control.",
        "createdAt": "2022-12-19T18:32:58",
        "reactions": []
      },
      {
        "id": 1358087076,
        "author": "ghost",
        "body": "\u003E \r\n\r\nOK that was the issue. The internal render was stuck around 15-25 FPS. I did something similar to what I do in WinForms and now getting 80-110 FPS (still lower than Winforms 300\u002B, but much better)\r\n\r\n\u0060\u0060\u0060csharp\r\n        private async void MainWindow_Loaded(object sender, RoutedEventArgs e)\r\n        {\r\n            while (true)\r\n            {\r\n                await Task.Run(() =\u003E Thread.SpinWait(50000));\r\n                _gl?.InvalidateVisual();\r\n            }\r\n        }\r\n\u0060\u0060\u0060\r\n\r\nHowever, there is a lot of input delay. If I move something, there is a ghosting effect where I moved my mouse, but the GUI takes a split second to catch up.\r\n\r\nIn my WinForms app it responds in realtime, even when capped at 30fps.\r\n\r\nEDIT: I removed all my bitmaps from my draw loop, and there is still input delay/stuttering.",
        "createdAt": "2022-12-19T18:41:58",
        "reactions": []
      },
      {
        "id": 1358235981,
        "author": "gmurray81",
        "body": "It\u0027s possible that you are keeping the main thread busy enough that you are preventing WPF from processing it\u0027s input queues effectively. I feel like I\u0027ve run into this before... It can get you the point where there is actually backlog of queued input to process, and it processes delayed. I think you\u0027ll want to avoid the spinwait. Try simply invalidating every time you are done painting, and see how that goes. If it doesn\u0027t like that you could task delay 0 to make sure the invalidate gets processed after the current layout. To cap the FPS you could keep track of when you had processed the prior frame. When I have a chance I can dig up what I\u0027ve done in similar circumstances in the past. ",
        "createdAt": "2022-12-19T20:09:38",
        "reactions": []
      },
      {
        "id": 1358389389,
        "author": "ghost",
        "body": "Yeah, I tried a few other things, and still get slight input delay that\u0027s not there in WinForms / SKGLControl.\r\n\r\nUsing the spinwait loop, I was actually able to get really solid (300\u002B fps) performance on WPF using the WindowsFormsHost, without any noticeable input lag. But the airspace issues make that nonviable since I need to overlay WPF controls.\r\n\r\nI also use this exact loop mechanism in my WinForms version of the app, and have no issues.\r\n\r\nSomething on SKGLElement is hampering performance.",
        "createdAt": "2022-12-19T21:23:43",
        "reactions": []
      },
      {
        "id": 1360424599,
        "author": "ghost",
        "body": "Looking at SKGLElement closely, it looks pretty similar to SKGLControl.\r\n\r\nI wonder if there are some differences in how OpenTK implements GLWPFControl vs GLControl, going to look into it...",
        "createdAt": "2022-12-20T23:03:09",
        "reactions": []
      },
      {
        "id": 1599026667,
        "author": "pavel-jezek",
        "body": "@gmurray81 @mattleibow Is this pull request stuck \u0022only\u0022 on accepting the CLA, or are there any other problems? As it seems to be working, and it would be very beneficial to have SKGLElement for WPF - one can use it directly from source, but still ...",
        "createdAt": "2023-06-20T15:31:00",
        "reactions": []
      },
      {
        "id": 1600949724,
        "author": "gmurray81",
        "body": "@dotnet-policy-service agree company=\u0022Infragistics\u0022",
        "createdAt": "2023-06-21T14:31:08",
        "reactions": []
      },
      {
        "id": 1601094334,
        "author": "ghost",
        "body": "@gmurray81 I did some further testing on the performance issues I was encountering. I was able to narrow it down to the issue _only_ occurring within RDP. I benchmarked two applications that draw a circle on the mouse cursor location, one using SKGLControl in Forms, and the other using SKGLElement in WPF.\r\n\r\n- When on a physical PC: Both ~~identical\r\n- When on RDP: Forms is same as physical. WPF will \u0022lag\u0022 behind the mouse cursor significantly. FPS will cut in half if I maximize window.\r\n\r\nI know there are documented issues with WPF using Hardware Acceleration for the regular System.Drawing library while in an RDP environment (see https://github.com/dotnet/wpf/issues/3215) , although this is a bit different since it\u0027s using DirectX.\r\n\r\nIs there something similar within this library that may be affecting RDP Performance?\r\n\r\nHere\u0027s my test repo https://github.com/imerzan/WpfSkiaTest (EDIT now public)",
        "createdAt": "2023-06-21T15:51:20",
        "reactions": []
      },
      {
        "id": 1601569247,
        "author": "gmurray81",
        "body": "@imerzan Iirc, under normal conditions there isn\u0027t necessarily an accelerated GPU surface available over RDP. IIRC, you can do things to adjust that, but failing that OpenTK is falling back on a software path, I think. Or at least an off screen buffer it needs to blit from, maybe... Can\u0027t remember the details. Earlier on they would just fail to a black screen, but they will have recently accepted a PR so that they fallback when a GPU surface can\u0027t be acquired.",
        "createdAt": "2023-06-21T19:41:10",
        "reactions": []
      },
      {
        "id": 1601572339,
        "author": "ghost",
        "body": "\u003E @imerzan Iirc, under normal conditions there isn\u0027t necessarily an accelerated GPU surface available over RDP. IIRC, you can do things to adjust that, but failing that OpenTK is falling back on a software path, I think. Or at least an off screen buffer it needs to blit from, maybe... Can\u0027t remember the details. Earlier on they would just fail to a black screen, but they will have recently accepted a PR so that they fallback when a GPU surface can\u0027t be acquired.\r\n\r\nOkay, but doesn\u0027t SKGLControl (Forms) also depend on OpenTK as well? It\u0027s odd that the Forms version seems to do hardware acceleration OK, but the WPF Version has issues. Maybe I am misunderstanding.",
        "createdAt": "2023-06-21T19:44:02",
        "reactions": []
      },
      {
        "id": 1601572736,
        "author": "gmurray81",
        "body": "Anyhow, you may want to investigate making sure the GPU is enabled over RDP.",
        "createdAt": "2023-06-21T19:44:23",
        "reactions": []
      },
      {
        "id": 1601573691,
        "author": "gmurray81",
        "body": "Hmmm... Yeah that aspect of it is odd.... I wonder if there is a larger hit for the software fallback for the WPF version of the control for some reason.",
        "createdAt": "2023-06-21T19:45:17",
        "reactions": []
      },
      {
        "id": 1601575774,
        "author": "ghost",
        "body": "\u003E Hmmm... Yeah that aspect of it is odd.... I wonder if there is a larger hit for the software fallback for the WPF version of the control for some reason.\r\n\r\nIt does seem that the WPF Version _is_ utilizing the GPU over RDP (it actually has a much bigger hit on it too)\r\n![image](https://github.com/mono/SkiaSharp/assets/42287509/f1cf67bd-240f-463f-be58-babd8e9252c2)\r\n\r\nIt\u0027s really odd that the WPF Version will crap out when I maximize the window in RDP. It goes from ~30 fps (native refresh rate) down to ~16 fps on 1080p res, and the ghosting gets noticeably worse.",
        "createdAt": "2023-06-21T19:47:10",
        "reactions": []
      },
      {
        "id": 1601583789,
        "author": "gmurray81",
        "body": "Does that machine have a dedicated GPU or only integrated graphics? Wouldn\u0027t gpu0 be the integrated cpu graphics?",
        "createdAt": "2023-06-21T19:54:20",
        "reactions": []
      },
      {
        "id": 1601586829,
        "author": "ghost",
        "body": "\u003E Does that machine have a dedicated GPU or only integrated graphics? Wouldn\u0027t gpu0 be the integrated cpu graphics?\r\n\r\nYeah it\u0027s integrated graphics. it\u0027s an Intel core i7-7700, so it\u0027s fairly powerful.\r\n\r\nOn the Forms Version if I disable VSync I can get upwards of 500-1000 FPS.\r\n\r\nI already have an application that runs flawlessly in RDP using SKGLControl (WinForms), but I\u0027d like to migrate it to something more modern like WPF.",
        "createdAt": "2023-06-21T19:57:02",
        "reactions": []
      },
      {
        "id": 1601624122,
        "author": "gmurray81",
        "body": "K, was just wondering if Winforms was ending up using dedicated vs WPF integrated, but doesn\u0027t sound like it.",
        "createdAt": "2023-06-21T20:27:11",
        "reactions": []
      },
      {
        "id": 1675747995,
        "author": "lindexi",
        "body": "@imerzan  Enabling Hardware Acceleration on RDP is merged, see https://github.com/dotnet/wpf/pull/7684",
        "createdAt": "2023-08-12T06:55:41",
        "reactions": []
      },
      {
        "id": 1675941703,
        "author": "ghost",
        "body": "Great! Will check it out and test.\r\n\r\nOn Sat, Aug 12, 2023 at 1:55 AM lindexi ***@***.***\u003E wrote:\r\n\r\n\u003E @imerzan \u003Chttps://github.com/imerzan\u003E Enabling Hardware Acceleration on\r\n\u003E RDP is merged, see dotnet/wpf#7684\r\n\u003E \u003Chttps://github.com/dotnet/wpf/pull/7684\u003E\r\n\u003E\r\n\u003E —\r\n\u003E Reply to this email directly, view it on GitHub\r\n\u003E \u003Chttps://github.com/mono/SkiaSharp/pull/2317#issuecomment-1675747995\u003E, or\r\n\u003E unsubscribe\r\n\u003E \u003Chttps://github.com/notifications/unsubscribe-auth/AKCUDFIE5L2BL7WHQBODB6LXU4SHTANCNFSM6AAAAAASE4WG6A\u003E\r\n\u003E .\r\n\u003E You are receiving this because you were mentioned.Message ID:\r\n\u003E ***@***.***\u003E\r\n\u003E\r\n-- \r\nSent from my iPhone\r\n",
        "createdAt": "2023-08-12T14:33:08",
        "reactions": []
      },
      {
        "id": 1762183645,
        "author": "gmurray81",
        "body": "@mattleibow I was going to resolve that merge conflict, but I guess you rearranged the nuspecs and maybe are fully autogenerating them? Are there any details on what is required to add a dependency? I suspect it could be complex unless the WF dependency on OpenTK is also bumped to match, since I needed a bit newer of a version.",
        "createdAt": "2023-10-13T20:44:48",
        "reactions": []
      },
      {
        "id": 1762190455,
        "author": "gmurray81",
        "body": "Also, are you amenable to accepting this any time soon? It\u0027s probably not perfect, but I assume this is better than having no gpu acceleration options for WPF.",
        "createdAt": "2023-10-13T20:46:10",
        "reactions": []
      },
      {
        "id": 1936443623,
        "author": "mattleibow",
        "body": "Hello folks! Thanks for this PR and sorry for not being active here. I was working on MAUI and had no real time to do much.\r\n\r\nThis PR is looking good, but is it possible to rebase? The new main is 3.x series and no longer uses the nuspecs and things. Hopefully this will be a much smaller set of changes as well.",
        "createdAt": "2024-02-09T18:54:03",
        "reactions": [
          {
            "user": "lindexi",
            "content": "\u002B1",
            "createdAt": "2026-02-06T13:38:37.9103075Z"
          },
          {
            "user": "myd7349",
            "content": "\u002B1",
            "createdAt": "2026-02-06T13:38:37.9103079Z"
          }
        ]
      },
      {
        "id": 1936461634,
        "author": "mattleibow",
        "body": "I am also mirroring all the nugets so we can also use the latest packages.",
        "createdAt": "2024-02-09T19:08:44",
        "reactions": []
      },
      {
        "id": 1951348635,
        "author": "gmurray81",
        "body": "I\u0027ll try to rebase this sometime this week if I remember. Is it a problem that there is a new dependency? Since I don\u0027 think you had the WPF OpenTK GLWPFControl in the deps before.",
        "createdAt": "2024-02-18T14:51:31",
        "reactions": [
          {
            "user": "lindexi",
            "content": "\u002B1",
            "createdAt": "2026-02-06T13:38:38.4075812Z"
          },
          {
            "user": "myd7349",
            "content": "\u002B1",
            "createdAt": "2026-02-06T13:38:38.4075817Z"
          },
          {
            "user": "MartijnVandecasteele",
            "content": "\u002B1",
            "createdAt": "2026-02-06T13:38:38.4075818Z"
          }
        ]
      },
      {
        "id": 1956826881,
        "author": "mattleibow",
        "body": "/azp run",
        "createdAt": "2024-02-21T14:52:53",
        "reactions": []
      },
      {
        "id": 1956827156,
        "author": "azure-pipelines[bot]",
        "body": "\u003Csamp\u003E\nAzure Pipelines could not run because the pipeline triggers exclude this branch/path.\u003Cbr\u003E\r\n\n\u003C/samp\u003E",
        "createdAt": "2024-02-21T14:53:00",
        "reactions": []
      },
      {
        "id": 1956828363,
        "author": "mattleibow",
        "body": "I think the issue was the new version of the packages were not mirrored on our nuget mirror - so updating would have had issues. But, they should be there now so no big issue. I just press a button.",
        "createdAt": "2024-02-21T14:53:34",
        "reactions": []
      },
      {
        "id": 1957204525,
        "author": "gmurray81",
        "body": "@mattleibow seems like I need to update the conditional for the package versions, and there is an API change I need to adapt to in main it seems. Is it going to be a problem that net462 and !net462 are using different OpenTK versions? I can no longer remember why I needed to do this... maybe they dropped net462 support in later versions or something...",
        "createdAt": "2024-02-21T16:28:56",
        "reactions": []
      },
      {
        "id": 1957230041,
        "author": "gmurray81",
        "body": "I had to remove an obselete member that had been removed from the equivalent WF control, and I updated the conditional. We\u0027ll see how that does.",
        "createdAt": "2024-02-21T16:36:24",
        "reactions": []
      },
      {
        "id": 1957320184,
        "author": "gmurray81",
        "body": "unfortunately I\u0027m getting some access violations trying to run the scenario I was using for testing. So it seems there may be something to fix here. Not sure what would have changed.",
        "createdAt": "2024-02-21T17:03:27",
        "reactions": []
      },
      {
        "id": 1957576927,
        "author": "gmurray81",
        "body": "it looks like there is some dynamic aspects to how opentk loads the gl bindings. Maybe running with later dotnet versions is allowing for some trimming that is getting in the way or something. It seems like the root cause is that the entry points aren\u0027t loaded as far as I can tell...",
        "createdAt": "2024-02-21T18:10:12",
        "reactions": []
      }
    ]
  }
}