{
  "number": 2330,
  "type": "issue",
  "state": "open",
  "title": "Interaction with shapes",
  "body": "I\u0027m trying to determine which shapes are located by coordinates (mouse click).\r\n\r\nI realized that skia does not provide such an API and I need to implement it myself, but I have no ideas on this.\r\n\r\nEverything is complicated by the fact that I need to understand exactly that the click occurred on the figure, and not its square hitbox, for example, I can click inside the text with the number \u00220\u0022 and this should not be considered a hit, there are also rectangles with rounded edges, complex curves, different shapes, and there are thousands of them on the canvas\r\n\r\nI will be grateful for any advice because right now I don\u0027t even know how to Google for a solution to my problem",
  "author": {
    "login": "VeyDlin",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2022-12-05T14:25:29",
  "updatedAt": "2024-08-16T17:32:48",
  "commentCount": 6,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T12:52:04.9966195Z",
    "reactions": [],
    "comments": [
      {
        "id": 1339036508,
        "author": "themcoo",
        "body": "Skia is a rendering library, what you are asking for is completely out of scope. ",
        "createdAt": "2022-12-06T09:36:47",
        "reactions": []
      },
      {
        "id": 1339177082,
        "author": "VeyDlin",
        "body": "\u003E Skia is a rendering library, what you are asking for is completely out of scope.\r\n\r\nYes, I understand that, I just wanted to find out what ways there are in general, \r\n\r\nI could create a mathematical model of each figure I draw and count its collision, \r\n\r\nor I could add its own canvas to each drawn figure and draw it there again and get a pixel at the right coordinates (if there is such a function in skia at all), then I will get thousands of canvases, or tens of thousands, and maybe it won\u0027t even work too slowly,\r\n\r\nI could also create a polygon around pixels, for this I also need to somehow get a drawn shape separately from the general canvas, is this possible in skia?\r\n\r\nBut it still seems to me that there should be an easier way, if skia returned at least some information about the shape that it just rendered, it would be easier, I think",
        "createdAt": "2022-12-06T11:24:16",
        "reactions": []
      },
      {
        "id": 1340164355,
        "author": "willn1337",
        "body": "you could draw the shapes to a new surface (not rendered to the screen), pass a unique color for each shape, then call \u0060hittestsurface.ReadPixels(..., mousePos)\u0060 and check if the pixel color is a match?",
        "createdAt": "2022-12-06T23:43:28",
        "reactions": []
      },
      {
        "id": 2259039678,
        "author": "3xau1o",
        "body": "this is just speculation at the moment but representing the UI as a DOM-like tree of System.Drawing.Drawing2D or equivalent for .Net Core objects then mapping the DOM-like tree to skia drawing methods should be one approach\r\n\r\nThen on pointer events use\r\n\r\n[Rectangle.Contains](https://learn.microsoft.com/en-us/dotnet/api/system.drawing.rectangle.contains?view=net-8.0)\r\n[GraphicsPath.IsVisible](https://learn.microsoft.com/en-us/dotnet/api/system.drawing.drawing2d.graphicspath.isvisible?view=net-8.0\u0026redirectedfrom=MSDN#overloads)\r\n\r\nFor prioritizing elements of top of others, the DOM-like tree need z-index\r\n\r\n@VeyDlin issue should be closed and instead a discussion thread in discussions as it\u0027s outside skia codebase",
        "createdAt": "2024-07-30T19:16:52",
        "reactions": []
      },
      {
        "id": 2259059636,
        "author": "wieslawsoltes",
        "body": "You can try https://github.com/wieslawsoltes/Draw2D",
        "createdAt": "2024-07-30T19:29:27",
        "reactions": []
      },
      {
        "id": 2293894153,
        "author": "Aniganesh",
        "body": "Hi @wieslawsoltes! I opened your library and it seems the github pages deployment has failed.",
        "createdAt": "2024-08-16T17:32:47",
        "reactions": []
      }
    ]
  }
}