{
  "number": 2341,
  "type": "issue",
  "state": "open",
  "title": "[BUG] [WinUI] Scale delay is observed during window resize",
  "body": "**Description**\r\nWhen the window of WinUI application (that has SKCanvasView inside it) is constantly resized the scale of the canvas drawing does not look accurate for some of the frames. That leaves the feeling that the canvas is somehow flickering. The issue can be reproduced with every drawing in the canvas, but it is easily reproduced when you have multiple text drawings on the screen.\r\n\r\nAfter a brief research I\u0027ve found that the issues was caused by [this ](https://github.com/mono/SkiaSharp/pull/1804) PR. And more specifically by the following code change:\r\n![Screenshot 2022-12-15 114944](https://user-images.githubusercontent.com/9336157/207827868-e5677bf7-2e10-4ce0-80d4-a3a2caf4b5be.png)\r\n\r\nI can suggest two possible solutions for this issue:\r\n1. You can bring back the Scale Transform and set the Stretch to None.\r\n2. Or you can invoke DoInvalidate instead of Invalidate from OnSizeChanged. Invalidate invokes DoInvalidate, but from within a dispatcher which causes the inaccurate rendering of the frames. SizeChanged should be invoked from within the UI thread, so it is safe to invoke DoInvalidate instead of Invalidate. \r\n\r\n\u003C!-- a general description goes here --\u003E\r\n\r\n**Code**\r\n\r\n\u003C!-- a snippet of code that demonstrates the issue --\u003E\r\n\u0060\u0060\u0060csharp\r\nusing SkiaSharp;\r\nusing SkiaSharp.Views.Maui;\r\nusing SkiaSharp.Views.Maui.Controls;\r\n\r\nnamespace SkiaScaleWinUI;\r\n\r\npublic partial class App : Application\r\n{\r\n    public App()\r\n    {\r\n        InitializeComponent();\r\n\r\n        MainPage = new TextPage();\r\n    }\r\n\r\n    public class TextPage : ContentPage\r\n    {\r\n        public TextPage()\r\n        {\r\n            Title = \u0022Framed Text\u0022;\r\n\r\n            SKCanvasView canvasView = new SKCanvasView();\r\n            canvasView.PaintSurface \u002B= OnCanvasViewPaintSurface;\r\n            Content = canvasView;\r\n        }\r\n\r\n        void OnCanvasViewPaintSurface(object sender, SKPaintSurfaceEventArgs args)\r\n        {\r\n            SKSurface surface = args.Surface;\r\n            SKCanvas canvas = surface.Canvas;\r\n\r\n            canvas.Clear();\r\n\r\n            string str = \u0022Hello SkiaSharp!\u0022;\r\n            SKPaint textPaint = new SKPaint { Color = SKColors.Chocolate, TextSize = 24 };\r\n\r\n            canvas.DrawText(str, 0, args.Info.Height / 2, textPaint);\r\n        }\r\n    }\r\n}\r\n\r\n\u0060\u0060\u0060\r\n\r\n**Expected Behavior**\r\n\r\n\u003C!-- a general description of what was the expected behavior or result --\u003E\r\nDuring windows resize the text should not be scaled - at the size and the DPI should be taken into account, but the visual representation should not be affected by this.\r\n\r\n**Actual Behavior**\r\n\r\n\u003C!-- a general description of what really happened --\u003E\r\nThe text does not look good for some of the frames during window resize.\r\n\r\n**Basic Information**\r\n\r\n- Version with issue:  2.88.3\r\n- Last known good version:  unknown\r\n- IDE:  Visual Studio\r\n- Platform Target Frameworks: \r\n  - WinUI\r\n\r\n**Screenshots**\r\n\r\n\u003C!-- if the issue is a visual issue, please include screenshots showing the problem if possible --\u003E\r\n![67](https://user-images.githubusercontent.com/9336157/207826602-e55f5776-b5b6-4e0b-b418-1654641fc47a.png)\r\n![68](https://user-images.githubusercontent.com/9336157/207826607-8bd2003a-2103-4c1e-ab24-92fbeee57d8a.png)\r\n\r\n**Reproduction Link**\r\n\r\n\u003C!-- please upload or provide a link to a reproduction case --\u003E\r\n[SkiaScaleWinUI.zip](https://github.com/mono/SkiaSharp/files/10235785/SkiaScaleWinUI.zip)\r\n\r\n",
  "author": {
    "login": "APopatanasov",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2022-12-15T10:02:23",
  "updatedAt": "2025-02-20T07:56:02",
  "commentCount": 11,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T13:30:00.8562406Z",
    "reactions": [],
    "comments": [
      {
        "id": 1357171985,
        "author": "FrozDark",
        "body": "Is it the same https://github.com/mono/SkiaSharp/issues/2295 ?",
        "createdAt": "2022-12-19T06:46:56",
        "reactions": []
      },
      {
        "id": 1357251169,
        "author": "APopatanasov",
        "body": "It looks like to be the same.",
        "createdAt": "2022-12-19T08:12:50",
        "reactions": []
      },
      {
        "id": 1367668506,
        "author": "bmitc",
        "body": "Is it possible that this bug is related to what I describe here in the GLFW forum?\r\n\r\nhttps://discourse.glfw.org/t/canvas-jitter-flicker-when-resizing-with-multithreaded-render-loop/2188/11\r\n\r\nI had assumed that the issue I describe there lies within GLFW or somewhere in that stack, although I suppose this could be due to an underlying issue with SkiaSharp.",
        "createdAt": "2022-12-30T01:01:23",
        "reactions": []
      },
      {
        "id": 1374504381,
        "author": "bmitc",
        "body": "Specifically, here\u0027s the GIF uploaded to the GLFW support thread.\r\n\r\n![window-resize-issue](https://user-images.githubusercontent.com/65685447/211156418-993bccdb-c7bd-44c7-90da-32db9aeb12cc.gif)\r\n\r\nI don\u0027t have the ability to test this on macOS, as I don\u0027t have an Apple machine, and there is another \u0060SkiaSharp\u0060 bug (https://github.com/mono/SkiaSharp/issues/2350) that is preventing me from drawing to an OpenGL context on Linux, so I can\u0027t test there either.\r\n\r\nHowever, I have found out that, at least from what I currently can tell, this issue doesn\u0027t occur on every Windows machine. It occurs on two Windows 11 machines that have NVIDIA graphics cards, but from what I can see in my initial testing, I don\u0027t see it occur on a Windows 11 machine with only Intel Iris Xe. Of course, the issue is intermittent, so it can be shifty to determine if it\u0027s gone. Although it does normally show up somewhat readily.",
        "createdAt": "2023-01-07T14:48:46",
        "reactions": []
      },
      {
        "id": 1694963601,
        "author": "bmitc",
        "body": "@APopatanasov @FrozDark Did either of you ever make any progress on working around this issue? It seems that what you describe is related to what I also encountered in the above video and linked GLFW discussion forum post, where resizing a window causes SkiaSharp to \u0022jitter\u0022 even though I redraw as expected on every resize.\r\n\r\nI was going to test @APopatanasov\u0027s suggested solutions, but I am unable to get SkiaSharp to build by following the instructions, so I\u0027m not sure how to help.",
        "createdAt": "2023-08-28T03:52:45",
        "reactions": []
      },
      {
        "id": 1859303325,
        "author": "trusktr",
        "body": "Does any OS let you synchronously couple window resize to window content drawing? I would think not. Because if that were the case, then any time rendering inside content is delayed, the OS-level window resize experience would become choppy. I highly assume OS devs make this impossible to achieve, without hacks (but I have not verified).\r\n\r\nAn app limiting OS window animation would be an avenue for DoS attacks.\r\n\r\nWhat I\u0027ve noticed in macOS is that no matter what the program inside a window is doing, window resize always works on its own with a separate framerate, decoupled from the rendering of the content inside the window. Not 100% sure about Windows except that I know this is true with all web browsers (maybe it was not true with IE at some point, IE was very easy to crash/exploit).\r\n\r\nIn the above example, I imagine that the rendering is slower than the framerate of the OS window resize, and that solving that is either impossible, or a hack that should not exist.",
        "createdAt": "2023-12-17T22:23:01",
        "reactions": []
      },
      {
        "id": 1863937978,
        "author": "bmitc",
        "body": "Yes, you can synchronously block the resize with GLFW. That\u0027s what I used to debug this in the link I posted. I don\u0027t know if that blocks all other windows. I mean, once an app is running, it has a lot of ways to mess with the computer, so I don\u0027t get the DoS relevance.\n\nThe issue I described doesn\u0027t occur with GLFW and straight GL calls doing the drawing. It seems to be a SkiaSharp specific issue.\n\nYou reference macOS but what platform is that using? It\u0027s likely that it is a completely different stack (Cocoa window management with drawing done by Metal), so don\u0027t see the relevance. You can have smooth rendering occur during window resizes on Windows. It is just with OpenGL, you need to recreate the surface everytime the window is resized no matter what platform. There\u0027s no way around that. This SkiaSharp bug is preventing doing that reliably when using SkiaSharp as the drawing technology.",
        "createdAt": "2023-12-20T06:46:24",
        "reactions": []
      },
      {
        "id": 2057709307,
        "author": "bmitc",
        "body": "@APopatanasov @FrozDark Did either of you ever figure this out? Or find a workaround?",
        "createdAt": "2024-04-15T20:04:07",
        "reactions": []
      },
      {
        "id": 2058186847,
        "author": "FrozDark",
        "body": "\u003E @APopatanasov @FrozDark Did either of you ever figure this out? Or find a workaround?\r\n\r\nNo. It\u0027s not necessary for me now.",
        "createdAt": "2024-04-16T04:02:47",
        "reactions": []
      },
      {
        "id": 2072436830,
        "author": "Mangepange",
        "body": "It would be neat if SKXamlCanvas.OnSizeChanged was virtual, just like SKXamlCanvas.OnPaintSurface. In that case it could be overridden and the suggested solution number 2 could be implemented externally :)",
        "createdAt": "2024-04-23T14:16:58",
        "reactions": []
      },
      {
        "id": 2670722413,
        "author": "Mangepange",
        "body": "This works perfectly for me now. I think it was #2922 that solved it.",
        "createdAt": "2025-02-20T07:56:00",
        "reactions": []
      }
    ]
  }
}