{
  "number": 267,
  "type": "issue",
  "state": "closed",
  "title": "Forms SKCanvasView and Margins..",
  "body": "Not sure if it is me or the SK Views.\r\nI set a Margin on the View to get some whitespace but it was completely ignored.\r\n\r\nNext I wrapped it in a StackLayout (nasty I know) with a Margin on the StackLayout and the Canvas didn\u0027t render until I added VerticalOptions and Horizontal Options of \u0022FillAndExpand\u0022.\r\nStill it ignored the Margin.\r\n\r\nChanged the Margin on the StackLayout to a Padding - BOOM - worked.\r\n\r\n            \r\n\u0060\u0060\u0060\r\n\u003CStackLayout Padding=\u00225\u0022 BackgroundColor=\u0022Orange\u0022\u003E\r\n       \u003Cskia:SKCanvasView  VerticalOptions=\u0022FillAndExpand\u0022 HorizontalOptions=\u0022FillAndExpand\u0022\u003E\r\n             \u003Cskia:SKGLView.GestureRecognizers\u003E\r\n                    \u003CTapGestureRecognizer Command=\u0022{Binding TappedCommand}\u0022/\u003E\r\n            \u003C/skia:SKGLView.GestureRecognizers\u003E\r\n      \u003C/skia:SKCanvasView\u003E\r\n\u003C/StackLayout\u003E\r\n\r\n\u0060\u0060\u0060\r\n\r\nI\u0027ll try to find time to knock up a repo project.  In the meantime, any ideas?\r\n\r\n",
  "author": {
    "login": "djcparker",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2017-03-20T18:10:10",
  "updatedAt": "2022-08-19T21:02:17",
  "closedAt": "2017-03-30T21:49:30",
  "commentCount": 6,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T13:56:57.187357Z",
    "reactions": [],
    "comments": [
      {
        "id": 288172324,
        "author": "mattleibow",
        "body": "If you can get a repo, then I can have a look. Also, what platform are you on?\r\n\r\nI tested with the canvas as the root view, a child of a grid and stack layout. All adhere to the margin property.\r\n\r\nFor the case with no width/height or vertical/horizontal options, the canvas has no intrinsic size, since it is merely a drawing surface. In order to make sure it will be displayed, either a dimension must be specified, or a sizing option. For example, if you place it in a vertical stack layout, the width will stretch to the container width, and the height will fall back to 0. In this case, either use a grid to expand, or set an explicit height.",
        "createdAt": "2017-03-21T18:19:50",
        "reactions": []
      },
      {
        "id": 288173662,
        "author": "djcparker",
        "body": "Hi Matt, sorry, would help if I gave some more details 😊\r\n\r\nThis was on ios, iphone 5s. \r\nIt was as the child of a grid, first row, single column.\r\n\r\nYeah, I looked at the code to see how it worked when I plugged it in.  It works awesome by the way!\r\n\r\nI\u0027ll pull the code out and see if I can make it repo what I saw.\r\n\r\nThanks. ",
        "createdAt": "2017-03-21T18:24:14",
        "reactions": [
          {
            "user": "mattleibow",
            "content": "\u002B1",
            "createdAt": "2026-02-06T13:56:56.2785576Z"
          }
        ]
      },
      {
        "id": 288725560,
        "author": "mattleibow",
        "body": "Did you managed to get a test case, I wasn\u0027t able to repro with a grid either.",
        "createdAt": "2017-03-23T13:52:31",
        "reactions": []
      },
      {
        "id": 288726494,
        "author": "djcparker",
        "body": "Working on it...  I can repo it in the app every time... Have a half finished stripped down copy of the main view.  Been caught in meetings and release planning the last couple of days, will get to it this week for sure.\r\n",
        "createdAt": "2017-03-23T13:56:04",
        "reactions": [
          {
            "user": "mattleibow",
            "content": "\u002B1",
            "createdAt": "2026-02-06T13:56:56.7113161Z"
          }
        ]
      },
      {
        "id": 290555225,
        "author": "djcparker",
        "body": "@mattleibow there is something odd going on.  Something about padding and margin.  I\u0027m not 100% convinced it is the SkiaView.  Totally get what you are saying about the canvas, makes perfect sense, it is definitely not that. \r\n\r\nI\u0027m flat out with work so I\u0027ll close this for the moment while I spend some time convincing myself one way or the other :)\r\n\r\nthanks for the help!\r\n",
        "createdAt": "2017-03-30T21:49:29",
        "reactions": []
      },
      {
        "id": 291607948,
        "author": "mattleibow",
        "body": "No prob.\r\n\r\nI\u0027ll keep an eye out for any issues similar to this, just in case. But, as soon as you have a repro let me know.",
        "createdAt": "2017-04-04T19:33:20",
        "reactions": []
      }
    ]
  }
}