{
  "number": 2775,
  "type": "pr",
  "state": "closed",
  "title": "Clean up SKTextBlobBuilder and SKRunBuffer APIs",
  "body": "**Description of Change**\r\n\r\nThis is sort of inspired by #2664 but also the \u0060SKRunBuffer\u0060 API is a bit weird. In 2.x the skia comments say the text part is not meant to be sued, but it is actually required in some cases.\r\n\r\nI had cleaned up the API a bit before, but I see I still needed some work. \r\n\r\nThen #2664 was asking for less allocations, so I am thinking instead of spans, we just return the struct directly (almost) and then it is up to the caller to do the right thing. \r\n\r\n- Fixes https://github.com/mono/SkiaSharp/issues/2776",
  "author": {
    "login": "mattleibow",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2024-03-02T00:06:14",
  "updatedAt": "2024-03-28T22:34:24",
  "closedAt": "2024-03-28T22:34:20",
  "commentCount": 6,
  "reactionCount": 0,
  "draft": false,
  "merged": true,
  "mergedAt": "2024-03-28T22:34:20",
  "mergeableState": "unknown",
  "baseBranch": "main",
  "headBranch": "dev/textblobbuilder",
  "additions": 252,
  "deletions": 131,
  "changedFiles": 4,
  "commits": 4,
  "reviews": [
    {
      "author": "mattleibow",
      "state": "COMMENTED",
      "submittedAt": "2024-03-02T00:26:29"
    },
    {
      "author": "mattleibow",
      "state": "COMMENTED",
      "submittedAt": "2024-03-02T00:56:32"
    },
    {
      "author": "Youssef1313",
      "state": "APPROVED",
      "submittedAt": "2024-03-02T07:51:50"
    }
  ],
  "engagement": {
    "syncedAt": "2026-02-06T12:55:22.1423108Z",
    "reactions": [],
    "comments": [
      {
        "id": 1974786912,
        "author": "Gillibald",
        "body": "I am fine with breaking changes in this area as long as it improves things. This is a hot path for Avalonia. Less allocation/copies is always better. Being able to work with the buffer directly is preferred.",
        "createdAt": "2024-03-02T12:41:19",
        "reactions": []
      },
      {
        "id": 1979626762,
        "author": "Gillibald",
        "body": "This is our current usage: https://github.com/AvaloniaUI/Avalonia/blob/master/src/Skia/Avalonia.Skia/GlyphRunImpl.cs#L117\r\n\r\nWe share glyph indices and glyph positions for different edging modes. Ideally we could replace the buffer spans with our data. Sadly run allocation is tied to a specific SkFont.",
        "createdAt": "2024-03-05T20:59:48",
        "reactions": []
      },
      {
        "id": 1987216768,
        "author": "mattleibow",
        "body": "Thinking next to the box here... Google has decided that the api needs a font. SkiaSharp just copied and unfortunately we have a bit of overhead...\n\nHowever, typically what do you need from a font? If it is things like typeface and text size, maybe we can create an overload for this. Might be a basic/internal struct that I pass into the pinvoke.\n\nMaybe I can revalidate that the font needs to go through all the registration logic. It may not.\n\nHowever, what is the main issue? The allocations of an object just to pass it to the allocation of a run? If that was gone, would it be better?\n\nI control the api for the most part and typically just add bindings as people ask. Once there are numbers with perf, we can add overloads or improve. This is v3 after all, 😅",
        "createdAt": "2024-03-10T12:46:07",
        "reactions": []
      },
      {
        "id": 1987272125,
        "author": "Gillibald",
        "body": "This is mainly a limitation of Skia\u0027s API. Theoretically the SKFont is only neded when the SKTextBlob is build.\r\n\r\nAvalonia supports different edging modes for text and edging is backed into the SKTextBlob when it is created you can\u0027t draw one blob with different edging.\r\n\r\nIn real world applications you always shape text into runs of glyphs and this data needs to be stored somewhere. We can\u0027t use a SKRunBuffer because of above mentioned reasons.\r\n\r\nSo all we can do is exposing easy excess to positions and glyphs spans. So a copy is as fast as possible.\r\n\r\nAvoiding a copy is not possible. At least not for Avalonia.",
        "createdAt": "2024-03-10T15:39:26",
        "reactions": []
      },
      {
        "id": 2025469667,
        "author": "mattleibow",
        "body": "I am getting close to merging a few PRs, is this new API going to meet your expectations? Is the shape good and are you able to confirm there are no/minimal allocations?",
        "createdAt": "2024-03-28T15:14:21",
        "reactions": []
      },
      {
        "id": 2025546230,
        "author": "Gillibald",
        "body": "Y API looks good 👍",
        "createdAt": "2024-03-28T15:49:40",
        "reactions": [
          {
            "user": "mattleibow",
            "content": "heart",
            "createdAt": "2026-02-06T12:55:22.0920648Z"
          }
        ]
      }
    ]
  }
}