{
  "number": 2817,
  "type": "issue",
  "state": "closed",
  "title": "[FEATURE] Support Direct3D",
  "body": "### Is your feature request related to a problem?\n\n1. Some GPU or its driver doesn\u0027t support Vulkan.\r\nFor example, Intel Xe Graphics currently driver will return null ptr when get procedure address for some name.\r\nThen \u0060GRContext.CreateVulkan\u0060 will return null.\r\n2. Some environment only support OpenGL 1.1.\r\nFor example, Virtual Machine without GPU. Or remote control without RDP with Intel Xe Graphics.\r\nThen \u0060GRContext.CreateGl\u0060 will return null.\r\n\r\nWithout Vulkan and OpenGL, we can only use CPU to render images.\n\n### Describe the solution you would like\n\nAdd D3D support with Windows os.\n\n### Describe alternatives you have considered\n\nAdd define \u0060SK_Direct3D\u0060 when compile native skia so that I can use it with pinvoke and reflection.\n\n### Additional context\n\n_No response_\n\n### Code of Conduct\n\n- [X] I agree to follow this project\u0027s Code of Conduct",
  "author": {
    "login": "Kation",
    "type": "User"
  },
  "labels": [
    {
      "name": "type/feature-request",
      "color": "ededed"
    }
  ],
  "assignees": [],
  "createdAt": "2024-04-01T03:34:42",
  "updatedAt": "2025-03-14T16:14:21",
  "closedAt": "2025-03-13T14:32:00",
  "commentCount": 15,
  "reactionCount": 10,
  "engagement": {
    "syncedAt": "2026-02-06T13:28:50.5141374Z",
    "reactions": [
      {
        "user": "cnbluefire",
        "content": "\u002B1",
        "createdAt": "2026-02-06T13:28:50.5141426Z"
      },
      {
        "user": "setli",
        "content": "\u002B1",
        "createdAt": "2026-02-06T13:28:50.514143Z"
      },
      {
        "user": "rmbadmin",
        "content": "\u002B1",
        "createdAt": "2026-02-06T13:28:50.5141433Z"
      },
      {
        "user": "Poker-sang",
        "content": "\u002B1",
        "createdAt": "2026-02-06T13:28:50.5141436Z"
      },
      {
        "user": "lindexi",
        "content": "\u002B1",
        "createdAt": "2026-02-06T13:28:50.5141437Z"
      },
      {
        "user": "996666925",
        "content": "\u002B1",
        "createdAt": "2026-02-06T13:28:50.5141438Z"
      },
      {
        "user": "eeee0717",
        "content": "\u002B1",
        "createdAt": "2026-02-06T13:28:50.5141439Z"
      },
      {
        "user": "malstraem",
        "content": "\u002B1",
        "createdAt": "2026-02-06T13:28:50.5141558Z"
      },
      {
        "user": "jeremy-visionaid",
        "content": "\u002B1",
        "createdAt": "2026-02-06T13:28:50.5141559Z"
      },
      {
        "user": "cyraid",
        "content": "\u002B1",
        "createdAt": "2026-02-06T13:28:50.5141561Z"
      }
    ],
    "comments": [
      {
        "id": 2029104036,
        "author": "Kation",
        "body": "I have tried to use SharpDX to create backend. But I found there is no api define in \u0060libSkiaSharp\u0060 because compile without define \u0060SK_Direct3D\u0060.",
        "createdAt": "2024-04-01T03:38:49",
        "reactions": []
      },
      {
        "id": 2029220348,
        "author": "996666925",
        "body": "👍👍👍",
        "createdAt": "2024-04-01T06:06:02",
        "reactions": []
      },
      {
        "id": 2029225113,
        "author": "Shunfeng88",
        "body": "The code demonstrates a deep understanding of the domain, incorporating relevant design patterns and domain-specific optimizations that reflect your expertise and intimate familiarity with the subject matter",
        "createdAt": "2024-04-01T06:11:03",
        "reactions": []
      },
      {
        "id": 2039302077,
        "author": "Kation",
        "body": "@mgood7123 \r\n\r\nSkia have define D3D functions:\r\nhttps://github.com/mono/skia/blob/a0008792c861228872a0a21f5f3422c4c8824720/include/gpu/GrDirectContext.h#L105-L112\r\n\r\nBut our SkiaSharp does not add those define:\r\nhttps://github.com/mono/skia/blob/a0008792c861228872a0a21f5f3422c4c8824720/include/c/gr_context.h#L28-L33",
        "createdAt": "2024-04-05T09:18:21",
        "reactions": []
      },
      {
        "id": 2127925699,
        "author": "gmurray81",
        "body": "Just as a warning here. Over the years I\u0027ve run into various areas where Direct2D performs in degraded ways compared to Skia software or Skia OpenGL/Vulkan backends. Mostly this has to do with conversion of Path geometry into tessellated meshes. If you have paths with high frequency changes in direction, this seems to be a terrible performance case for Direct2D. \r\n\r\nNow, maybe the Direct3D backend for skia sidesteps this stuff if it is using lower level primitives and skipping all the Direct2D stuff. But I\u0027d keep an eye out for degraded path rendering scenarios if the backend touches any of the high level stuff.",
        "createdAt": "2024-05-23T20:00:51",
        "reactions": []
      },
      {
        "id": 2712576679,
        "author": "ShadowMarker789",
        "body": "With https://github.com/mono/skia/pull/121 Complete, there is some potentiality of this moving forward, and I am very excited about this. ",
        "createdAt": "2025-03-11T04:25:29",
        "reactions": []
      },
      {
        "id": 2712853767,
        "author": "mattleibow",
        "body": "Yes, I am busy reviewing and making sure it is all green. You can help by treating the **nuget** artifacts on the SkiaSharp PR https://dev.azure.com/xamarin/public/_build/results?buildId=137303\u0026view=results\n\n",
        "createdAt": "2025-03-11T06:46:27",
        "reactions": []
      },
      {
        "id": 2715382678,
        "author": "ShadowMarker789",
        "body": "\u003E Yes, I am busy reviewing and making sure it is all green. You can help by treating the **nuget** artifacts on the SkiaSharp PR https://dev.azure.com/xamarin/public/_build/results?buildId=137303\u0026view=results\n\nAm I missing something? I see zero (0) artefacts there. \n\n![Image](https://github.com/user-attachments/assets/bbac6e1c-a261-4190-be01-7191d2f13a7e)\n\nIs there a particular preview version you mean instead?",
        "createdAt": "2025-03-11T18:43:32",
        "reactions": []
      },
      {
        "id": 2715748454,
        "author": "jeremy-visionaid",
        "body": "@ShadowMarker789 Not just you - the artifacts are gone. I can see nugets artifacts for a later build though:\nhttps://dev.azure.com/xamarin/public/_build/results?buildId=137454\u0026view=artifacts\u0026pathAsName=false\u0026type=publishedArtifacts",
        "createdAt": "2025-03-11T21:28:46",
        "reactions": []
      },
      {
        "id": 2721477013,
        "author": "mattleibow",
        "body": "MERGED https://github.com/mono/SkiaSharp/commit/4fb125b3a6907c5410a454b6b1f3d09ad2e5b286\n\nIn about 3 hours a new build will appear in the preview feed for everyone to enjoy. Thanks OpenGL, you had your time, Direct X here we come.\n\nFor things like views and other D3D libraries (like Silk.NET), please open new issues and also new PRs ;)",
        "createdAt": "2025-03-13T14:31:56",
        "reactions": [
          {
            "user": "azeno",
            "content": "heart",
            "createdAt": "2026-02-06T13:28:49.4990425Z"
          },
          {
            "user": "angelofb",
            "content": "hooray",
            "createdAt": "2026-02-06T13:28:49.499043Z"
          },
          {
            "user": "Kation",
            "content": "hooray",
            "createdAt": "2026-02-06T13:28:49.4990431Z"
          },
          {
            "user": "FlorianButz",
            "content": "hooray",
            "createdAt": "2026-02-06T13:28:49.4990432Z"
          }
        ]
      },
      {
        "id": 2721660162,
        "author": "gmurray81",
        "body": "@mattleibow Is any of the native D3D path rendering used in the D3D ganesh stuff? Or is it only lower level stuff/shaders that get used? I\u0027m a bit concerned because in my experience the D3D path tessellation stuff is pretty awful compared to Skia...",
        "createdAt": "2025-03-13T15:26:32",
        "reactions": []
      },
      {
        "id": 2723310735,
        "author": "mattleibow",
        "body": "@gmurray81 I am not sure. I suppose we could write a semi-complex image and benchmark on the backends to see which is faster. But, I assume that Google would have made the backend as fast as possible. We have been using Direct3D already with WinUI and UWP via the ANGLE wrappers/proxies. So I can\u0027t imagine that it is that much slower.\n\nAlso, @jeremy-visionaid said: https://github.com/mono/SkiaSharp/pull/2823#issuecomment-2709795863\n\n\u003E OK, I\u0027ve got a working proof of concept using the D3D backend. Took me a little while to check the performance. Looks about 5-10% faster than the ANGLE build for our app...\n\n\n\nIf you have a scene that you think is going to hit some slow paths, we could set up a test app to render it and check. ",
        "createdAt": "2025-03-14T03:23:34",
        "reactions": []
      },
      {
        "id": 2725092612,
        "author": "gmurray81",
        "body": "@mattleibow \nI\u0027ll try to put something together if I have time. The basic way to simulate the issue, though, is to draw a path from left to right and emit a segment roughly per pixel, but use entirely random y coordinates for each. To see the impact this causes, repaint with new y coordinates as quick as possible and observe the framerate.  This creates a line that chaotically oscillates in y coordinate. In WPF and the versions of Direct2D that I\u0027ve tried, this usually makes the path rendering pipeline fail hard. I assume its a really bad edge case in the meshification of the path. \n\nSkia briefly had this issue also. When they initially turned on hardware acceleration in chrome back in the day, they had a similar perf issue with these shapes, that they subsequently fixed. I\u0027m not positive how they fixed it. Perhaps they detect this scenario and bail out and do a CPU based rasterization instead. Or maybe they fixed something in the algorithms.\n\nNow, this is not really a useful shape, to have a really chaotic path, but it still winds up coming up for me. I make charting components, and for whatever reason the thing any customer tries first is to just assign completely random data. The problem is, though that this winds up creating bottlenecks _in the render pipeline_ outside of my reach. Which is pretty frustrating.\n\nHere\u0027s the link to the bug that I reported to chrome back in the day. It has a simple JS repro against the Canvas API in the browser, and it represent something that would make WPF/Direct2D cough up blood, unless maybe its fixed in the latest Direct2D versions? I think I even tried the scenario in that new 2D windows api... cant\u0027 recall the name ATM, and it was still an issue there...\n\nhttps://issues.chromium.org/issues/40106266\n\nBTW, I feel like I\u0027ve seen this slow down in Chrome lately, and reported a new bug. But I think they\u0027ve had issues reproducing a perf drop, and I haven\u0027t had to opportunity to provide them more info. But it\u0027s also possible that I\u0027m hallucinating, or that I just have a much higher DPI monitor than the last time I tried some of this stuff:\n\nhttps://issues.chromium.org/issues/382503551",
        "createdAt": "2025-03-14T15:51:47",
        "reactions": []
      },
      {
        "id": 2725102718,
        "author": "gmurray81",
        "body": "sorry, one of the links was wrong, edited",
        "createdAt": "2025-03-14T15:55:12",
        "reactions": []
      },
      {
        "id": 2725152739,
        "author": "gmurray81",
        "body": "note that paths with the same number or segments but less chaos perform much better in all 2D apis, so something about the chaos breaks the assumptions that the algorithms in the tessellation/meshification are making. I would say it has something to do with the points having big mitered joins or complex rounded triangle fans, but from what I recall, I don\u0027t think the type of line join had much effect on the performance, at least in WPF/Direct2D, so maybe it may have something to do with a geometry simplification step before the other steps...",
        "createdAt": "2025-03-14T16:14:20",
        "reactions": []
      }
    ]
  }
}