{
  "number": 2931,
  "type": "issue",
  "state": "open",
  "title": "[FEATURE] Support new color mapping api",
  "body": "### Is your feature request related to a problem?\n\nSkia dropped colormap support for some reason\n\n### Describe the solution you would like\n\nPlease supply alternative for mapping true color images to a linear color array.\r\n\r\nIt would be a way to map a true color image to a 32 bit index in a color array.\r\nThen it could be shifted and drawn remapped to the palette.\r\n\r\nTo make it clear this is 3 parts.\r\n1. A api to quantization rgba SKBitmaps to a 32 bit indexed SKBitmaps\r\n2. A api to shift color quantization palettes\r\n3. A api to draw it back to a palette mapped rgba SKBitmap\r\n\r\n\n\n### Describe alternatives you have considered\n\nI tried using avalonia ui WriteableBitmaps but they are too slow.\n\n### Additional context\n\nBy 32 bit indexed image I mean it would still technically be a rgba image but the integer representation of the color would be used as the index to the color palette.\n\n### Code of Conduct\n\n- [X] I agree to follow this project\u0027s Code of Conduct",
  "author": {
    "login": "Shadowblitz16",
    "type": "User"
  },
  "labels": [
    {
      "name": "type/feature-request",
      "color": "ededed"
    }
  ],
  "assignees": [],
  "createdAt": "2024-07-09T20:40:00",
  "updatedAt": "2024-07-10T12:17:15",
  "commentCount": 3,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T12:53:01.5997824Z",
    "reactions": [],
    "comments": [
      {
        "id": 2220163528,
        "author": "mattleibow",
        "body": "I wonder if this is better with a custom runtime effect / shader? Then you can just draw an image and the effect will be applied.\r\n\r\nI am not super useful with writing shaders, but here are some things that may help:\r\n- intro docs: https://skia.org/docs/user/sksl/\r\n- playground: https://shaders.skia.org/\r\n\r\nHere is a ShaderToy something that may help: https://www.shadertoy.com/view/XdX3D4\r\n\r\nYou might be able to do everything you want in a single shader",
        "createdAt": "2024-07-10T10:40:58",
        "reactions": []
      },
      {
        "id": 2220164718,
        "author": "mattleibow",
        "body": "@taublast I know you are doing cool things with shaders, is this something that you have done before?",
        "createdAt": "2024-07-10T10:41:25",
        "reactions": []
      },
      {
        "id": 2220360647,
        "author": "taublast",
        "body": "Not at all, but the above could be done with a shader indeed, that\u0027s maybe why Skia removed their API code.  \r\nLogically, upon SkiaSharp v3 release it would be totally up to us developers to provide an implementation for absolutely any image processing, as we would finally have that total powerful possibility in .NET. :)",
        "createdAt": "2024-07-10T12:17:14",
        "reactions": []
      }
    ]
  }
}