{
  "number": 297,
  "type": "issue",
  "state": "closed",
  "title": "MeasureText in samples seems not to work with zoom on Android emulator",
  "body": "https://us.v-cdn.net/5019960/uploads/editor/3j/tsd7ktfjdfdc.png\r\nhttps://us.v-cdn.net/5019960/uploads/editor/og/d8et3k89rfl6.png\r\n\r\nAll I did was edit the MeasureTextSample.cs to add \r\n\r\npublic const string TEXT = \u0022This is a longer text string to measure Skia (UTF-8)\u0022;\r\n\r\nand set the various text strings to TEXT rather than \u0022Skia (UTF-8)\u0022;\r\n\r\nI then ran the project and did used the emulator in  zoom in / out function.   I am using Visual Studio 17.  I used VisualStudio_android-23_x86_tablet (Android 6.0 - API 23)\r\n\r\nI haven\u0027t tested this on a device as I do not have one.\r\n\r\nIs this expected? ",
  "author": {
    "login": "blazespinnaker",
    "type": "User"
  },
  "labels": [
    {
      "name": "status/needs-info",
      "color": "B8EC4A"
    }
  ],
  "assignees": [],
  "createdAt": "2017-05-13T21:28:10",
  "updatedAt": "2022-08-19T21:01:56",
  "closedAt": "2018-12-14T05:02:55",
  "commentCount": 4,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T13:57:45.6512843Z",
    "reactions": [],
    "comments": [
      {
        "id": 301645446,
        "author": "mattleibow",
        "body": "I have not seen that yet. I tried with a device, the VS emulators as well as the Google emulators. I am assuming the zoom you are talking about is the magnifying glass button on the panel next to the emulator window?\r\n\r\nI have a simple sample that just draws and measures text. Can you try that and see what happens?\r\n\r\n[AndroidSkiaSharp.zip](https://github.com/mono/SkiaSharp/files/1002873/AndroidSkiaSharp.zip)\r\n",
        "createdAt": "2017-05-16T01:00:40",
        "reactions": []
      },
      {
        "id": 301978761,
        "author": "blazespinnaker",
        "body": "I\u0027m actually referring to using the mouse button and dragging it in the emulator.   It creates a pinch zoom effect.   I discovered it because it seemed like the font seemed to be awkwardly shifting in size relative to the boundary box as I was pinch/zooming.  The effect seems a bit haphazard compare to other apps I use.   I experimented further and found you have to carefully zoom in/out to find the extreme examples I listed above.   I don\u0027t have access to VS right now, but will try tomorrow when I get some time.  ",
        "createdAt": "2017-05-17T03:57:27",
        "reactions": []
      },
      {
        "id": 442097338,
        "author": "mattleibow",
        "body": "Is this still an issue? I was not able to repro.",
        "createdAt": "2018-11-27T15:21:37",
        "reactions": []
      },
      {
        "id": 447214242,
        "author": "Redth",
        "body": "We are closing this issue since no response was received.  Please open a new issue referring to this one if you have more information.",
        "createdAt": "2018-12-14T05:02:55",
        "reactions": []
      }
    ]
  }
}