{
  "number": 310,
  "type": "issue",
  "state": "open",
  "title": "Resizing the view while painting: A generic error occurred in GDI\u002B",
  "body": "I have come across a reproducible issue which results in the following exception occuring in the Views.Desktop.SKControl class\r\n\r\nSystem.Runtime.InteropServices.ExternalException (0x80004005): A generic error occurred in GDI\u002B.\r\n   at System.Drawing.Bitmap.UnlockBits(BitmapData bitmapdata)\r\n   at SkiaSharp.Views.Desktop.SKControl.OnPaint(PaintEventArgs e)\r\n   at System.Windows.Forms.Control.PaintWithErrorHandling(PaintEventArgs e, Int16 layer)\r\n   at System.Windows.Forms.Control.WmPaint(Message\u0026 m)\r\n   at System.Windows.Forms.Control.WndProc(Message\u0026 m)\r\n   at System.Windows.Forms.NativeWindow.Callback(IntPtr hWnd, Int32 msg, IntPtr wparam, IntPtr lparam)\r\n\r\nThe scenario for my use case is that i have an SKControl as a child of a DevExpress XtraScrollableControl. The XtraScrollableControl basically gives you a touch scrollable canvas of windows controls in a desktop form. \r\n\r\nMy SKControl resizes based on the content im rendering, sometimes this content exceeds the window size and the XtraScrollableControl allows me to scroll down to view more (think of it like a scrollable list). \r\n\r\nEverything works fine under normal use, but the problem occurs 100% of the time if i have scrolled the XtraScrollableControl canvas down to view the bottom parts of the SKControl then I change the height of the SKControl (due to a content change) which results in it being completely offscreen.\r\n\r\nI can solve the problem in this case easily enough by resetting my XtraScrollableControl scroll position to the top so the SKControl will be visible regardless of size whenever a content change occurs (which i was supposed to be doing originally anyway), however I am reporting this problem as there may be a deeper issue here which could crop up in other situations.\n\n\u003E VS bug [#735692](https://devdiv.visualstudio.com/DevDiv/_workitems/edit/735692)",
  "author": {
    "login": "Craig-TSS",
    "type": "User"
  },
  "labels": [
    {
      "name": "type/enhancement",
      "color": "84b6eb"
    },
    {
      "name": "status/low-priority",
      "color": "B8EC4A"
    },
    {
      "name": "os/Windows-Classic",
      "color": "fbca04"
    },
    {
      "name": "area/SkiaSharp.Views",
      "color": "0052cc"
    }
  ],
  "assignees": [
    {
      "login": "mattleibow",
      "type": "User"
    }
  ],
  "createdAt": "2017-06-07T02:25:49",
  "updatedAt": "2026-02-11T13:47:25",
  "commentCount": 5,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T14:36:26.0961654Z",
    "reactions": [],
    "comments": [
      {
        "id": 306673823,
        "author": "Craig-TSS",
        "body": "Ok so further testing has revealed that its not only when the SKControl resizes to be completely outside the view that causes the issue, its also whenever the SKControl is resized smaller AND the bottom of the SKControl comes into view after being outside the viewable area AND the xtrascrollable control is not at its topmost position.\r\n\r\nOne possibly important point is that I am changing the SKControl.Height value from within the PaintSurface event, which is obviously triggered from inside the OnPaint override in SKCanvas, which is inside the bitmap lock/unlock. ",
        "createdAt": "2017-06-07T03:09:16",
        "reactions": []
      },
      {
        "id": 306682115,
        "author": "Craig-TSS",
        "body": "I have downloaded the skia sharp code and debugged the issue in detail and what i have found is that the OnPaint event is being called from within the OnPaint event (due to my height resize code), but only in rare circumstances. I suspect the XtraScrollableControl has a hook on my SKControl sized event and is manually calling the OnPaint function directly in a certain situation. \r\n\r\nThe height change of the SKControl was being done in my PaintSurface hook (yes i know, bad!) as a convenience as i don\u0027t know the height required until i\u0027ve actually rendered my content as there is a lot of rendering logic that can effect the resulting height. I thought the resize event would only trigger another redraw event to fire after the current one completes, however it seems to be being called directly in some circumstances, I am assuming by the XtraScrollableControl. \r\n\r\nSo i will rework my code to do the rendering layout logic outside of the paint event so i can calculate the required height accurately and trigger the height resize outside of the paint event.\r\n\r\nIt would be easy enough to handle this situation in the SKControl itself so it doesn\u0027t crash, not sure if its worth bothering with though.",
        "createdAt": "2017-06-07T04:18:21",
        "reactions": [
          {
            "user": "mattleibow",
            "content": "\u002B1",
            "createdAt": "2026-02-06T14:36:25.3226816Z"
          }
        ]
      },
      {
        "id": 306683988,
        "author": "mattleibow",
        "body": "I will keep this issue open so that I can investigate this later.\r\n\r\nAs you point out, triggering a UI update (which will cause a repaint) in the paint is never really a good idea. And, as you say, trying to do this calculation outside is probably better anyway. Also, you may find that performance improves when doing the layout calculation once. This way, the paint method is as slim as it needs to be. As a result, the drawing code (which is actually a blocking UI operation) is as quick as possible.\r\n\r\n_Thanks for your hard work in this investigation, along with your detailed notes. Had this been a bug, there would be some info that would have helped greatly._",
        "createdAt": "2017-06-07T04:34:29",
        "reactions": []
      },
      {
        "id": 306686261,
        "author": "Craig-TSS",
        "body": "Thanks, I am very familiar with the need for detailed information when it comes down to tracking problems like this. ",
        "createdAt": "2017-06-07T04:54:12",
        "reactions": []
      },
      {
        "id": 441698394,
        "author": "mattleibow",
        "body": "This issue was the result of the paint operation also resizing the view - possibly invalidating the canvas or causing an infinite loop/stack overflow.\r\nTypically, the act of modifying the very canvas you are drawing on, while you are doing said drawing is bad. This issue serves to act as a note for further investigation.",
        "createdAt": "2018-11-26T16:14:46",
        "reactions": []
      }
    ]
  }
}