{
  "number": 3106,
  "type": "issue",
  "state": "closed",
  "title": "[iOS, 3.116.1, .NET MAUI 9.0] SkiaSharp still has a memory leak in .NET MAUI on iOS",
  "body": "### Description\r\n\r\nWhen run with .NET MAUI 9.0 and SkiaSharp 3.116.1, my game GnollHack still runs out of memory on iOS when you try to open the game page many times (two is enough on my old iPad). This does not happen in Xamarin with exactly the same code.\r\n\r\n### Code\r\n\r\nhttps://github.com/hyvanmielenpelit/GnollHackMAUIEasyBuild\r\n\r\n### Expected Behavior\r\n\r\nNo matter how many times the game page is being opened by Play Game button, the game or image carousel never runs out of memory, as old pages with no references to are successfully being garbage collected.\r\n\r\n### Actual Behavior\r\n\r\nWhen you start the game, you land on main page, which has an image carousel with three alternating pictures and several buttons. Press Play Game (opens game page), then quit (back to main page), press Play Game again (opens another game page), and quit again (back again to main page). Now, you will see that the image carousel on the main page becomes black, as it runs out of memory. You may need to do the process a few times more on iOS devices with a lot of memory.\r\n\r\nThis means that the memory from the pages is not being released for garbage collection in .NET MAUI 9.0 / SkiaSharp 3.116.1.\r\n\r\n### Version of SkiaSharp\r\n\r\n3.116.0 (Current)\r\n\r\n### Last Known Good Version of SkiaSharp\r\n\r\n2.88.9 (Previous)\r\n\r\n### IDE / Editor\r\n\r\nVisual Studio (Windows)\r\n\r\n### Platform / Operating System\r\n\r\niOS\r\n\r\n### Platform / Operating System Version\r\n\r\niOS 18.1.1\r\n\r\n### Devices\r\n\r\niPad 11,7\r\n\r\n### Relevant Screenshots\r\n\r\n_No response_\r\n\r\n### Relevant Log Output\r\n\r\n_No response_\r\n\r\n### Code of Conduct\r\n\r\n- [X] I agree to follow this project\u0027s Code of Conduct",
  "author": {
    "login": "janne-hmp",
    "type": "User"
  },
  "labels": [
    {
      "name": "type/bug",
      "color": "fc2929"
    }
  ],
  "assignees": [],
  "createdAt": "2024-12-06T17:00:53",
  "updatedAt": "2025-04-21T10:32:10",
  "closedAt": "2025-04-21T10:32:10",
  "commentCount": 7,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T12:44:42.6193581Z",
    "reactions": [],
    "comments": [
      {
        "id": 2523745870,
        "author": "similar-issues-ai[bot]",
        "body": "We\u0027ve found some similar issues:\n\n\n- #2951 , similarity score: 87%\n- #2840 , similarity score: 86%\n- #2923 , similarity score: 82%\n  \n\nIf any of the above are duplicates, please consider closing this issue out and adding additional context in the original issue.\n\n\u003E Note: You can give me feedback by 👍 or 👎 this comment.",
        "createdAt": "2024-12-06T17:01:02",
        "reactions": []
      },
      {
        "id": 2523852820,
        "author": "janne-hmp",
        "body": "I might add that the previous memory leak demonstrated in https://github.com/hyvanmielenpelit/iOSMauiSkiaSharpMemoryLeak has in fact been fixed, so this is something different. The earlier fix should help at least with opening simple menu pages as many times as necessary, which already a big improvement, but there\u0027s still a further memory leak with GnollHackM\u0027s GamePage, which did not exist in Xamarin. This prevents the game from being started more than one time without exiting the app first.\r\n\r\n@mattleibow If you can suggest how I could single out the source of the memory leak, happy to try it.",
        "createdAt": "2024-12-06T17:52:52",
        "reactions": []
      },
      {
        "id": 2524170124,
        "author": "mattleibow",
        "body": "@PureWeen do you have the notes cleaned up for the iOS memory leak profiling? If not I can update our wiki based off it. ",
        "createdAt": "2024-12-06T21:02:34",
        "reactions": []
      },
      {
        "id": 2619975198,
        "author": "janne-hmp",
        "body": "@mattleibow  @PureWeen I added now to every page closing function \u0060((IView)this).DisconnectHandlers();\u0060 and the iOS memory leak problem seems to have been mostly solved. However, this probably means that there\u0027s somewhere a control / handler with a manual disconnect policy, which might need attention. As far as I know, I have not used manual disconnect policy anywhere.",
        "createdAt": "2025-01-28T20:18:11",
        "reactions": []
      },
      {
        "id": 2620189005,
        "author": "PureWeen",
        "body": "\u003E [@PureWeen](https://github.com/PureWeen) do you have the notes cleaned up for the iOS memory leak profiling? If not I can update our wiki based off it.\n\nYes https://github.com/dotnet/maui/wiki/Memory-Leaks#ios",
        "createdAt": "2025-01-28T22:31:15",
        "reactions": []
      },
      {
        "id": 2625494015,
        "author": "janne-hmp",
        "body": "As a further note, MAUI Windows seems to crash to with \u0060((IView)this).DisconnectHandlers();\u0060 but MAUI iOS needs it to solve the memory leak, so I had to add \u0060#if !WINDOWS\u0060 here.",
        "createdAt": "2025-01-30T20:19:42",
        "reactions": []
      },
      {
        "id": 2818136415,
        "author": "janne-hmp",
        "body": "This might have been caused by my own code that left a reference to the game object, which referred to the game page, but releasing the handlers saved enough memory not to be a problem anymore. So closing this for now.",
        "createdAt": "2025-04-21T10:32:05",
        "reactions": []
      }
    ]
  }
}