{
  "number": 3156,
  "type": "pr",
  "state": "closed",
  "title": "Fix iOS Simulator performance with Metal",
  "body": "This comes from a new synced branch.\r\n\r\nHad iOS simulator lagging on M1 at 9 fps with SKGLView, so had to adjust its platform-related code for iOS to unlock 60 fps.\r\nJust followed Apple guidelines for simulator:   https://developer.apple.com/documentation/metal/developing-metal-apps-that-run-in-simulator?language=objc\r\n\r\nreplacing \u0060SampleCount = 1;\u0060 (no MSAA) inside \u0060SKMetalView\u0060 with:\r\n\r\n\u0060\u0060\u0060csharp\r\n\t\t\tif (DeviceInfo.Current.DeviceType == DeviceType.Virtual)\r\n\t\t\t{\r\n\t\t\t\tDepthStencilStorageMode = MTLStorageMode.Private;\r\n\t\t\t\tSampleCount = 4;\r\n\t\t\t}\r\n\t\t\telse\r\n\t\t\t{\r\n\t\t\t\tDepthStencilStorageMode = MTLStorageMode.Shared;\r\n\t\t\t\tSampleCount = 2;\r\n\t\t\t}\r\n\u0060\u0060\u0060\r\n \r\nWorks fine in DrawnUi now, wanted to share.\r\n",
  "author": {
    "login": "taublast",
    "type": "User"
  },
  "labels": [
    {
      "name": "community ✨",
      "color": "ededed"
    }
  ],
  "assignees": [],
  "createdAt": "2025-02-06T07:08:13",
  "updatedAt": "2025-05-02T09:31:26",
  "closedAt": "2025-02-17T15:43:50",
  "commentCount": 13,
  "reactionCount": 1,
  "draft": false,
  "merged": true,
  "mergedAt": "2025-02-17T15:43:50",
  "mergeableState": "unknown",
  "baseBranch": "main",
  "headBranch": "synched",
  "additions": 19,
  "deletions": 1,
  "changedFiles": 1,
  "commits": 7,
  "reviews": [
    {
      "author": "mattleibow",
      "state": "CHANGES_REQUESTED",
      "submittedAt": "2025-02-12T14:16:44"
    },
    {
      "author": "taublast",
      "state": "COMMENTED",
      "submittedAt": "2025-02-12T15:02:50"
    },
    {
      "author": "mattleibow",
      "state": "COMMENTED",
      "submittedAt": "2025-02-12T15:11:38"
    },
    {
      "author": "taublast",
      "state": "COMMENTED",
      "submittedAt": "2025-02-12T15:14:33"
    },
    {
      "author": "taublast",
      "state": "COMMENTED",
      "submittedAt": "2025-02-12T15:17:33"
    },
    {
      "author": "taublast",
      "state": "COMMENTED",
      "submittedAt": "2025-02-12T15:18:35"
    },
    {
      "author": "taublast",
      "state": "COMMENTED",
      "submittedAt": "2025-02-12T15:24:25"
    },
    {
      "author": "mattleibow",
      "state": "COMMENTED",
      "submittedAt": "2025-02-12T15:47:57"
    },
    {
      "author": "taublast",
      "state": "COMMENTED",
      "submittedAt": "2025-02-12T15:49:24"
    },
    {
      "author": "taublast",
      "state": "COMMENTED",
      "submittedAt": "2025-02-12T17:09:42"
    }
  ],
  "engagement": {
    "syncedAt": "2026-02-06T13:27:09.1296651Z",
    "reactions": [
      {
        "user": "follesoe",
        "content": "\u002B1",
        "createdAt": "2026-02-06T13:27:09.1296713Z"
      }
    ],
    "comments": [
      {
        "id": 2652580064,
        "author": "mattleibow",
        "body": "/rebase",
        "createdAt": "2025-02-12T03:34:11",
        "reactions": []
      },
      {
        "id": 2653252271,
        "author": "mattleibow",
        "body": "/azp run",
        "createdAt": "2025-02-12T10:08:46",
        "reactions": []
      },
      {
        "id": 2653253126,
        "author": "azure-pipelines[bot]",
        "body": "\u003Csamp\u003E\nAzure Pipelines could not run because the pipeline triggers exclude this branch/path.\u003Cbr\u003E\r\n\n\u003C/samp\u003E",
        "createdAt": "2025-02-12T10:08:54",
        "reactions": []
      },
      {
        "id": 2843866650,
        "author": "jeremy-visionaid",
        "body": "@taublast I\u0027m a bit late to the party, but are you sure this is correct/needed? Maybe it\u0027s my particular use case or hardware or something, but I can\u0027t repro any performance improvement by this approach on iOS simulator/MacCatalyst on an M2 Pro or on a real device. Do you have some benchmark/example you could share?\r\n\r\nI also interpret the documentation differently... I read it as an example of how to avoid using a sample count of 2 for MSAA textures in the simulator (which is a stated limitation). I don\u0027t think it\u0027s recommending MSAA for MTKView - just that it shouldn\u0027t be 2 on the simulator if you do. Private is also already the default for DepthStencilStorageMode. I\u0027m not sure what advantage MSAA or a shared storage mode would have for Skia? (SKCanvas.ReadPixels perhaps but that shouldn\u0027t affect the simulator anyway?)\r\n\r\nNice work with DrawnUi BTW!",
        "createdAt": "2025-05-01T01:20:29",
        "reactions": []
      },
      {
        "id": 2844185665,
        "author": "taublast",
        "body": "Hello and thanks!\r\n\r\nLet\u0027s look at this like this:\r\n\r\nI may be wrong but as I recall, SkiaSharp default handlers do not use Metal on Mac, so that\u0027s maybe why on Mac there is no effect for you. But DrawnUi uses Metal on Catalyst and I can confirm it\u0027s all fine there with this fix.\r\n\r\niOS simulator on Apple Silicon proof of this awesome fix:\r\n\r\n![image](https://github.com/user-attachments/assets/91ede010-d71f-4203-8eea-0d688976c117)\r\n\r\nBut but.. never tested the fixed default SkiaSharp handler with this fix, though the code of the fix looks identical.\r\n\r\nLet\u0027s compare:\r\n\r\nOne used for taking the screenshot:\r\nhttps://github.com/taublast/DrawnUi/blob/b4694318cee2977998c82b7c9c33089a6955a58d/src/Maui/DrawnUi/Platforms/iOS/Views/SKMetalViewRetained.cs#L109\r\n\r\nSkiaSharp default: https://github.com/mono/SkiaSharp/blob/cc7452034c8b4f80a3943e7bf22d17dd006a7b08/source/SkiaSharp.Views/SkiaSharp.Views/Platform/Apple/SKMetalView.cs#L96\r\n\r\nRegarding the interpretation of Apple\u0027s guidelines, can\u0027t comment much here, I read it like Apple recommends this for simulator, I use it, it works, so why bother.. :) \r\n\r\n![image](https://github.com/user-attachments/assets/201186b6-8902-429a-a782-fbef3d0e52da)\r\n\r\nBut your message raises concerns:\r\n\r\nMaybe you tested Catalyst only? Maybe we fixed code in SkiaSharp is not working as intended for some reason? Maybe you were testing SKCanvas and not SKGLView? Needs clarifying indeed..\r\n",
        "createdAt": "2025-05-01T06:21:41",
        "reactions": []
      },
      {
        "id": 2845890359,
        "author": "jeremy-visionaid",
        "body": "Hey! Thanks for getting back to me so quickly! I should have clarified that I\u0027m actually writing my own MAUI handler since the ones from SkiaSharp aren\u0027t quite what I need (On Windows I\u0027m doing some unusual things with DX11/12 interop, YUV swap chains and multiplane overlays). Correspondingly, I\u0027ve implemented handlers and platform views using Metal for iOS/MacCatalyst and OpenGL on Android to ensure that the virtual view is always hardware accelerated. So, I\u0027ve tested something that\u0027s essentially equivalent to SkiaSharp\u0027s SKMetalView and tested on net9.0-ios (simulator and physical device) and net9.0-maccatalyst. (I can\u0027t actually test a release build for the simulator since AOT takes too long and \u0060UseInterpreter\u0060 crashes due to some other dotnet/upstream bug, but the performance is still in line with other configurations).\r\n\r\nThanks so much for sharing the link to you use! I\u0027ll try and have a play spinning up DrawnUi and see if I can repro your findings locally. I notice a couple of things about the SKMetalViewRetained implementation which might be relevant:\r\n\r\nFirst, it\u0027s doing manual double buffering. AFAIK, MTKView already handles this for you (i.e. the texture from CurrentDrawable will switch every frame), so I\u0027m not sure the blit is required.  As an aside, I was thinking about caching the render target/surface/event args to save some overhead as an optimization later.\r\n\r\nSecondly, the textures being used for the render target for skia have a sample count of 1 (i.e. it\u0027s not actually using MSAA like 3.119 now does, since SKMetalView draws directly to the back buffer). Maybe there\u0027s something about the blit that adversley affects the performance.\r\n\r\nAnyways, I\u0027ll take a look and get back to you. Thanks again!",
        "createdAt": "2025-05-01T22:10:08",
        "reactions": []
      },
      {
        "id": 2846218749,
        "author": "jeremy-visionaid",
        "body": "I was able to spin up the space shooter sample game you provided and build it against a branch of DrawnUi 1.4 with a ProjectReference. I found no significant difference in performance with this change applied or not, either on an iPad or in the simulator. However, I was able to remove the manual double buffering/blit, which gave a minor reduction in GPU usage (8.2 =\u003E 8.0) according to the graphics HUD while still not showing any tearing.\r\n\r\nIt\u0027s still possible still that there\u0027s something hardware or simulator specific, but did you want to double check your results? Otherwise I\u0027d be in favour of reverting this change.",
        "createdAt": "2025-05-02T03:10:48",
        "reactions": []
      },
      {
        "id": 2846236268,
        "author": "jeremy-visionaid",
        "body": "Leaving a trail of breadcrumbs, here\u0027s why the simulator crashes in release builds:\r\nhttps://github.com/dotnet/macios/issues/22205",
        "createdAt": "2025-05-02T03:32:45",
        "reactions": []
      },
      {
        "id": 2846603219,
        "author": "taublast",
        "body": "Thanks i will update the shooter with latest nuget today. You can already check the latest shaders demo running on simulator, i hope this will count as benchmark :)\r\n\r\nhttps://github.com/taublast/ShadersCarousel\r\n\r\nhttps://github.com/user-attachments/assets/7d85d72e-a999-42ca-b619-fc3e7a9523cf\r\n\r\n",
        "createdAt": "2025-05-02T07:59:10",
        "reactions": []
      },
      {
        "id": 2846623005,
        "author": "taublast",
        "body": "\u003E It\u0027s still possible still that there\u0027s something hardware or simulator specific, but did you want to double check your results? Otherwise I\u0027d be in favour of reverting this change.\r\n\r\nAgain:\r\n1. Without this fix simulator for lagging like hell below 10 fps for any complex work.\r\n2. This follows Apple\u0027s guidelines regarding the usage of Metal on simulator that were not followed before.\r\n",
        "createdAt": "2025-05-02T08:10:46",
        "reactions": []
      },
      {
        "id": 2846717255,
        "author": "taublast",
        "body": "Hey, so we have a problem, i just checked with default SkiaSharp handler instead of mine.. Thanks to @jeremy-visionaid it was brought to light.\r\n\r\nSo when I use my handler I get 60 fps in simulator.\r\n\r\nhttps://github.com/taublast/DrawnUi/blob/b4694318cee2977998c82b7c9c33089a6955a58d/src/Maui/DrawnUi/Platforms/iOS/Views/SKMetalViewRetained.cs#L109\r\n\r\nWhen I use SkiaSharp handler I get around 30 fps for same app in same simulator, that\u0027s why Jeremy is like \u0022where\u0027s the promised performance\u0022:\r\n\r\nhttps://github.com/mono/SkiaSharp/blob/cc7452034c8b4f80a3943e7bf22d17dd006a7b08/source/SkiaSharp.Views/SkiaSharp.Views/Platform/Apple/SKMetalView.cs#L96\r\n\r\n@mattleibow maybe the \u0060DepthStencilModePrivate\u0060 condition is somehow not the same, maybe \u0060ObjCRuntime.Runtime.Arch == ObjCRuntime.Arch.SIMULATOR\u0060 is not working? Right now I cannot explain the current situation.",
        "createdAt": "2025-05-02T09:02:14",
        "reactions": []
      },
      {
        "id": 2846719662,
        "author": "jeremy-visionaid",
        "body": "Thanks for sharing the carousel sample, looks awesome! Makes it really convenient to switch between NuGet and local builds too 👍 \r\n\r\nStill no repro for the simulator lagging though - it runs at 60 fps for me regardless of the change. Testing on M2 Pro with iPad (A16) 18.4 simulator. I have another device I can test with, but what simulator are you using?\r\n\r\nI still don\u0027t see that this follows the Apple guidelines. AFAICT, they just state:\r\n\u003E Don’t use a sample count of 2 for MSAA textures.\r\n\r\nHowever, it\u0027s not the simulator case that concerns me. It\u0027s that we enabled MSAA and shared storage for the other cases, but aren\u0027t using them. At the end of the day it\u0027s only a minor thing (a little extra memory/power), and my app isn\u0027t affected anyway since I\u0027m also using using a custom handler. So, mostly it\u0027s just interesting from a point of correctness rather than any serious problem.",
        "createdAt": "2025-05-02T09:03:31",
        "reactions": []
      },
      {
        "id": 2846787940,
        "author": "taublast",
        "body": "I guess M2 Pro hides the issue by just killing it, i just checked this on M1 with 30fps standard and 60 fps custom handler problem.\r\nSo for me SkiaSharp handler is not working as intended on simulator, we need more people to test it probably.\r\n\r\nShared storage is needed to be able to read intermediate rendering results while still rendering, to create backdrops etc. Simulator uses pseudo-private still accessible to be read. So shared storage is a must if you want skia to function as intended by its API, it is designed to read intermediate rendering result.\r\n\r\nTo say something about SampleCount, just gpt\u0027ed it and looks like 1, that was here before this fix, is \u0022anti-aliasing OFF\u0022 (do we want it this way?), 2 (merged) is \u0022minimal visual improvement over no MSAA, while still incurring a performance cost\u0022 and 4 \u0022is the most commonly recommended choice for production apps on iOS/tvOS devices\u0022 - so in theory we could go for a PR proposing to use 4. Can\u0027t imagine why we would want turn antialiasing off in context of hardware only gaining in performance.\r\n\r\n\r\n\r\n",
        "createdAt": "2025-05-02T09:31:24",
        "reactions": []
      }
    ]
  }
}