{
  "number": 3325,
  "type": "issue",
  "state": "open",
  "title": "[FEATURE] Skia Starter Project",
  "body": "### Is your feature request related to a problem?\n\nProblem: It is extremely difficult to get started building cross-platform with SkiaSharp (or really building anything at all with it).\n\nAfter all these years, there still doesn\u0027t seem to be a starter solution for building cross-platform Skia apps. The samples in this repo don\u0027t build easily and aren\u0027t structured correctly for this, nor do they take the right approach for handling dependencies.\n\n### Describe the solution you would like\n\nI\u0027d like to be able to open VS, create new project, and select \u0022Cross Platform Skia\u0022. This should set me up with a solution containing a shared render project, and a project per native platform, each referencing the shared render project. Prefer HW accel setups.\n\nThis seems like a pretty prime use case for Skia and .NET.\n\nIf you can\u0027t create a VS template for this, then a zip file I can download with this setup would be appreciated. It would definitely be helpful in the immediate term. I just want to be able to nuget restore, build, and run. Then start adding my own paint code.\n\n### Describe alternatives you have considered\n\nI have explored getting this to work with the samples in this repo (no go, multiple build errors) and with AI (which can\u0027t seem to get it right either).\n\n### Additional context\n\nEvery 6 months or so, for the last several years (I think), I pop in here to see if this one basic setup scenario has been addressed. So far, no. Today, I wasted an hour or two trying to get some things up and running. No go. So much time wasted just trying to get hello world. Extremely frustrating in 2025.\n\n### Code of Conduct\n\n- [x] I agree to follow this project\u0027s Code of Conduct",
  "author": {
    "login": "EisenbergEffect",
    "type": "User"
  },
  "labels": [
    {
      "name": "type/feature-request",
      "color": "ededed"
    }
  ],
  "assignees": [],
  "createdAt": "2025-08-02T19:30:36",
  "updatedAt": "2026-01-31T17:34:12",
  "commentCount": 2,
  "reactionCount": 1
}