{
  "number": 3353,
  "type": "pr",
  "state": "closed",
  "title": "Improve the API Scan yaml in the template",
  "body": "**Description of Change**\r\n\r\nToo many things were unneccessary.",
  "author": {
    "login": "mattleibow",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2025-09-03T15:58:34",
  "updatedAt": "2025-09-04T00:48:23",
  "closedAt": "2025-09-04T00:48:19",
  "commentCount": 1,
  "reactionCount": 0,
  "draft": false,
  "merged": true,
  "mergedAt": "2025-09-04T00:48:19",
  "mergeableState": "unknown",
  "baseBranch": "main",
  "headBranch": "dev/1es",
  "additions": 88,
  "deletions": 105,
  "changedFiles": 5,
  "commits": 5,
  "reviews": [],
  "engagement": {
    "syncedAt": "2026-02-06T12:40:35.4071281Z",
    "reactions": [],
    "comments": [
      {
        "id": 3249851997,
        "author": "github-actions[bot]",
        "body": "**Triage Summary**  \n\nNo labels will be applied due to insufficient context and vague descriptions regarding the issue at hand.\n\nThis issue is not a regression as there are no relevant details provided to assess it as such.\n\nAdditional remarks:\n* The issue lacks specific information that could help classify it under any available label related to documentation, performance, or compatibility. \n* There is no mention of the platform or technology involved, which makes it challenging to apply relevant labels. \n\n\u003Cdetails\u003E\n\u003Csummary\u003EDetailed Summary and Actions\u003C/summary\u003E\n\nSummary of the triage:\n\n- The issue does not provide sufficient context to select appropriate labels.\n- There are no specifics regarding documentation, code, or relevant areas mentioned.\n- The content does not specify any operating system or platform related to the issue.\n- Insufficient details about performance, compatibility, or reliability of SkiaSharp prevent accurate labeling.\n- No information is provided to classify the issue under backend technologies such as Metal, OpenGL, PDF, Raster, or Vulkan.\n\nSummary of the actions that will be performed:\n\n| Action     | Item | Description |\n| :--------- | :--- | :---------- |\n| No Action  | N/A  | The issue does not provide enough context or details to warrant any label being applied. |\n\n\u003C/details\u003E\n\n_This entire triage process was automated by AI and mistakes may have been made. Please let us know so we can continue to improve._",
        "createdAt": "2025-09-03T15:59:07",
        "reactions": []
      }
    ]
  }
}