{
  "number": 3357,
  "type": "issue",
  "state": "open",
  "title": "Migrate to inline code docs",
  "body": "### Description\n\nCan you help migrate my docs from the docs folder into the c# source.\n\n* There is a guide here: ~/API.Docs.Migration.Guide.md\n* This is the checklist of APIs to migrate: ~/API.Docs.Migration.Checklist.md\n\nPlease go through each item on the checklist and migrate.\n\n### Setup\n\nMake sure that BEFORE you start, checkout all submodules. Don\u0027t try build anything or run any tests. The agents are not set up to do this.\n\n### Migration\n\nJust go through the checklist and migrate each type.\n\nThere is one important thing. Each type should be migrated and commited separately. We have a team that looks at things by commit and they do not want to have multiple types being done in a single commit.\n\nMigrate all the members in the types.\n\n### Rules\n\n* Migrate one type at a time\n* Migrate all the mebers on the type, even if there are many\n* Commit the changes for each type\n* Do not skip a type or member\n\n\n",
  "author": {
    "login": "mattleibow",
    "type": "User"
  },
  "labels": [
    {
      "name": "area/Docs",
      "color": "0052cc"
    }
  ],
  "assignees": [
    {
      "login": "Copilot",
      "type": "Bot"
    }
  ],
  "createdAt": "2025-09-04T19:03:56",
  "updatedAt": "2025-09-04T19:05:22",
  "commentCount": 1,
  "reactionCount": 1,
  "engagement": {
    "syncedAt": "2026-02-06T13:24:29.7516575Z",
    "reactions": [
      {
        "user": "Copilot",
        "content": "eyes",
        "createdAt": "2026-02-06T13:24:29.7516642Z"
      }
    ],
    "comments": [
      {
        "id": 3255184557,
        "author": "github-actions[bot]",
        "body": "**Triage Summary**  \n\nThe label for area/Docs will be applied indicating that the issue pertains to documentation management specifically related to migrating documentation.\n\nThis issue is not a regression as it is focused on documentation migration and does not involve any previously functional features.\n\nAdditional remarks:\n* The issue is primarily about migrating documentation and does not relate to any specific backend technology, compatibility, performance, or reliability issues. \n* There are no references to operating system-related problems or relevant labels that would apply.\n\n\u003Cdetails\u003E\n\u003Csummary\u003EDetailed Summary and Actions\u003C/summary\u003E\n\nSummary of the triage:\n\n- The issue is focused on migrating documentation from a folder to inline code docs.\n- The applicable label is area/Docs, indicating that it relates strictly to documentation management.\n- There are no underlying issues related to technology compatibility, performance, or reliability, nor any regression to be noted.\n\nSummary of the actions that will be performed:\n\n| Action      | Item        | Description                                                                 |\n| :---------- | :---------- | :-------------------------------------------------------------------------- |\n| Apply Label | area/Docs   | The issue concerns migrating documentation from a folder to inline code docs. |\n\n\u003C/details\u003E\n\n\n\n_This entire triage process was automated by AI and mistakes may have been made. Please let us know so we can continue to improve._",
        "createdAt": "2025-09-04T19:04:31",
        "reactions": []
      }
    ]
  }
}