{
  "number": 3367,
  "type": "pr",
  "state": "closed",
  "title": "Use a valid \u0022version number\u0022 for APIScan",
  "body": "**Description of Change**\r\n\r\nWe have gone through and processed the exceptions for the verion numbered paths. Would be great not to do it again.",
  "author": {
    "login": "mattleibow",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2025-09-10T18:17:34",
  "updatedAt": "2025-09-10T18:18:12",
  "closedAt": "2025-09-10T18:17:44",
  "commentCount": 1,
  "reactionCount": 0,
  "draft": false,
  "merged": true,
  "mergedAt": "2025-09-10T18:17:44",
  "mergeableState": "unknown",
  "baseBranch": "main",
  "headBranch": "dev/extract",
  "additions": 2,
  "deletions": 2,
  "changedFiles": 1,
  "commits": 1,
  "reviews": [],
  "engagement": {
    "syncedAt": "2026-02-06T13:24:08.0299735Z",
    "reactions": [],
    "comments": [
      {
        "id": 3276037676,
        "author": "github-actions[bot]",
        "body": "**Triage Summary**  \n\nNo labels will be applied due to insufficient information regarding the operating system, platform, backend technologies, or specific issues related to performance, reliability, or compatibility.\n\nThis issue does not represent a regression as it focuses on a change related to version numbering rather than an identifiable bug or feature problem.\n\nAdditional remarks:\n* The issue lacks context and details necessary to apply any relevant labels or categorize it effectively.\n\n\u003Cdetails\u003E\n\u003Csummary\u003EDetailed Summary and Actions\u003C/summary\u003E\n\nSummary of the triage:\n\n- The issue does not provide information about the operating system or platform involved, making label application impossible.\n- There are no clear indicators of backend technologies (like Metal, OpenGL, etc.) that pertain to the issue, further complicating label assignment.\n- The primary topic addressed is related to version numbering and APIScan rather than specific performance, reliability, or compatibility concerns.\n- As no specific areas are mentioned, no related labels can be allocated.\n\nSummary of the actions that will be performed:\n\n| Action        | Item        | Description                                                  |\n| :------------ | :---------- | :----------------------------------------------------------- |\n| No Action     | N/A        | The issue lacks sufficient information to apply relevant labels.| \n\n\u003C/details\u003E\n\n_This entire triage process was automated by AI and mistakes may have been made. Please let us know so we can continue to improve._",
        "createdAt": "2025-09-10T18:18:12",
        "reactions": []
      }
    ]
  }
}