{
  "number": 3369,
  "type": "issue",
  "state": "closed",
  "title": "[BUG] Hard crash on Linux ARM64 on 3.119.0",
  "body": "### Description\n\nWe upgraded our application from .NET 6 to .NET 9. Some external dependencies use SkiaSharp version 3.119.0. The application crashes, but only on Linux ARM64. It works correctly on Windows. I tested this on our device with an IMX8 processor and on a Raspberry Pi 5. In both cases, the application closes and does not leave any trace in the logs. It worked on 2.88.8 and .Net 6. I already tested preview version of 3.119.1 and the same thing happens. \n\nI have prepared a test application to reproduce this issue. For testing, you need, for example, an RP5, and it is enough to build the project in VS2022 for .NET 9 with the Blazor workload. After launching, simply go to localhost:8841 in the browser and press the button. The code is in the Home.razor file. \n\nI know the crash is caused by SkiaSharp, but I have no idea why, so I am unable to help further in this matter. I have no clue if .Net 9 is to blame or rather SkiaSharp itself.\n\nUse publish profile to publish app on ARM64.\n\n\n### Code\n\n[SkiaCrashTest.zip](https://github.com/user-attachments/files/22273530/SkiaCrashTest.zip)\n\n\n### Expected Behavior\n\nApplication shoud generate red circle.\n\n### Actual Behavior\n\nApplication have a hard crash.\n\n### Version of SkiaSharp\n\n3.119.0 (Current)\n\n### Last Known Good Version of SkiaSharp\n\n2.88.8 (Deprecated)\n\n### IDE / Editor\n\nVisual Studio (Windows)\n\n### Platform / Operating System\n\nLinux\n\n### Platform / Operating System Version\n\n- LInux with ARM64 CPU\n\n### Devices\n\n- Toradex IMX8\n- RPI5 \n\n### Relevant Screenshots\n\n_No response_\n\n### Relevant Log Output\n\n\u0060\u0060\u0060shell\n\n\u0060\u0060\u0060\n\n### Code of Conduct\n\n- [x] I agree to follow this project\u0027s Code of Conduct",
  "author": {
    "login": "Swordancer",
    "type": "User"
  },
  "labels": [
    {
      "name": "type/bug",
      "color": "fc2929"
    },
    {
      "name": "os/Linux",
      "color": "fbca04"
    },
    {
      "name": "tenet/reliability",
      "color": "BFD4F2"
    }
  ],
  "assignees": [],
  "createdAt": "2025-09-11T10:48:33",
  "updatedAt": "2026-02-03T10:33:31",
  "closedAt": "2026-02-03T10:33:31",
  "commentCount": 2,
  "reactionCount": 1,
  "engagement": {
    "syncedAt": "2026-02-06T13:20:10.7867709Z",
    "reactions": [
      {
        "user": "khoatbd55",
        "content": "\u002B1",
        "createdAt": "2026-02-06T13:20:10.7867764Z"
      }
    ],
    "comments": [
      {
        "id": 3279889584,
        "author": "github-actions[bot]",
        "body": "**Triage Summary**  \n\nLabels will be applied to highlight reliability issues on Linux ARM64 with SkiaSharp, as well as specific graphics backends involved in the rendering process.\n\nThis issue is not explicitly mentioned as a regression, but it reflects critical behavior that may affect usability.\n\nAdditional remarks:\n* The issue points to significant reliability concerns due to hard crashes on Linux ARM64.\n* SkiaSharp is identified as the root cause of the crashes, particularly in the context of rendering graphics.\n\n\u003Cdetails\u003E\n\u003Csummary\u003EDetailed Summary and Actions\u003C/summary\u003E\n\nSummary of the triage:\n\n- The issue describes a hard crash occurring on Linux ARM64 while using SkiaSharp version 3.119.0.\n- Core components involved are OpenGL and Vulkan, both of which are used for rendering graphics on the affected platform.\n- The issue specifically pertains to SkiaSharp.Views.Maui, indicating that the crash is likely related to the functionality of views in the library.\n- The crash\u0027s occurrence is tied directly to the Linux operating system on ARM64 architecture.\n\nSummary of the actions that will be performed:\n\n| Action         | Item                      | Description                                                                                               |\n| :------------- | :----------------------- | :-------------------------------------------------------------------------------------------------------- |\n| Apply Label    | tenet/reliability        | The issue describes a hard crash on Linux ARM64 with SkiaSharp, indicating reliability concerns.        |\n| Apply Label    | backend/OpenGL           | The issue relates to rendering using SkiaSharp, which involves OpenGL for graphics operations.           |\n| Apply Label    | backend/Vulkan           | The situation pertains to graphics rendering on ARM64 devices, thus relevant for Vulkan usage.          |\n| Apply Label    | area/SkiaSharp.Views.Maui| The issue pertains to a hard crash specifically related to views functionality within SkiaSharp.        |\n| Apply Label    | os/Linux                 | The issue describes a crash that occurs directly on Linux ARM64 systems.                                 |\n\n\u003C/details\u003E\n\n\n\n_This entire triage process was automated by AI and mistakes may have been made. Please let us know so we can continue to improve._",
        "createdAt": "2025-09-11T10:49:11",
        "reactions": [
          {
            "user": "mattleibow",
            "content": "-1",
            "createdAt": "2026-02-06T13:20:10.4787949Z"
          }
        ]
      },
      {
        "id": 3349826731,
        "author": "cody-watkins",
        "body": "This also doesn\u0027t work on Amazon Graviton ARM64 as well for Linux-arm64.",
        "createdAt": "2025-09-30T03:43:37",
        "reactions": []
      }
    ]
  }
}