{
  "number": 3372,
  "type": "issue",
  "state": "open",
  "title": "[FEATURE] Upgrade SkiaSharp.Views.WinUI to 1.8",
  "body": "### Is your feature request related to a problem?\n\nPlease upgrade the WinUI package to reference Microsoft.WindowsAppSDK.WinUI 1.8, so that it no longer relies on the Microsoft.WindowsAppSDK metapackage that\u0027ll force you and any other library that depends on Skia (like .NET MAUI) to pull in the entire metapackage.\n\n### Describe the solution you would like\n\nReduce WinAppSDK dependency to only rely on the WinUI package\n\n### Describe alternatives you have considered\n\n-\n\n### Additional context\n\n_No response_\n\n### Code of Conduct\n\n- [x] I agree to follow this project\u0027s Code of Conduct",
  "author": {
    "login": "dotMorten",
    "type": "User"
  },
  "labels": [
    {
      "name": "area/SkiaSharp.Views",
      "color": "0052cc"
    },
    {
      "name": "type/feature-request",
      "color": "ededed"
    },
    {
      "name": "os/Windows-WinUI",
      "color": "fbca04"
    }
  ],
  "assignees": [],
  "createdAt": "2025-09-18T16:18:13",
  "updatedAt": "2025-09-20T00:18:02",
  "commentCount": 7,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T12:39:44.079213Z",
    "reactions": [],
    "comments": [
      {
        "id": 3308383869,
        "author": "github-actions[bot]",
        "body": "**Triage Summary**  \n\nLabels will be applied to indicate the affected area (SkiaSharp.Views) and the specific operating system (Windows-WinUI) due to a request for upgrading the SkiaSharp.Views.WinUI package.\n\nThis issue is not a regression, but rather a feature request focusing on package updates.\n\nAdditional remarks:\n* The issue does not relate to compatibility, performance, or reliability, which is why no additional relevant labels were selected.\n* The feature request specifically pertains to upgrading a package related to WinUI, which does not align with the backend labels focused on graphics APIs or formats.\n\n\u003Cdetails\u003E\n\u003Csummary\u003EDetailed Summary and Actions\u003C/summary\u003E\n\nSummary of the triage:\n\n- The issue is specifically requesting an upgrade to the SkiaSharp.Views.WinUI package.\n- This upgrade request is relevant to the SkiaSharp.Views area of the project.\n- It also aligns with the Windows-WinUI operating system label.\n\nSummary of the actions that will be performed:\n\n| Action       | Item                  | Description                                                                               |\n| :----------- | :------------------- | :---------------------------------------------------------------------------------------- |\n| Apply Label  | area/SkiaSharp.Views | The issue specifically requests an upgrade to the SkiaSharp.Views.WinUI package.        |\n| Apply Label  | os/Windows-WinUI    | The issue mentions upgrading a WinUI package, aligning with the Windows-WinUI label.   |\n\n\u003C/details\u003E\n\n\n\n_This entire triage process was automated by AI and mistakes may have been made. Please let us know so we can continue to improve._",
        "createdAt": "2025-09-18T16:18:50",
        "reactions": []
      },
      {
        "id": 3308886575,
        "author": "jeromelaban",
        "body": "This kind of change has always strings attached, as it requires all consumers to upgrade to the latest. \n\nIf it\u0027s only for a question of download size, it might not be enough to force everyone to upgrade to 1.8.",
        "createdAt": "2025-09-18T18:07:27",
        "reactions": []
      },
      {
        "id": 3308912070,
        "author": "dotMorten",
        "body": "@jeromelaban then stay on the previous version? Not doing this has the downside effect that you can’t reduce your dependencies down the stack but will forever be required to reference the full meta package. The meta package becomes a viral dependency even though nothing in the stack required anything but the WinUI package.\nIt’s a bit on all us 3rd party library developers to fix the low level dependencies first so higher-level projects can reap the benefits",
        "createdAt": "2025-09-18T18:11:26",
        "reactions": []
      },
      {
        "id": 3309335307,
        "author": "jeromelaban",
        "body": "It is on all of the third-parties to help, but not necessarily on the cost of making using the SkiaSharp more difficult in case an important update comes along. (e.g. 1.8 breaks some maui features with net10-rc1\u002BWebView2).\n\n@mattleibow will determine, but in general, I find it best to keep dependencies as low as possible (unless something breaks badly or improves features significantly), in order to leave the choice of the dependency version to upgrade when required and not be pushed in a dependency management conundrum.",
        "createdAt": "2025-09-18T19:35:42",
        "reactions": []
      },
      {
        "id": 3309637841,
        "author": "dotMorten",
        "body": "\u003E I find it best to keep dependencies as low as possible\n\nI completely agree.\n\n\u003E unless something breaks badly or improves features significantly\n\nWhich is the case here. As you said yourself it\u0027s about choice of dependency, and the current state means your choice is now limited and you\u0027re being forced to pull everything in. In addition, the build errors you get aren\u0027t helpful at all, so I\u0027d like to argue this will actually help with dependencies to some extent.\n\n\u003E 1.8 breaks some maui features with net10-rc1\u002BWebView2\n\n1.8 upgrade is planned for RC2, but it can\u0027t be done right without this.",
        "createdAt": "2025-09-18T20:38:28",
        "reactions": []
      },
      {
        "id": 3312022168,
        "author": "jeromelaban",
        "body": "\u003E Which is the case here. As you said yourself it\u0027s about choice of dependency, and the current state means your choice is now limited and you\u0027re being forced to pull everything in. In addition, the build errors you get aren\u0027t helpful at all, so I\u0027d like to argue this will actually help with dependencies to some extent.\n\nI would think the build errors (and their troubleshooting) are a burden on WinAppSDK to handle and document, not third party libraries that depend on the meta package...\n\n\u003E 1.8 upgrade is planned for RC2, but it can\u0027t be done right without this.\n\nDo you mean that MAUI RC2 can\u0027t happen if SkiaSharp is not updated to avoid using the meta package?",
        "createdAt": "2025-09-19T12:33:00",
        "reactions": []
      },
      {
        "id": 3314271906,
        "author": "dotMorten",
        "body": "\u003E I would think the build errors (and their troubleshooting) are a burden on WinAppSDK to handle and document,\n\nThis has nothing to do with the WinAppSDK, but with how NuGet and metapackages work. The only thing we can blame the WinAppSDK team was how long it took them to split up the packages. Now that it is finally done, it\u0027s on us to take advantage of it, and unblock the rest of the ecosystem to do the same thing.\n\n\u003E Do you mean that MAUI RC2 can\u0027t happen if SkiaSharp is not updated\n\nI mean it can\u0027t happen the right way. You\u0027ll continue to be forcing meta package requirement on anything down-stream. If you move to 1.8, you should stop using the metapackage all-together, but MAUI can\u0027t because other dependencies hasn\u0027t done the same thing. That\u0027s exactly why the dependencies have to do it first and then work your way up the dependency stack.",
        "createdAt": "2025-09-20T00:16:21",
        "reactions": []
      }
    ]
  }
}