{
  "number": 3382,
  "type": "pr",
  "state": "closed",
  "title": "Bump to the next version (3.119.3) after release",
  "body": "**Description of Change**\r\n\r\nJust the version bump after a release banch happens.",
  "author": {
    "login": "mattleibow",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2025-10-10T15:32:43",
  "updatedAt": "2025-10-10T15:33:26",
  "closedAt": "2025-10-10T15:32:52",
  "commentCount": 1,
  "reactionCount": 0,
  "draft": false,
  "merged": true,
  "mergedAt": "2025-10-10T15:32:52",
  "mergeableState": "unknown",
  "baseBranch": "main",
  "headBranch": "dev/new-version",
  "additions": 42,
  "deletions": 42,
  "changedFiles": 2,
  "commits": 1,
  "reviews": [],
  "engagement": {
    "syncedAt": "2026-02-06T12:39:18.0062946Z",
    "reactions": [],
    "comments": [
      {
        "id": 3390800431,
        "author": "github-actions[bot]",
        "body": "**Triage Summary**  \n\nNo labels will be applied as the issue lacks sufficient context to pinpoint any specific area of the project or platform.\n\nThis issue is not a regression; it is merely a version bump that does not relate to compatibility or performance.\n\nAdditional remarks:\n* The issue lacks clarity on the specific areas of the project it affects, such as documentation or technology bindings.\n* There are no operating system or platform specifications provided for the version bump.\n* Since the issue does not correspond to any backend technology or graphical components, no labels apply.\n\n\u003Cdetails\u003E\n\u003Csummary\u003EDetailed Summary and Actions\u003C/summary\u003E\n\nSummary of the triage:\n\n- No context is provided regarding a specific area of the project like documentation, bindings, or platform.\n- The issue does not mention any operating system, making it challenging to assign relevant labels.\n- The focus is solely on a version bump after a release with no implications for compatibility or performance.\n\nSummary of the actions that will be performed:\n\n| Action | Item | Description |\n| :----- | :--- | :---------- |\n| No Action | N/A | The issue does not provide sufficient context or details to apply any labels. |\n\n\u003C/details\u003E\n\n_This entire triage process was automated by AI and mistakes may have been made. Please let us know so we can continue to improve._",
        "createdAt": "2025-10-10T15:33:26",
        "reactions": []
      }
    ]
  }
}