{
  "number": 3383,
  "type": "pr",
  "state": "closed",
  "title": "Use the correct run for the artifacts",
  "body": "**Description of Change**\r\n\r\nUse the correct yml syntax to get the artifacts.",
  "author": {
    "login": "mattleibow",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2025-10-13T17:29:35",
  "updatedAt": "2025-10-13T17:30:59",
  "closedAt": "2025-10-13T17:30:24",
  "commentCount": 2,
  "reactionCount": 0,
  "draft": false,
  "merged": true,
  "mergedAt": "2025-10-13T17:30:24",
  "mergeableState": "unknown",
  "baseBranch": "main",
  "headBranch": "dev/fix-yml",
  "additions": 4,
  "deletions": 0,
  "changedFiles": 1,
  "commits": 1,
  "reviews": [],
  "engagement": {
    "syncedAt": "2026-02-06T12:39:16.6963337Z",
    "reactions": [],
    "comments": [
      {
        "id": 3398457219,
        "author": "github-actions[bot]",
        "body": "**Triage Summary**  \n\nNo labels will be applied as the issue does not fit any of the specified categories, including operating systems, areas of concern, or technology frameworks.\n\nThis issue is not identified as a regression since it does not clearly relate to previous versions or configurations.\n\nAdditional remarks:\n* The issue lacks sufficient context regarding the operating system, making it difficult to apply relevant labels.\n* It appears to be related to build configurations or CI/CD processes, which are not represented in the available labels.\n* There is no mention of compatibility, performance, or reliability, focusing instead on syntax issues that do not align with the provided label options.\n* The absence of specified backend technologies or frameworks also hinders label assignment.\n\n\u003Cdetails\u003E\n\u003Csummary\u003EDetailed Summary and Actions\u003C/summary\u003E\n\nSummary of the triage:\n\n- No specific platform or environment context is provided to apply relevant labels.\n- The issue does not clearly relate to any specific area covered by the existing labels.\n- It focuses on syntax for artifacts, which does not match any available categories.\n- The issue lacks mention of backend technologies or frameworks that could have led to label assignment.\n\nSummary of the actions that will be performed:\n\n| Action   | Item   | Description |\n| :------- | :----- | :---------- |\n| No Action | N/A   | The issue does not provide enough information to warrant any label assignments. |\n\n\u003C/details\u003E\n\n_This entire triage process was automated by AI and mistakes may have been made. Please let us know so we can continue to improve._",
        "createdAt": "2025-10-13T17:30:09",
        "reactions": []
      },
      {
        "id": 3398459326,
        "author": "mattleibow",
        "body": "/backport to release/3.119.2-preview.1",
        "createdAt": "2025-10-13T17:30:59",
        "reactions": []
      }
    ]
  }
}