{
  "number": 3390,
  "type": "issue",
  "state": "closed",
  "title": "[FEATURE] Updated documentation",
  "body": "### Is your feature request related to a problem?\n\nThere are no comprehensive documentations for this project, other then [this](https://mono.github.io/SkiaSharp/index.html), which is still based on an older version with deprecated APIs\n\n### Describe the solution you would like\n\nA clear and concise documentation with plenty of example and proper maintenance.\n\n### Describe alternatives you have considered\n\nDocumentation on microsofts website is a joke and just shows the API, besides its based on version 2.88.X.\n\n### Additional context\n\n_No response_\n\n### Code of Conduct\n\n- [x] I agree to follow this project\u0027s Code of Conduct",
  "author": {
    "login": "r00terAF18",
    "type": "User"
  },
  "labels": [
    {
      "name": "type/feature-request",
      "color": "ededed"
    },
    {
      "name": "area/Docs",
      "color": "0052cc"
    }
  ],
  "assignees": [],
  "createdAt": "2025-10-21T09:06:09",
  "updatedAt": "2026-01-31T15:08:47",
  "closedAt": "2026-01-31T15:08:47",
  "commentCount": 2,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T12:36:44.4905247Z",
    "reactions": [],
    "comments": [
      {
        "id": 3425535114,
        "author": "github-actions[bot]",
        "body": "**Triage Summary**  \n\nThe label indicating documentation improvements (area/Docs) will be applied since the issue requests updated and comprehensive documentation for the project.\n\nThis issue is not a regression as it is a feature request specifically focused on enhancing documentation rather than addressing an existing bug or performance issue.\n\nAdditional remarks:\n* The issue does not align with any specific backend technology labels provided, such as Android, Metal, OpenGL, PDF, Raster, or Vulkan.\n* There are currently no labels dedicated to documentation or feature requests, which makes it challenging to categorize this request appropriately.\n\n\u003Cdetails\u003E\n\u003Csummary\u003EDetailed Summary and Actions\u003C/summary\u003E\n\nSummary of the triage:\n\n- The issue concerns documentation improvements, emphasizing the need for updated and comprehensive materials for the project.\n- The only label to be applied is related to documentation, as no existing labels accommodate feature requests within documentation.\n- The nature of the issue is a feature request, not a regression, meaning it does not involve fixing a previously working feature.\n\nSummary of the actions that will be performed:\n\n| Action      | Item       | Description                                                          |\n| :---------- | :--------- | :------------------------------------------------------------------- |\n| Apply Label | area/Docs  | The issue explicitly relates to documentation and the need for updates. |\n\n\u003C/details\u003E\n\n_This entire triage process was automated by AI and mistakes may have been made. Please let us know so we can continue to improve._",
        "createdAt": "2025-10-21T09:06:50",
        "reactions": []
      },
      {
        "id": 3828688926,
        "author": "mattleibow",
        "body": "Thanks for reporting this. \n\nIt appears we were having issues publishing docs which should now be resolved. \n\nI have updated both the conceptual docs and the API docs to use the latest version of SkiaSharp. \n\n",
        "createdAt": "2026-01-31T15:08:43",
        "reactions": []
      }
    ]
  }
}