{
  "number": 3396,
  "type": "issue",
  "state": "open",
  "title": "[FEATURE] \u003Ctitle\u003ECan\u0027t get it to work on Unity WebGL",
  "body": "### Is your feature request related to a problem?\n\nI have been trying for about 5 hours to get this to work for Unity WebGL. 😭\nI have downloaded the managed SkiaSharp nuget and the Native.Windows and Native.Android and Native.WebAssemebly nugets.\nI have so far got it to run on Windows and Android. 😄\nBut I haven\u0027t been able to get it to run on WebGL. I have tried placing all the different libSkiaSharp.a files in Unity, and tried different versions of Unity 2021.2, 2022.3 etc. \n\n[It should work](https://docs.unity3d.com/6000.2/Documentation/Manual/webgl-native-plugins-with-emscripten.html) according to the Unity docs.\n\nBut it keeps telling me in the Browser console:  DLLNotFound libSkiaSharp.\n\nI am not sure if this is because the managed C# dll is expecting a dynamic linked library instead of a static one(???). Is there something to change here?\n\nHas anyone got this working on Unity for WebGL? This would be great because I want to make programs with vector art that will run both on Standalone, Android and Web-browser, so I just need to get this to work and it will be perfect.\n\nIf anyone can get this to work on Unity, perhaps they can upload a sample Unity project to github? That would be fantastic.\n\n\n\n\n\n\n### Describe the solution you would like\n\na sample unity project working in Unity WebGL.\n\n### Describe alternatives you have considered\n\neverything possible.\n\n### Additional context\n\n_No response_\n\n### Code of Conduct\n\n- [x] I agree to follow this project\u0027s Code of Conduct",
  "author": {
    "login": "elephantpanda",
    "type": "User"
  },
  "labels": [
    {
      "name": "type/feature-request",
      "color": "ededed"
    },
    {
      "name": "os/WASM",
      "color": "fbca04"
    },
    {
      "name": "area/SkiaSharp.Views.Uno",
      "color": "0052cc"
    }
  ],
  "assignees": [],
  "createdAt": "2025-10-26T03:03:29",
  "updatedAt": "2025-10-26T03:04:04",
  "commentCount": 1,
  "reactionCount": 0
}