{
  "number": 3402,
  "type": "issue",
  "state": "open",
  "title": "[FEATURE] Drawing to and from compressed indexed color bitmaps",
  "body": "### Is your feature request related to a problem?\n\nI am using avalonia ui which uses this and I wanted to make a nes/snes graphics system in avalonia ui.\n\nProblem is I have tried doing this multiple times and I just don\u0027t have the experience to do it. \n\nThe reason I want to do this is so I can store graphics into a binary file and minimize size.\nI want to have a 8 * 8 * 32 * 30 * 65536 pixels which in 4bpp color would be 1.87 GiB if the entire binary is filled. According to google this would take 15 GiB with 32bpp color if the entire binary is filled.\n\n### Describe the solution you would like\n\nPlease support drawing to and from compressed 1bpp 2bpp and 4bpp indexed color graphics\n\n### Describe alternatives you have considered\n\n- Writing my own blitter.\n- Looking for image libraries that do this\n\n### Additional context\n\nPixel operations should work on multiple pixels at a time with these formats without expanding them in memory.\n\nThe only time these compressed formats should be uncompressed is to convert them into a higher bpp format.\n\nOf course it should not allocate more then the target pixel format.\n\n### Code of Conduct\n\n- [x] I agree to follow this project\u0027s Code of Conduct",
  "author": {
    "login": "Shadowblitz16",
    "type": "User"
  },
  "labels": [
    {
      "name": "type/feature-request",
      "color": "ededed"
    }
  ],
  "assignees": [],
  "createdAt": "2025-11-03T15:09:26",
  "updatedAt": "2025-11-03T15:10:12",
  "commentCount": 1,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T12:38:58.6637236Z",
    "reactions": [],
    "comments": [
      {
        "id": 3481035464,
        "author": "github-actions[bot]",
        "body": "**Triage Summary**  \n\nNo labels will be applied since the issue pertains to a feature request related to drawing graphics using the Avalonia UI framework, which does not have applicable labels within the existing context.\n\nThis issue is not a regression, as it simply requests new functionality rather than addressing any previously functioning feature.\n\n\u003Cdetails\u003E\n\u003Csummary\u003EDetailed Summary and Actions\u003C/summary\u003E\n\nSummary of the triage:\n\n- The issue discusses a feature request for drawing with different compressed indexed color formats in the Avalonia UI framework.\n- There are no available labels for feature requests or specific UI drawing enhancements related to Avalonia or SkiaSharp.\n- The issue does not specify any matching operating system or platform context.\n- Since the issue deals with a request for new functionality rather than a compatibility, performance, or reliability issue, no appropriate labels can be assigned.\n\nSummary of the actions that will be performed:\n\n| Action  | Item | Description |\n| :------ | :--- | :---------- |\n| No Action | - | The issue does not have applicable labels for assignment. |\n\n\u003C/details\u003E\n\nAdditional remarks:\n* The request for handling compressed indexed colors highlights the need for clearer labeling for feature requests within the framework.\n\n_This entire triage process was automated by AI and mistakes may have been made. Please let us know so we can continue to improve._",
        "createdAt": "2025-11-03T15:10:12",
        "reactions": []
      }
    ]
  }
}