{
  "number": 3404,
  "type": "pr",
  "state": "closed",
  "title": "Enable BufferSecurityCheck for native DLLs to resolve BinSkim BA2007",
  "body": "This change enables the /GS (Buffer Security Check) compiler flag for three native libraries to resolve BinSkim error BA2007:\r\n\r\n- libHarfBuzzSharp.dll: Added BufferSecurityCheck=true to all configurations in the vcxproj file, including creating the missing Debug|ARM64 ItemDefinitionGroup\r\n- libEGL.dll and libGLESv2.dll: Added /GS flag to extra_cflags in the ANGLE GN build configuration\r\n\r\nThe /GS flag enables compile-time buffer overrun detection, which is an important security feature that helps prevent stack-based buffer overflow attacks.\r\n\r\n## Why\r\n\r\nThe \u0060/GS\u0060 flag enables compile-time buffer overrun detection, which is an important security feature that helps prevent stack-based buffer overflow attacks. This resolves the BinSkim BA2007 security compliance error.\r\n\r\n## Testing\r\n\r\nAfter rebuilding the native libraries with these changes, they should pass BinSkim analysis for the BA2007 check.\r\n\r\n**Bugs Fixed**\r\n\r\n- Fixes ~20 BinSkim bugs in AzDO. \r\n- \r\n**API Changes**\r\n\r\nNone.\r\n\r\n\r\n**Behavioral Changes**\r\n\r\nNone.\r\n\r\n**Required skia PR**\r\n\r\nNone.\r\n\r\n**PR Checklist**\r\n\r\n- [ ] Has tests (if omitted, state reason in description)\r\n- [ ] Rebased on top of main at time of PR\r\n- [ ] Merged related skia PRs\r\n- [ ] Changes adhere to coding standard\r\n- [ ] Updated documentation\r\n",
  "author": {
    "login": "Aguilex",
    "type": "User"
  },
  "labels": [
    {
      "name": "os/Windows-Classic",
      "color": "fbca04"
    },
    {
      "name": "os/Windows-Universal-UWP",
      "color": "fbca04"
    },
    {
      "name": "area/libHarfBuzzSharp.native",
      "color": "0052cc"
    }
  ],
  "assignees": [],
  "createdAt": "2025-11-04T14:44:53",
  "updatedAt": "2025-11-04T17:19:41",
  "closedAt": "2025-11-04T17:19:38",
  "commentCount": 2,
  "reactionCount": 0,
  "draft": false,
  "merged": true,
  "mergedAt": "2025-11-04T17:19:38",
  "mergeableState": "unknown",
  "baseBranch": "main",
  "headBranch": "fix/binskim-ba2007-buffer-security-check",
  "additions": 7,
  "deletions": 1,
  "changedFiles": 2,
  "commits": 2,
  "reviews": [
    {
      "author": "mattleibow",
      "state": "COMMENTED",
      "submittedAt": "2025-11-04T14:57:56"
    },
    {
      "author": "mattleibow",
      "state": "APPROVED",
      "submittedAt": "2025-11-04T15:13:11"
    }
  ],
  "engagement": {
    "syncedAt": "2026-02-06T12:38:56.4776059Z",
    "reactions": [],
    "comments": [
      {
        "id": 3486356563,
        "author": "github-actions[bot]",
        "body": "**Triage Summary**  \n\nLabels will be applied to indicate the affected areas related to security compliance in \u0060libHarfBuzzSharp\u0060 and the platforms involved (Windows Classic and Windows UWP).\n\nThis issue does not appear to be a regression, as there are no mentions of compatibility issues with previous versions or performance degradation.\n\n\u003Cdetails\u003E\n\u003Csummary\u003EDetailed Summary and Actions\u003C/summary\u003E\n\nSummary of the triage:\n\n- The issue pertains to enabling a compiler flag for the native DLL related to \u0060libHarfBuzzSharp\u0060, addressing a security compliance error.\n- It affects applications running on Microsoft Windows using Win32 APIs and also impacts Universal Windows Platform (UWP) applications.\n- The focus is primarily on security and compliance; however, the available labels pertain to performance, compatibility, and reliability, which are not directly aligned with the issue\u0027s primary concern.\n\nSummary of the actions that will be performed:\n\n| Action      | Item                             | Description                                                                                              |\n| :---------- | :------------------------------- | :------------------------------------------------------------------------------------------------------- |\n| Apply Label | area/libHarfBuzzSharp.native    | The issue pertains to enabling a compiler flag for the native DLL related to \u0027libHarfBuzzSharp\u0027.       |\n| Apply Label | os/Windows-Classic              | The issue involves native DLLs relevant for applications running on Microsoft Windows using Win32 APIs. |\n| Apply Label | os/Windows-Universal-UWP        | The change affects UWP applications on Windows due to the enablement of a compiler flag for native libraries. |\n\n\u003C/details\u003E\n\nAdditional remarks:\n* The focus on security and compliance regarding buffer overrun detection does not directly align with the available labels related to performance and compatibility.\n* There were no significant concerns raised about compatibility with previous versions or any performance issues reported.\n\n_This entire triage process was automated by AI and mistakes may have been made. Please let us know so we can continue to improve._",
        "createdAt": "2025-11-04T14:45:35",
        "reactions": []
      },
      {
        "id": 3486410440,
        "author": "Copilot",
        "body": "@mattleibow I\u0027ve opened a new pull request, #3405, to work on those changes. Once the pull request is ready, I\u0027ll request review from you.",
        "createdAt": "2025-11-04T14:58:07",
        "reactions": []
      }
    ]
  }
}