{
  "number": 3459,
  "type": "pr",
  "state": "closed",
  "title": "Update SkiaSharp package source URL in nuget.config",
  "body": "This pull request updates the NuGet package source for SkiaSharp previews in the test project configuration. The new source points to the official Azure DevOps feed instead of the previous preview endpoint. This ensures that package resolution uses the most current and supported location.",
  "author": {
    "login": "mattleibow",
    "type": "User"
  },
  "labels": [
    {
      "name": "area/SkiaSharp",
      "color": "0052cc"
    },
    {
      "name": "backend/SkiaSharp",
      "color": "ededed"
    }
  ],
  "assignees": [],
  "createdAt": "2026-01-27T16:09:30",
  "updatedAt": "2026-01-27T16:15:47",
  "closedAt": "2026-01-27T16:09:39",
  "commentCount": 1,
  "reactionCount": 0,
  "draft": false,
  "merged": true,
  "mergedAt": "2026-01-27T16:09:39",
  "mergeableState": "unknown",
  "baseBranch": "main",
  "headBranch": "mattleibow-patch-2",
  "additions": 1,
  "deletions": 1,
  "changedFiles": 1,
  "commits": 1,
  "reviews": [],
  "engagement": {
    "syncedAt": "2026-02-06T12:37:11.8326103Z",
    "reactions": [],
    "comments": [
      {
        "id": 3806085691,
        "author": "github-actions[bot]",
        "body": "**Triage Summary**  \n\nLabels will be applied to indicate the area of the issue (SkiaSharp) and the specific aspect concerning the backend integration related to the SkiaSharp package.\n\nThis issue does not appear to be a regression as it pertains to updating a package source, rather than indicating a failure of previously working functionality.\n\nAdditional remarks:\n* There are no relevant labels matching the content of the issue regarding compatibility, performance, or reliability.\n* The issue does not relate to a specific operating system, focusing instead on configuration updates in a package source.\n\n\u003Cdetails\u003E\n\u003Csummary\u003EDetailed Summary and Actions\u003C/summary\u003E\n\nSummary of the triage:\n\n- The issue affects the backend integration of the SkiaSharp package within the project.\n- The issue specifically involves updating the NuGet package source for SkiaSharp and its configuration.\n- This does not indicate any regression since it is related to updating a package source rather than restoring previous functionality.\n\nSummary of the actions that will be performed:\n\n| Action       | Item                | Description                                                                                     |\n| :----------- | :------------------ | :---------------------------------------------------------------------------------------------- |\n| Apply Label  | backend/SkiaSharp   | The issue pertains to updating the SkiaSharp package source in the configuration.              |\n| Apply Label  | area/SkiaSharp      | The issue indicates that it relates directly to the C# binding of SkiaSharp through a package source update. |\n\n\u003C/details\u003E\n\n_This entire triage process was automated by AI and mistakes may have been made. Please let us know so we can continue to improve._",
        "createdAt": "2026-01-27T16:10:13",
        "reactions": []
      }
    ]
  }
}