{
  "number": 3486,
  "type": "pr",
  "state": "closed",
  "title": "Use the new CI feed to download the pre-built artifacts",
  "body": "This pull request updates the NuGet package feed URL used for downloading and comparing packages from the preview feed to the CI artifacts feed. The change ensures that the build and utility scripts now reference the CI feed instead of the previous preview feed.\r\n\r\nFeed URL update:\r\n\r\n* Updated the variable from \u0060PREVIEW_FEED_URL\u0060 to \u0060CI_ARTIFACTS_FEED_URL\u0060 in \u0060build.cake\u0060 and changed its default value to point to the SkiaSharp CI artifacts NuGet feed.\r\n* Updated all references in \u0060scripts/cake/UtilsManaged.cake\u0060 to use \u0060CI_ARTIFACTS_FEED_URL\u0060 instead of \u0060PREVIEW_FEED_URL\u0060 for package source and comparison operations.",
  "author": {
    "login": "mattleibow",
    "type": "User"
  },
  "labels": [
    {
      "name": "area/Build",
      "color": "0052cc"
    },
    {
      "name": "backend/SkiaSharp",
      "color": "ededed"
    }
  ],
  "assignees": [],
  "createdAt": "2026-02-01T18:31:40",
  "updatedAt": "2026-02-01T18:32:26",
  "closedAt": "2026-02-01T18:32:25",
  "commentCount": 1,
  "reactionCount": 0,
  "draft": false,
  "merged": true,
  "mergedAt": "2026-02-01T18:32:25",
  "mergeableState": "unknown",
  "baseBranch": "main",
  "headBranch": "dev/feeds",
  "additions": 3,
  "deletions": 3,
  "changedFiles": 2,
  "commits": 1,
  "reviews": [],
  "engagement": {
    "syncedAt": "2026-02-06T12:36:28.0006848Z",
    "reactions": [],
    "comments": [
      {
        "id": 3831722607,
        "author": "github-actions[bot]",
        "body": "**Triage Summary**  \n\nLabels will be applied to indicate the affected backend (SkiaSharp) and the specific area of the issue (Build process).\n\nThis issue is not a regression, as it focuses on updates to the NuGet package feed without affecting compatibility with previous versions.\n\nAdditional remarks:\n* The issue mainly addresses the process of updating the NuGet package feed URL and references in build scripts. There are no concerns related to compatibility or performance, and no operating system-specific labels were applicable.\n\n\u003Cdetails\u003E\n\u003Csummary\u003EDetailed Summary and Actions\u003C/summary\u003E\n\nSummary of the triage:\n\n- The issue involves updates to the NuGet package feed for the SkiaSharp CI artifacts.\n- It pertains to the Build process, specifically regarding the adjustment of build scripts to reference CI artifacts.\n- There are no regression concerns, as it does not relate to previous version compatibility.\n\nSummary of the actions that will be performed:\n\n| Action       | Item                  | Description                                                                                       |\n|:-------------|:----------------------|:--------------------------------------------------------------------------------------------------|\n| Apply Label  | backend/SkiaSharp      | The issue specifically mentions updating the NuGet package feed for SkiaSharp CI artifacts.      |\n| Apply Label  | area/Build            | The issue pertains to changes in the build process related to the NuGet package feed references. |\n\n\u003C/details\u003E\n\n_This entire triage process was automated by AI and mistakes may have been made. Please let us know so we can continue to improve._",
        "createdAt": "2026-02-01T18:32:13",
        "reactions": []
      }
    ]
  }
}