{
  "number": 3504,
  "type": "pr",
  "state": "closed",
  "title": "Add semver ordering guidance to release skills",
  "body": "Prevents selecting the wrong release branch when both preview and stable branches exist (e.g., picking \u00603.119.2-preview.3\u0060 instead of \u00603.119.2\u0060).\n\nIn semver, bare versions are always newer than prerelease variants: \u00603.119.2\u0060 \u003E \u00603.119.2-preview.3\u0060.\n\n### Changes\n- **release-testing**: Added critical section before Step 1 with step-by-step process to find the correct branch\n- **release-branch**: Added semver check in auto-detect and ordering warning in Step 2\n- **release-publish**: Added semver ordering subsection in Step 1",
  "author": {
    "login": "mattleibow",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2026-02-06T13:36:57",
  "updatedAt": "2026-02-06T13:37:36",
  "closedAt": "2026-02-06T13:37:33",
  "commentCount": 1,
  "reactionCount": 0,
  "draft": false,
  "merged": true,
  "mergedAt": "2026-02-06T13:37:33",
  "mergeableState": "unknown",
  "baseBranch": "main",
  "headBranch": "dev/fix-semver-ordering-in-release-skills",
  "additions": 36,
  "deletions": 1,
  "changedFiles": 3,
  "commits": 1,
  "reviews": [],
  "engagement": {
    "syncedAt": "2026-02-08T18:51:07.8935703Z",
    "reactions": [],
    "comments": [
      {
        "id": 3860520709,
        "author": "github-actions[bot]",
        "body": "**Triage Summary**  \n\nNo labels will be applied as the issue does not relate to any specific operating system, platform, or backend technology.\n\nThis issue is not a regression and does not indicate any compatibility or performance concerns.\n\nAdditional remarks:\n* The issue relates to improvements in release branch management linked to semantic versioning, but lacks the necessary context to assign relevant labels such as documentation or build areas.\n\n\u003Cdetails\u003E\n\u003Csummary\u003EDetailed Summary and Actions\u003C/summary\u003E\n\nSummary of the triage:\n\n- No specific platform or operating system labels can be assigned as the issue does not mention any.\n- The issue does not point to any compatibility, performance, or reliability problems, and therefore does not warrant a regression label.\n- There are no backend technology or rendering framework references in the issue content for meaningful label application.\n- The main focus of the issue is on release branch management improvements related to semver, but does not link directly to existing documentation labels.\n\nSummary of the actions that will be performed:\n\n| Action      | Item            | Description                                                |\n| :---------- | :-------------- | :--------------------------------------------------------- |\n| No Action   | N/A             | No labels can be applied as the issue lacks necessary details and context. |\n\n\u003C/details\u003E\n\n\n\n_This entire triage process was automated by AI and mistakes may have been made. Please let us know so we can continue to improve._",
        "createdAt": "2026-02-06T13:37:31",
        "reactions": []
      }
    ]
  }
}