{
  "number": 3505,
  "type": "pr",
  "state": "closed",
  "title": "Fix stable version handling in release skills",
  "body": "Update all 3 release skills to correctly document stable version numbering.\n\n**Problem:** The release skills assumed all NuGet versions include a build number suffix. For stable releases, the NuGet version is just the base (e.g., \u00603.119.2\u0060) — the build number only appears in the internal feed\u0027s prerelease tag (\u00603.119.2-stable.3\u0060).\n\n**Changes:**\n- **release-testing:** Split version resolution (Step 2) into preview vs stable paths; added stable examples for CI version extraction and user reporting\n- **release-publish:** Added NuGet version row to Preview vs Stable differences table; split version confirmation into preview vs stable formats with separate verification commands\n- **release-branch:** Added NuGet version format note after the release type table",
  "author": {
    "login": "mattleibow",
    "type": "User"
  },
  "labels": [
    {
      "name": "area/Docs",
      "color": "0052cc"
    }
  ],
  "assignees": [],
  "createdAt": "2026-02-06T13:50:37",
  "updatedAt": "2026-02-06T13:51:38",
  "closedAt": "2026-02-06T13:51:35",
  "commentCount": 1,
  "reactionCount": 0,
  "draft": false,
  "merged": true,
  "mergedAt": "2026-02-06T13:51:35",
  "mergeableState": "unknown",
  "baseBranch": "main",
  "headBranch": "dev/fix-stable-version-docs",
  "additions": 54,
  "deletions": 10,
  "changedFiles": 3,
  "commits": 1,
  "reviews": [],
  "engagement": {
    "syncedAt": "2026-02-08T18:51:07.0007259Z",
    "reactions": [],
    "comments": [
      {
        "id": 3860606618,
        "author": "github-actions[bot]",
        "body": "**Triage Summary**  \n\nLabels will be applied to denote the area of focus, specifically regarding documentation for stable version numbering related to release skills.\n\nThis issue is not a regression, as it does not pertain to performance or reliability concerns with previous versions.\n\nAdditional remarks:\n* The issue focuses on improving documentation and version handling but lacks details about specific operating systems or technologies that would warrant further labeling. \n* The current focus is solely on enhancing clarity within the documentation for stable releases.\n\n\u003Cdetails\u003E\n\u003Csummary\u003EDetailed Summary and Actions\u003C/summary\u003E\n\nSummary of the triage:\n\n- The issue pertains to documenting stable version numbering for release skills.\n- The focus is on improving clarity within the documentation rather than addressing performance or compatibility issues.\n- No specific operating systems or technologies are identified, which limits the applicability of additional labels.\n\nSummary of the actions that will be performed:\n\n| Action      | Item        | Description                                                                           |\n| :---------- | :---------- | :------------------------------------------------------------------------------------ |\n| Apply Label | area/Docs   | The issue pertains to updating documentation related to stable version numbering for release skills in a clear manner. |\n\n\u003C/details\u003E\n\n_This entire triage process was automated by AI and mistakes may have been made. Please let us know so we can continue to improve._",
        "createdAt": "2026-02-06T13:51:18",
        "reactions": []
      }
    ]
  }
}