{
  "number": 3513,
  "type": "pr",
  "state": "closed",
  "title": "Add Triage AI Skill",
  "body": "This pull request introduces a new skill for automated triage of GitHub issues in SkiaSharp, along with supporting documentation and references. The main changes include the addition of the \u0060triage-issue\u0060 skill, updated instructions and triggers for triage actions, and comprehensive references for label taxonomy, research methodology, response guidelines, and domain-specific troubleshooting patterns.\r\n\r\n**New triage skill and workflow:**\r\n\r\n* Added \u0060.github/skills/triage-issue/SKILL.md\u0060 describing the \u0060triage-issue\u0060 skill, including a detailed multi-phase workflow for classifying issues, generating structured JSON, searching for workarounds, validating proposals, and persisting results.\r\n* Updated \u0060.github/copilot-instructions.md\u0060 to include new triggers and task mapping for triage actions, and clarified skill assignment for issues mentioning triage, classification, or analysis. [[1]](diffhunk://#diff-227c2c26cb2ee0ce0f46a320fc48fbcbdf21801a57f59161b1d0861e8aad55f5R355) [[2]](diffhunk://#diff-227c2c26cb2ee0ce0f46a320fc48fbcbdf21801a57f59161b1d0861e8aad55f5R379)\r\n\r\n**Supporting references and documentation:**\r\n\r\n* Added \u0060.github/skills/triage-issue/references/labels.md\u0060 outlining the label taxonomy, cardinality rules, and tips for accurate classification.\r\n* Added \u0060.github/skills/triage-issue/references/research-by-type.md\u0060 providing research guidance for each issue type, including shared steps, bug investigation, question answering, feature evaluation, and documentation drafting.\r\n* Added \u0060.github/skills/triage-issue/references/response-guidelines.md\u0060 specifying tone, structure, and examples for automated responses, especially when recommending workarounds or requesting more information.\r\n* Added \u0060.github/skills/triage-issue/references/skia-patterns.md\u0060 capturing domain-specific heuristics, platform quirks, and common traps for SkiaSharp troubleshooting.\r\n\r\n**Documentation enhancements:**\r\n\r\n* Updated \u0060.github/copilot-instructions.md\u0060 to reference new documentation for NuGet packages and native loading troubleshooting.\r\n\r\nThese changes collectively enable structured, automatable triage of SkiaSharp issues, improve classification accuracy, and provide actionable guidance for both maintainers and contributors.",
  "author": {
    "login": "mattleibow",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2026-02-11T10:42:31",
  "updatedAt": "2026-02-11T10:42:42",
  "closedAt": "2026-02-11T10:42:40",
  "commentCount": 0,
  "reactionCount": 0,
  "draft": false,
  "merged": true,
  "mergedAt": "2026-02-11T10:42:40",
  "mergeableState": "unknown",
  "baseBranch": "main",
  "headBranch": "skills/triage-issue",
  "additions": 3895,
  "deletions": 48,
  "changedFiles": 16,
  "commits": 15,
  "reviews": []
}