{
  "number": 53,
  "type": "issue",
  "state": "closed",
  "title": "Having problem cloning repro in Visual Studio 2015 Update 2",
  "body": "I\u0027m getting this message when trying to clone the repro:\n    \u0022The repository was cloned, but an error was encountered while recursively cloning submodules.     Error message: The top level repository was cloned, but there was an error cloning its submodules.\u0022\n\nI don\u0027t have issues with other repros and github.\n\nThanks!\n",
  "author": {
    "login": "alanricker",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2016-04-01T21:21:19",
  "updatedAt": "2022-08-20T06:01:41",
  "closedAt": "2016-04-07T15:03:30",
  "commentCount": 7,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T13:51:45.764024Z",
    "reactions": [],
    "comments": [
      {
        "id": 206943618,
        "author": "migueldeicaza",
        "body": "Not a bug in SkiaSharp, we will keep an eye though.\n",
        "createdAt": "2016-04-07T15:03:30",
        "reactions": []
      },
      {
        "id": 356444278,
        "author": "Jaytt",
        "body": "How to solve this?",
        "createdAt": "2018-01-09T23:08:57",
        "reactions": []
      },
      {
        "id": 357314419,
        "author": "mattleibow",
        "body": "I think this was maybe a error in the git clone? Delete the folder and try again or just delete the externals directory and revert and re update...",
        "createdAt": "2018-01-12T18:17:06",
        "reactions": []
      },
      {
        "id": 362383094,
        "author": "emanolio",
        "body": "This is also happening to me. I have Visual Studio 2015 Update 3. I deleted the clone multiple times and I still get this error. I installed Git for Windows and was able to clone the repository just fine. I\u0027d rather use Visual Studio.",
        "createdAt": "2018-02-01T19:55:43",
        "reactions": []
      },
      {
        "id": 362621828,
        "author": "mattleibow",
        "body": "I haven\u0027t tested VS2015 yet, but VS2017 works fine for me. Maybe you had a connection hiccup.\r\nAlso, I just want to mention that the new master no longer supports VS2015 - we are working on VS2017.",
        "createdAt": "2018-02-02T15:44:25",
        "reactions": []
      },
      {
        "id": 380062368,
        "author": "redwhat",
        "body": "@mattleibow What do you mean by \u0022the new master no longer supports VS2015\u0022?",
        "createdAt": "2018-04-10T11:13:16",
        "reactions": []
      },
      {
        "id": 380283854,
        "author": "mattleibow",
        "body": "Just that I haven\u0027t done any testing in VS2015 - we are moving on to VS2017 and not looking back! The chances are that things will still work, just that I am no longer doing any testing there and I may/may not fix any issues with VS2015. If you really need things to work in VS2015, you probably will have to send in a PR that fixes it yourself.",
        "createdAt": "2018-04-10T23:58:00",
        "reactions": []
      }
    ]
  }
}