{
  "number": 619,
  "type": "issue",
  "state": "closed",
  "title": "Troubles rendering a live video feed",
  "body": "I\u0027m using SkiaSharp on a Linux/Gtk platform, .NET core 2.1 (and this Gtk binding: https://github.com/gtksharp/gtksharp).\r\n\r\nAt the moment, I\u0027m trying to render a live video feed inside of an \u0060SkWidget\u0060.  At first (to test things out), I was getting my video source when \u0060SkWidget.PaintSurface\u0060 was invoked.  Therefore it was running in the Gtk GUI thread (which is a bad idea), and it worked.  It was able to render video in realtime and retrieve it from the source.\r\n\r\nThe only problem with this was that the video source was from a USB, therefore it was quite slow, and would make the Gtk UI much less responsive (since capture was happing in the GUI thread).\r\n\r\nI tried moving the capture over to a \u0060System.Timers.Timer\u0060 callback, and added in all of the necessary locks/syncing.  This would work for about 10-15 seconds (GUI was response, \u0060SkWiget\u0060 was showing a live feed), the GUI would then freeze up.  I tried using various things, such as Double-Buffered \u0060SkBitmap\u0060s, standard locks, Spin Locks, Reader-Writer locks, etc.\r\n\r\nI\u0027m wondering if there is a proper/recommended way of rendering video w/ Skia.  Is there?",
  "author": {
    "login": "define-private-public",
    "type": "User"
  },
  "labels": [
    {
      "name": "type/question",
      "color": "daffa8"
    },
    {
      "name": "status/needs-info",
      "color": "B8EC4A"
    }
  ],
  "assignees": [],
  "createdAt": "2018-08-18T18:42:43",
  "updatedAt": "2022-08-19T15:01:44",
  "closedAt": "2018-12-01T05:16:48",
  "commentCount": 2,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T14:04:03.7633141Z",
    "reactions": [],
    "comments": [
      {
        "id": 443383184,
        "author": "mattleibow",
        "body": "Rendering video should be possible, although this question may be better suited to the forums (https://forums.xamarin.com) or SO.\r\n\r\nIt all really depends on how the video comes in and how you are storing it in memory. I am not sure what you have, but you could potentially have 2 bitmaps. every time you get a frame, draw it to one bitmap. and render the second. then, when the bitmap is finished reading, swap them out. - you could also use a background thread for the stream/copy",
        "createdAt": "2018-12-01T00:51:25",
        "reactions": []
      },
      {
        "id": 443400808,
        "author": "define-private-public",
        "body": "Hi,\r\n\r\nThis might have been an issue with how I was getting my video feed (back when I posted the question).  The method is different now and it\u0027s working MUCH better now.  I think it\u0027s fine to close this for now.",
        "createdAt": "2018-12-01T05:16:48",
        "reactions": []
      }
    ]
  }
}