{
  "number": 636,
  "type": "issue",
  "state": "closed",
  "title": "Skia Version 70",
  "body": "Hey, when will SkiaSharp upgrade to Skia version 70?\r\n\r\nCurrently SkiaSharp is using skia version 60 which was released around July 2017 (more than a year ago). There has been lots of improvements made in the last ten versions.\r\n\r\nSkia version 71 will be released in few weeks: https://skia.org/schedule",
  "author": {
    "login": "john2014",
    "type": "User"
  },
  "labels": [
    {
      "name": "type/question",
      "color": "daffa8"
    }
  ],
  "assignees": [],
  "createdAt": "2018-09-13T18:07:43",
  "updatedAt": "2022-08-19T15:01:31",
  "closedAt": "2018-09-14T11:50:27",
  "commentCount": 2,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T14:04:25.6653126Z",
    "reactions": [],
    "comments": [
      {
        "id": 421334778,
        "author": "mattleibow",
        "body": "We are currently working on getting a new 68 release out very soon. This is currently in the [\u0060development\u0060 branch](https://github.com/mono/SkiaSharp/tree/development).\r\n\r\nEven though Google releases a \u0022stable\u0022 release, we have found that it is not usually not up the the \u0022stable\u0022 standard that we would like. It will often recieve changes multiple times a week. As a result, we have decided to follow the slightly slower release of the Chrome release.\r\n\r\nSkia is released at an \u0022alpha\u0022 level and used by the preview builds of Chrome. We found that following behind by 3 releases results in a much more stable product. We are working with Google, so any critical bugfixes have been merged back far enough.\r\n\r\nAs of this comment, m70 has been released, that means we want to release m68 as the latest.\r\n\r\nWe have switched to an improved CI system, so we are working on getting a new \u0022nightly\u0022 build out so that you can follow the updates as they come.",
        "createdAt": "2018-09-14T11:50:26",
        "reactions": []
      },
      {
        "id": 421439480,
        "author": "john2014",
        "body": "Thank you for the detailed explanation. It was very helpful. One quick thing I noticed is that the development tree says that it is at version 67 (instead of 68). This is bottom of the page in this link:\r\n\r\nhttps://github.com/mono/SkiaSharp/tree/development\r\n\r\nAlso I would highly recommend mentioning this (why you are three versions behind skia) in the readme page. I am sure everyone will find it very helpful.",
        "createdAt": "2018-09-14T18:06:02",
        "reactions": [
          {
            "user": "mattleibow",
            "content": "\u002B1",
            "createdAt": "2026-02-06T14:04:25.6156091Z"
          }
        ]
      }
    ]
  }
}