{
  "number": 65,
  "type": "issue",
  "state": "closed",
  "title": "Support for more functionality in Typeface",
  "body": "I need to get the real typeface used by the SKTypeface when you create it, if font substitution happens.\n\nFrom what I see in the Skia C\u002B\u002B docs, I would need to expose the method:\n\n\u0060void SkTypeface::getFamilyName (SkString *     name)   const\u0060\n\nI think it could be added as a method GetFamilyName() in the SKTypeface C# type. It could also be a property FamilyName, but I am not sure about the performance implications if we don\u0027t cache the family name and call getFamilyName each time you call the property.\n\nI would also need to expose a method GetTables() and GetTableTags() which would be wrappers around SKTypeface::getTableTags and SKTypeface::getTableData. \n\nAs none of those methods are in the C wrappers, I would have to also modify the C headers.\n\nIs it ok if I add those methods and make a pull request, or maybe someone else is working on this already?  If I add them myself, I assume I would have to add some tests too, but what about docs?  I don\u0027t see xmldocs used in the binding SKTypeface.cs, so I think you are using a different tool for the docs?\n",
  "author": {
    "login": "agallero",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2016-04-18T01:34:05",
  "updatedAt": "2022-08-20T06:01:33",
  "closedAt": "2016-04-20T15:57:57",
  "commentCount": 2,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T13:51:57.688818Z",
    "reactions": [],
    "comments": [
      {
        "id": 212480608,
        "author": "mattleibow",
        "body": "Hi @agallero, thanks for you interest. Go ahead and make the changes and we can review and merge them.\nI don\u0027t think anyone is working on them right now, so it\u0027s all yours. You can add the C methods and then add the C# wrappers. You can make use of the C# tests (https://github.com/mono/SkiaSharp/tree/master/tests) for any tests, without having to write C tests. To do the docs, there are two ways:\n- \u0060./bootstrapper.sh -t docs\u0060\n- \u0060make update-docs\u0060\n\nYou can the go ahead and write the docs in the xml files\n",
        "createdAt": "2016-04-20T15:35:37",
        "reactions": []
      },
      {
        "id": 212489126,
        "author": "agallero",
        "body": "Thanks!  I had already began looking at it, and I have some questions about how skiasharp is handling the strings, but probably it is better that I ask about that in a different thread.\n",
        "createdAt": "2016-04-20T15:57:57",
        "reactions": []
      },
      {
        "id": 212513704,
        "author": "mattleibow",
        "body": "@agallero Here are some examples of working with text:\nhttps://github.com/mono/SkiaSharp/blob/master/binding/Binding/SkiaApi.cs#L125-L136\nhttps://github.com/mono/SkiaSharp/blob/master/binding/Binding/SKCanvas.cs#L243-L252\nhttps://github.com/mono/SkiaSharp/blob/master/binding/Binding/Util.cs\n",
        "createdAt": "2016-04-20T16:57:24",
        "reactions": []
      },
      {
        "id": 212530742,
        "author": "agallero",
        "body": "Thanks, but I was thinking actually in methods returning strings, not methods taking strings as parameters.When returning strings the memory has to be allocated in the C side but freed in the .NET side. \n\nI\u0027ve opened another issue with it, and as mentioned there, the only examples I could get of C methods returning strings didn\u0027t seem to work.\n\nThanks for the time to dig the links, and sorry I wasn\u0027t too clear in the previous post about what I referred to.\n",
        "createdAt": "2016-04-20T17:41:12",
        "reactions": []
      }
    ]
  }
}