{
  "number": 67,
  "type": "issue",
  "state": "closed",
  "title": "Handling return strings from C",
  "body": "Hi,\nTrying to implement a method that returns a string, I wonder if there is any \u0022standard\u0022 for skia/skiasharp in how to do it. \n\nI looked at what is already implemented, but the only methods that return strings seem to be:\n\n\u0060\u0060\u0060 c\nconst char* sk_imagedecoder_get_format_name_from_format (sk_imagedecoder_format_t cformat);\nconst char* sk_imagedecoder_get_format_name_from_decoder (sk_imagedecoder_t* cdecoder);\n\u0060\u0060\u0060\n\nAnd they don\u0027t seem to work fine. They aren\u0027t either in the \u0022official\u0022 skia distribution yet ( https://github.com/google/skia/tree/master/include/c )\n\nThe main issue is with memory management. For example, sk_imagedecoder_get_format_name_from_decoder returns a char\\* which is generated here:\n\n\u0060\u0060\u0060 c\u002B\u002B\nconst char* SkImageDecoder::GetFormatName(Format format) {\n    switch (format) {\n        case kUnknown_Format:\n            return \u0022Unknown Format\u0022;\n        case kBMP_Format:\n            return \u0022BMP\u0022;\n        case kGIF_Format:\n            return \u0022GIF\u0022;\n ...\n\u0060\u0060\u0060\n\nSo in this case we are returning constants, and no memory is allocated in the C side. But on the other hand, they shouldn\u0027t be deallocated by the C# bindings either.\nThe current binding declaration is:\n\n\u0060\u0060\u0060 c#\n        [DllImport(SKIA, CallingConvention = CallingConvention.Cdecl)]\n        public extern static string sk_imagedecoder_get_format_name_from_decoder(sk_imagedecoder_t cdecoder);\n\u0060\u0060\u0060\n\nAnd accodring to this:\nhttp://stackoverflow.com/questions/370079/pinvoke-for-c-function-that-returns-char\nThis means that the CLR assumes it needs to free the native memory, and that the memory was allocated with CoTaskMemAlloc. None of this is true, in fact, I don\u0027t even know which would be the assumptions in OSX or somewhere else where CoTaskMemAlloc don\u0027t exist. As the CLR will try to free the unmanaged memory, but that memory was a constant (and not allocated with CoTaskMemAlloc), this should crash.\nAnd indeed, if I try:\n\n\u0060\u0060\u0060 C#\n            var ms = new FileStream(\u0022r:\\\\test.png\u0022, FileMode.Open);\n            var mst = new SKManagedStream(ms);\n            SKImageDecoder k = new SKImageDecoder(mst);\n            string s = k.FormatName;\n\u0060\u0060\u0060\n\nThe app crashes.\n\nSo, given that there doesn\u0027t seem to be any example of returning strings in the original bindings, and the new ones don\u0027s seem to work correctly, I think it would be important to determine an standard on how to return strings from the C api. I could add my own function (GetFontName) with my own specification, but then other functions returning strings would be either inconsistent or forced to follow what I did. Functions returning strings shouldn\u0027t be very common in a graphics API, but still I think it is a good thing to have an standard.\nsome ideas:\n1) We could use something similar to MultiByteToWideChar in Windows ( https://msdn.microsoft.com/en-us/library/windows/desktop/dd319072(v=vs.85).aspx )\nIn this case, you would define a function that returns the lenght of the needed buffer and copies characters to the buffer if it is not null. So you call the function 2 times:\n\n\u0060\u0060\u0060 C\n//pseudocode\nGetFontName(\u0026len, NULL);\nmalloc(buffer, len);\nGetFontName(len, buffer);\n\u0060\u0060\u0060\n\nIn the first call you get the size of the needed buffer, then you allocate the buffer and call it again to get the characters copied into the buffer.\n\nProbably the drawback of this is that it is prone to errors, and confessions between char counts and byte counts.\nAs it says on the top of the linked page fro MultiByteToWideChar:\n\n\u003E Caution  Using the MultiByteToWideChar function incorrectly can compromise the security of your application. Calling this function can easily cause a buffer overrun because the size of the input buffer indicated by lpMultiByteStr equals the number of bytes in the string, while the size of the output buffer indicated by lpWideCharStr equals the number of characters. To avoid a buffer overrun, your application must specify a buffer size appropriate for the data type the buffer receives. For more information, see Security \n\nThe advantage is that memory is allocated and freed in the client.\n\n2)We could have the memory allocated in the C api, and require the calling application to call some\nSKIA_FREE(buffer)\nwhen it is done using the buffer.\nIt makes it more difficult to have buffer overflows, but it makes it simpler to forget to call SKIA_FREE and call the standard Free in the client side and cause a crash.\n\n3)We could return SKString objects, which would have to be freed like any other Skia object. But we still would have to determine if the SKString owns the memory or not when you get the string from the Skia object. Given that I don\u0027t expect many methods returning strings, I think creating a SKString wrapper is probably overkill.\n\nThis is what I can think of. Any other ideas?\n",
  "author": {
    "login": "agallero",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2016-04-20T17:32:04",
  "updatedAt": "2022-08-20T06:01:32",
  "closedAt": "2016-05-18T00:48:11",
  "commentCount": 10,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-04T20:32:40.4180042Z",
    "reactions": [],
    "comments": [
      {
        "id": 216035701,
        "author": "agallero",
        "createdAt": "2016-05-01T11:23:13",
        "reactions": []
      },
      {
        "id": 218635588,
        "author": "mattleibow",
        "createdAt": "2016-05-12T01:23:03",
        "reactions": []
      },
      {
        "id": 218641833,
        "author": "agallero",
        "createdAt": "2016-05-12T02:13:53",
        "reactions": []
      },
      {
        "id": 218642081,
        "author": "agallero",
        "createdAt": "2016-05-12T02:16:13",
        "reactions": []
      },
      {
        "id": 218643176,
        "author": "mattleibow",
        "createdAt": "2016-05-12T02:25:22",
        "reactions": []
      },
      {
        "id": 218643329,
        "author": "mattleibow",
        "createdAt": "2016-05-12T02:26:42",
        "reactions": []
      },
      {
        "id": 218644104,
        "author": "mattleibow",
        "createdAt": "2016-05-12T02:32:48",
        "reactions": []
      },
      {
        "id": 218644248,
        "author": "mattleibow",
        "createdAt": "2016-05-12T02:33:55",
        "reactions": []
      },
      {
        "id": 218644675,
        "author": "mattleibow",
        "createdAt": "2016-05-12T02:36:47",
        "reactions": []
      },
      {
        "id": 218645138,
        "author": "mattleibow",
        "createdAt": "2016-05-12T02:40:22",
        "reactions": []
      }
    ]
  }
}