{
  "number": 71,
  "type": "issue",
  "state": "closed",
  "title": "React to user input",
  "body": "I am not sure if this is meant to be part of SkiaSharp, but I was searching through the docs about a way to actually react to user input such as touch gestures.\nReason being, I would like to convert my android drawing app to use shiasharp instead of the drawing canvas api in order to make it kinda platform independant.\n\nAre there any plans to introduce such features at any time? Or are they already there and I missed them?\n\nSorry for not asking in stackoverflow - I was not sure if you guys would read it there...\n\nThank you so much for clarifying things!\n",
  "author": {
    "login": "gentledepp",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2016-04-29T19:54:58",
  "updatedAt": "2022-08-20T06:01:29",
  "closedAt": "2016-05-13T15:40:47",
  "commentCount": 2,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T13:52:07.61815Z",
    "reactions": [],
    "comments": [
      {
        "id": 216998853,
        "author": "rocuh",
        "body": "I written a bit more extensive container than the one in the demo app for SkiaSharp here: https://github.com/roceh/MycoLayout\n\nHas a few gestures for the \u0027skia controls\u0027, pan, tap and horizontal swipe. \n",
        "createdAt": "2016-05-04T20:51:17",
        "reactions": []
      },
      {
        "id": 219080473,
        "author": "mattleibow",
        "body": "Hi @gentledepp,\n\nI don\u0027t think we will be adding support for this as is not the goal of Skia. Skia and SkiaSharp are drawing libraries. User interaction is both platform and device dependent, as a result it will be a large undertaking and veer off target.\n\nHowever, a user interaction library based on Skia is totally fine. Examples like the one above may exist.\n",
        "createdAt": "2016-05-13T15:40:47",
        "reactions": [
          {
            "user": "LijoCheeran",
            "content": "\u002B1",
            "createdAt": "2026-02-06T13:52:07.567704Z"
          }
        ]
      }
    ]
  }
}