{
  "number": 717,
  "type": "issue",
  "state": "closed",
  "title": "GPU based Offscreen rendering in windows desktop app",
  "body": "### Description\r\n\r\nImagine n SKGLControls \u002B m OffScreenRenderings yielding SKImages with n, m in N°.\r\nIs there a way of having the OffScreenRenderings GPU accelerated on a Windows Desktop application?\r\n\r\nI thought maybe for that we need ANGLE or Vulkan Backends for that, but unsure why the OpenGL would not deliver the expected performance. Then again I am not so familiar with OpenGL and on how to handle MakeCurrent OpenGL calls. Can I expect a performance boost when using those two fancy backends?\r\n\r\nThe updates on these two threads look promising! Big up!\r\n#243 !  \r\n#252\r\n\r\nMaybe related:\r\n#688 ",
  "author": {
    "login": "gregsn",
    "type": "User"
  },
  "labels": [
    {
      "name": "type/question",
      "color": "daffa8"
    },
    {
      "name": "os/Windows-Classic",
      "color": "fbca04"
    },
    {
      "name": "backend/OpenGL",
      "color": "1acea7"
    }
  ],
  "assignees": [],
  "createdAt": "2018-12-06T23:15:58",
  "updatedAt": "2022-08-19T12:02:21",
  "closedAt": "2019-01-16T19:45:38",
  "commentCount": 2,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T14:05:46.9061793Z",
    "reactions": [],
    "comments": [
      {
        "id": 445126386,
        "author": "mattleibow",
        "body": "It should be possible, see https://github.com/mono/SkiaSharp/issues/688.\r\n\r\nBasically, the GL controls create their own OpenGL context for rendering. If you want to do independent off-screen rendering, you need to create your own OpenGL context and start drawing on a new surface. I do that as part of my unit tests for GPU: https://github.com/mono/SkiaSharp/blob/master/tests/Tests/GlContexts/Wgl/WglContext.cs\r\n\r\nAt this time, the Vulkan and Metal backends are not yet implemented, nor feature complete. ANGLE is really only implemented on UWP because OpenGL works fine on the Win32/desktop world.",
        "createdAt": "2018-12-07T05:23:48",
        "reactions": []
      },
      {
        "id": 454914042,
        "author": "mattleibow",
        "body": "Closing this as the question has been answered: Yes, offscreen drawing is a thing that can be done. OpenGL should be fine as it is a Windows feature. ANGLE/Vulkan may not have that much of an improvement.\r\n\r\nIssue #688 has code for iOS and UWP, but you could have a look at other Windows implementations - such as what they do for OpenTK or at the SkiaSharp Windows tests: https://github.com/mono/SkiaSharp/blob/master/tests/Tests/GlContexts/Wgl/WglContext.cs",
        "createdAt": "2019-01-16T19:45:38",
        "reactions": []
      }
    ]
  }
}