{
  "number": 725,
  "type": "issue",
  "state": "closed",
  "title": "Improved Obsolete Support",
  "body": "The issue was created by @mattleibow from https://github.com/MicrosoftDocs/feedback/issues/719\r\nProblem 1\r\nI think the support for displaying obsolete information could be improved a bit to more clearly indicate what is obsolete and what is the next step.\r\nFor example, take a look at this page:\r\nhttps://docs.microsoft.com/en-us/dotnet/api/skiasharp.skpicture.bounds?view=skiasharp-1.59.3\r\n\r\nRight now, all I see is the big obsolete warning and I get scared. What should I do? Where do I go? Is Microsoft killing Silverlight and Windows Phone? 😉\r\nBecause I am an expert, my eyes scroll to the code block and read the attribute text, and all is well. It appears that I need to use the new property.\r\nSolution 1 - A\r\nThe first step might be to just copy the text from the attribute into the warning box. This might be a quick and easy fix for most APIs. We could even hide that with a flag in the configuration.\r\nSolution 1 - B\r\nThere might be a way to actually add some \u0022obsolete warning\u0022 documentation somewhere...\r\nProblem 2\r\nAnother issue with the docs is that at the type or namespace level, I cannot see what is obsolete and thus have to click through:\r\n\r\nSpot the obsolete property! You can\u0027t!\r\nSolution 2\r\nBut I have serious HTML/CSS foo (I don\u0027t actually) and whipped this up:\r\n\r\nIf we have a look at what apple does:\r\n\r\nWe know what not to do... We shouldn\u0027t create a new section and then relocate all the members. This makes life hard for everyone. Then again, this will decrease the likelihood of someone using the members if they have to scroll all the way to the bottom.\r\n\u003Cdiscussion commences\u003E\r\n",
  "author": {
    "login": "Powerhelmsman",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2018-12-11T22:29:57",
  "updatedAt": "2022-08-19T12:02:14",
  "closedAt": "2018-12-11T22:31:59",
  "commentCount": 0,
  "reactionCount": 0
}