{
  "number": 853,
  "type": "issue",
  "state": "open",
  "title": "SKTouchAction.Moved is too sensitive on the actual device vs using a mouse with simulator.",
  "body": "Not sure if this is a bug or the desired behavior of the Touch events on the Canvas but here is what is happening. If it is the desired behavior, I could use a workaround. \r\n\r\nI have a SKCanvas View. In the Touch event I am doing a couple of things to determine if the user is resizing, or panning, etc. I am relying on the SKTouchAction.Moved to help with this. It works perfectly for me whenever I use a mouse, (i.e. the SKTouchAction.Moved only matches if I click and hold and move the mouse), however if I deploy to my IOS device (IOS Xs Max) everytime I touch the screen and the touch event fires, the SKTouchAction.Moved is matched which is not what I would expect unless I keep my finger down. Even if I tap extremely fast it still matches that action type.  Is there anyway to throttle the sensitivity of the Moved action type? \r\n\r\nJust further info on what I am trying to achieve:\r\nI created a custom SKCanvas by inheriting from it and then adding Pinch, Pan and Tap Gesture Recognizers and I handle all of the panning and zooming internal to this component. Then, \r\nin the normal Touch event handler I need to know when certain regions of the canvas have been touched, which I have working nicely and I perform my desired actions when the correct location is touched. However I need to make sure I don\u0027t do this if the user is double tapping, panning or zooming. To achieve this in the SKCanvas.Touch event, I match on the Pressed actionType first and then start a timer. If another press occurs within 300 milliseconds I disregard the initial tap because this is a double tap and that works just fine. Also if the Moved actionType matches I update a flag so that when the timer fires it will not perform the action of the single tap since a resize or pan is occurring. But as stated above, any touch with my finger causes the Moved actionType to be matched just after the Pressed actionType is matched which breaks my desired functionality. This does not happen when using the mouse in the simulator. I am guessing it has something to do with the size of the area on the device being touched?\r\n\r\nThanks in advance. \r\n\r\nBilly Jacobs\r\n",
  "author": {
    "login": "billyjacobs2014",
    "type": "User"
  },
  "labels": [
    {
      "name": "type/question",
      "color": "daffa8"
    }
  ],
  "assignees": [],
  "createdAt": "2019-05-28T19:28:53",
  "updatedAt": "2021-09-07T07:55:52",
  "commentCount": 4,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T14:24:00.8598798Z",
    "reactions": [],
    "comments": [
      {
        "id": 498669558,
        "author": "billyjacobs2014",
        "body": "Is it normal that questions don\u0027t get responded to for a week?",
        "createdAt": "2019-06-04T13:23:06",
        "reactions": []
      },
      {
        "id": 498697557,
        "author": "Gillibald",
        "body": "Is it normal that this is community driven? ",
        "createdAt": "2019-06-04T14:32:03",
        "reactions": []
      },
      {
        "id": 795115723,
        "author": "anpin",
        "body": "I\u0027m having exactly the same issue here. Made tap, double tap and pan handlers inside OnTouch override and they work fine in the simulator, but on the actual device (Android and iOS) SKTouchAction. Moved is always called right after SKTouchAction.Pressed even if I\u0027m trying not to move my finger.",
        "createdAt": "2021-03-10T09:02:07",
        "reactions": []
      },
      {
        "id": 914078055,
        "author": "EmmanuelJego",
        "body": "I had the same issue. My workaround was to call a function to check, within the \u0060SKTouchAction.Moved\u0060 switch case, if a move is actually a tap:\r\n\u0060\u0060\u0060\r\nprivate bool CheckIsTap(SKPoint pt)\r\n{\r\n    return _startMovePoint != null \r\n       \u0026\u0026 _startMoveTime != null \r\n       \u0026\u0026 SKPoint.Distance(pt, _startMovePoint) \u003C 20 \r\n       \u0026\u0026 (DateTime.Now - _startMoveTime).TotalMilliseconds \u003C 100;\r\n}\r\n\u0060\u0060\u0060\r\n\u0060_startMovePoint \u0060 and \u0060_startMoveTime\u0060 being the location and time of the tap event triggered just before the move event.",
        "createdAt": "2021-09-07T07:55:52",
        "reactions": [
          {
            "user": "anpin",
            "content": "\u002B1",
            "createdAt": "2026-02-06T14:24:00.8107607Z"
          }
        ]
      }
    ]
  }
}