{
  "number": 924,
  "type": "issue",
  "state": "closed",
  "title": "[QUESTION] Question about SkiaSharp NuGet package.",
  "body": "Why there are both runtimes\\osx and lib\\Xamarin.Mac20? I mean Xamarin.Mac can be covered by .NET Standard and the appropriate runtime - looks like duplication. Correct me if I am wrong. The same applies to other Xamarin libraries provided in the package. Will not it be more correct to provide .NET Standard library and appropriate native skia libraries in runtimes?\r\nhttps://github.com/dotnet/standard/blob/master/docs/versions.md\r\nAccording to the table .NET Standard 1.3 covers Xamarin.iOS 10.0 and higher, Xamarin.Android 7.0 and higher and Xamarin.Mac 3.0 and higher. Is not the purpose of .NET Standard to share code between all these platforms?\r\n",
  "author": {
    "login": "AlexNosk",
    "type": "User"
  },
  "labels": [],
  "assignees": [],
  "createdAt": "2019-08-02T07:42:59",
  "updatedAt": "2022-08-19T09:02:40",
  "closedAt": "2019-12-26T13:23:31",
  "commentCount": 1,
  "reactionCount": 0,
  "engagement": {
    "syncedAt": "2026-02-06T14:08:18.6341331Z",
    "reactions": [],
    "comments": [
      {
        "id": 569057955,
        "author": "mattleibow",
        "body": "You are correct that .NET Standard works on Mac. However the runtimes folder sadly only applies to netcoreapp.\r\nIt results in issues like this: https://github.com/xamarin/xamarin-macios/issues/6065\r\n\r\nRight now, the Xamarin.Mac library has special attributes and embedded files that the toolchain know to extract and link. This goes for all the Xamarin platforms. The reason for this is that Xamarin was doing native files long before .NET Core was even a thing. As a result, there was a fair amount of differences - especially around native things. As .NET Core matures and gains the required features, things like this will start to disappear.\r\n\r\nI am working with the .NET teams on these issues for all the platforms. I am hoping this will be addressed with .NET 5 later next year.",
        "createdAt": "2019-12-26T13:23:31",
        "reactions": []
      }
    ]
  }
}